{
  "Mountain Climbers": {
    "description": {
      "overview": "A dynamic full-body exercise performed in plank position, alternately driving knees toward chest in a running motion. Builds cardiovascular endurance while strengthening core, shoulders, and hip flexors.",
      "setup": "Start in high plank position, hands shoulder-width apart directly under shoulders. Body forms straight line from head to heels, core engaged.",
      "movement": "Drive one knee toward chest while keeping other leg extended. Quickly switch legs in alternating pattern, maintaining plank position throughout.",
      "cues": "Hips level with shoulders, quick feet, breathe rhythmically, shoulders over hands"
    }
  },
  "Burpees": {
    "description": {
      "overview": "A high-intensity full-body exercise combining a squat thrust, plank, and jump. One of the most effective exercises for conditioning, working every major muscle group while building explosive power.",
      "setup": "Stand with feet shoulder-width apart, arms at sides. Prepare to move through multiple positions fluidly.",
      "movement": "Squat down, place hands on floor. Jump feet back to plank. Optional push-up. Jump feet to hands. Explosively jump up with arms overhead.",
      "cues": "Land softly, chest touches floor in push-up, full hip extension at top, maintain rhythm"
    }
  },
  "Jump Squats": {
    "description": {
      "overview": "An explosive plyometric exercise combining a bodyweight squat with a vertical jump. Develops lower body power, improves athletic performance, and builds strength in quads, glutes, and calves.",
      "setup": "Feet shoulder-width apart, toes slightly turned out. Arms at sides or in front for balance. Core braced.",
      "movement": "Lower into squat position, hips back and down. From bottom position, explosively drive through feet to jump vertically. Land softly back into squat position.",
      "cues": "Explode through heels, reach for ceiling, land toe-ball-heel, absorb landing with bent knees"
    }
  },
  "Plank Hold": {
    "description": {
      "overview": "A foundational isometric core exercise holding the body rigid in a straight line. Builds core stability, shoulder endurance, and teaches proper bracing for other exercises.",
      "setup": "Forearms on ground, elbows under shoulders. Feet together or hip-width apart. Body forms straight line from head to heels.",
      "movement": "Hold position while breathing normally. Maintain neutral spine throughout. Engage core, glutes, and quads to prevent sagging.",
      "cues": "Push floor away with forearms, tuck pelvis slightly, breathe into belly, squeeze everything"
    }
  },
  "Side Plank": {
    "description": {
      "overview": "An isometric lateral core exercise targeting obliques and lateral stabilizers. Essential for developing anti-lateral flexion strength and protecting the spine during loaded movements.",
      "setup": "Lie on side, elbow under shoulder. Stack or stagger feet. Bottom forearm perpendicular to body.",
      "movement": "Lift hips to create straight line from head to feet. Hold position while breathing normally. Keep hips stacked, don't rotate.",
      "cues": "Push floor away with elbow, lift hips to ceiling, long straight line, engage everything"
    }
  },
  "Single-Leg Stands": {
    "description": {
      "overview": "A unilateral balance exercise standing on one foot. Improves proprioception, strengthens stabilizing muscles, and enhances balance for injury prevention.",
      "setup": "Stand tall, weight on one foot. Lift other foot slightly off ground. Arms out for balance or at sides for challenge.",
      "movement": "Hold position on single leg. Keep standing knee slightly bent. Maintain upright posture. Switch legs after time.",
      "cues": "Grip floor with toes, soft knee, tall spine, focus on fixed point"
    }
  },
  "Push-ups": {
    "description": {
      "overview": "A fundamental bodyweight pushing exercise performed prone. Builds upper body strength and endurance while developing core stability and teaching proper pressing mechanics.",
      "setup": "High plank position, hands slightly wider than shoulders. Fingers spread, pointing forward. Body straight from head to heels.",
      "movement": "Lower body as one unit until chest nearly touches floor. Press back to start, maintaining rigid plank throughout.",
      "cues": "Elbows 45 degrees, screw hands into floor, tight core, push floor away"
    }
  },
  "Pull-ups": {
    "description": {
      "overview": "A vertical pulling exercise lifting body weight to a bar. The gold standard for upper body pulling strength, targeting lats, biceps, and upper back.",
      "setup": "Hang from bar with overhand grip slightly wider than shoulders. Arms fully extended. Core engaged, legs together.",
      "movement": "Pull body up until chin clears bar. Control descent to full arm extension. Minimize swinging throughout.",
      "cues": "Pull elbows to ribs, chest to bar, squeeze at top, control the negative"
    }
  },
  "strength Squats": {
    "description": {
      "overview": "A bodyweight squat variation focusing on strength development through controlled tempo and proper form. Builds foundational lower body strength patterns.",
      "setup": "Feet shoulder-width apart, toes slightly out. Arms extended forward for counterbalance. Core braced, chest up.",
      "movement": "Push hips back and down, knees tracking toes. Descend until thighs parallel or below. Drive through heels to return.",
      "cues": "Knees out, weight in heels, chest proud, squeeze glutes at top"
    }
  },
  "Tricep Dips": {
    "description": {
      "overview": "A bodyweight pressing exercise targeting triceps using a bench or chair. Builds arm strength and teaches lockout mechanics for pressing movements.",
      "setup": "Hands on edge of bench behind you, fingers forward. Legs extended or bent. Shoulders down and back.",
      "movement": "Lower body by bending elbows to 90 degrees. Press through palms to return to start. Keep elbows tracking backward.",
      "cues": "Elbows back not out, shoulders away from ears, control the descent, squeeze triceps at top"
    }
  },
  "Glute Bridges": {
    "description": {
      "overview": "A supine hip extension exercise targeting glutes and hamstrings. Fundamental movement for developing posterior chain strength and teaching hip drive.",
      "setup": "Lie on back, knees bent, feet flat near glutes. Arms at sides. Core engaged, lower back neutral.",
      "movement": "Drive through heels to lift hips until body forms straight line from knees to shoulders. Squeeze glutes at top. Lower with control.",
      "cues": "Push floor away with feet, tuck pelvis at top, pause and squeeze, maintain neutral spine"
    }
  },
  "Bench Press": {
    "description": {
      "overview": "A horizontal pushing movement performed lying on a bench, pressing weight from chest to full arm extension. Primary upper body strength exercise targeting chest, shoulders, and triceps.",
      "setup": "Eyes under bar, shoulder blades pinched, slight arch. Grip wider than shoulders, wrists straight.",
      "movement": "Unrack with control, lower bar to nipple line with elbows 45°. Pause briefly, press straight up.",
      "cues": "Pull bar apart, tuck elbows, press yourself into bench, bar travels straight line"
    }
  },
  "Deadlift": {
    "description": {
      "overview": "A hip-hinge movement lifting weight from the floor to hip level in one motion. The king of compound exercises, working nearly every muscle in the body with emphasis on posterior chain.",
      "setup": "Bar over mid-foot, shins touching bar. Hinge at hips, grab bar outside legs, chest up.",
      "movement": "Drive legs through floor while pulling chest up. Bar stays close to body. Lock out with glutes, not back.",
      "cues": "Leg press the floor, drag bar up body, hips through at top, shoulders over bar"
    }
  },
  "Back Squat": {
    "description": {
      "overview": "A fundamental lower body compound movement with barbell on upper back. The king of leg exercises, building strength and mass in quads, glutes, and entire lower body.",
      "setup": "Bar on upper traps, feet shoulder-width apart, toes slightly out. Brace core, chest up, elbows under bar.",
      "movement": "Push hips back first, knees track over toes. Descend until hip crease below knee. Drive through heels to stand.",
      "cues": "Big breath and brace, spread the floor, drive hips up, maintain back angle out of hole"
    }
  },
  "Overhead Press": {
    "description": {
      "overview": "A vertical pressing movement from shoulders to overhead. Builds functional upper body strength, shoulder stability, and core strength through full-body tension.",
      "setup": "Bar in front rack, hands just outside shoulders. Elbows slightly forward, core tight, glutes squeezed.",
      "movement": "Press bar straight up, moving head through as bar passes face. Lock out directly over shoulders. Return with control.",
      "cues": "Squeeze glutes hard, push head through window, bar path straight, shrug at top"
    }
  },
  "Bent-Over Row": {
    "description": {
      "overview": "A horizontal pulling movement in hinged position. Essential for back development, building thickness through lats, rhomboids, and middle back while strengthening posterior chain.",
      "setup": "Hinge at hips, bar hanging at arm's length. Back straight, core braced. Grip slightly wider than shoulders.",
      "movement": "Pull bar to lower chest/upper abdomen. Squeeze shoulder blades together. Lower with control maintaining position.",
      "cues": "Elbows lead the pull, chest proud, squeeze oranges in armpits, maintain hip hinge"
    }
  },
  "Romanian Deadlift": {
    "description": {
      "overview": "A hip-hinge movement emphasizing eccentric hamstring strength. Teaches proper hinge mechanics while building posterior chain strength with constant tension.",
      "setup": "Bar at hip level, feet hip-width apart. Soft knee bend maintained throughout. Shoulders back, lats engaged.",
      "movement": "Push hips back while lowering bar down legs. Maintain flat back. Feel stretch in hamstrings. Drive hips forward to return.",
      "cues": "Hips back not down, drag bar down thighs, chest proud, squeeze glutes to finish"
    }
  },
  "Hip Thrusts": {
    "description": {
      "overview": "A loaded hip extension exercise with back supported on bench. The premier glute-building exercise, allowing heavy loading of hip extension pattern.",
      "setup": "Upper back on bench, bar in hip crease with pad. Feet flat, knees at 90° at top. Chin tucked.",
      "movement": "Drive through heels to thrust hips up. Achieve full hip extension with posterior pelvic tilt. Lower with control.",
      "cues": "Drive through heels, ribs down, big squeeze at top, control the negative"
    }
  },
  "Bulgarian Split Squats": {
    "description": {
      "overview": "A unilateral leg exercise with rear foot elevated. Builds single-leg strength, addresses imbalances, and improves hip mobility while challenging balance.",
      "setup": "Rear foot on bench behind you. Front foot forward in lunge stance. Torso upright, core engaged.",
      "movement": "Lower straight down bending both knees. Front knee tracks over toes. Drive through front heel to return.",
      "cues": "Vertical torso, knee tracks toes, push floor away, feel it in front glute"
    }
  },
  "Incline Bench Press": {
    "description": {
      "overview": "An angled pressing movement targeting upper chest. Bridges the gap between flat bench and overhead pressing, building complete chest development.",
      "setup": "Bench at 30-45° incline. Similar setup to flat bench but bar touches higher on chest. Maintain arch and leg drive.",
      "movement": "Lower bar to upper chest with control. Press back up and slightly back toward face. Keep shoulder blades retracted.",
      "cues": "Bar to upper chest, press back not just up, maintain arch, drive feet into floor"
    }
  },
  "Low Bar Squat": {
    "description": {
      "overview": "A powerlifting squat variation with bar positioned on rear delts. Maximizes hip drive and posterior chain involvement, allowing heavier loads than high bar position.",
      "setup": "Bar on rear delts, wider grip than high bar. More forward lean required. Feet wider, toes out more.",
      "movement": "Break at hips first with more forward lean. Maintain hip drive throughout. Depth just below parallel. Drive hips forward to stand.",
      "cues": "Hips back first, maintain back angle, hip drive out of hole, elbows under bar"
    }
  },
  "Z Press": {
    "description": {
      "overview": "A seated overhead press with legs extended on floor. Eliminates leg drive and lower back compensation, demanding exceptional core strength and shoulder mobility.",
      "setup": "Sit on floor, legs straight out. Bar in front rack position. Core maximally braced, tall spine.",
      "movement": "Press bar overhead without leaning back. Maintain upright torso throughout. Lock out directly overhead.",
      "cues": "Legs straight and together, abs on fire, press straight up, no lean back"
    }
  },
  "Paused Squat": {
    "description": {
      "overview": "A squat variation with deliberate pause at bottom position. Builds strength out of the hole, reinforces proper position, and eliminates bounce reflex.",
      "setup": "Standard squat setup for your preferred style. Mental preparation for pause crucial.",
      "movement": "Descend with control to bottom position. Hold for 2-3 count maintaining tension. Drive up explosively after pause.",
      "cues": "Stay tight in pause, count one-thousand-one, explode up, maintain position"
    }
  },
  "Push Press": {
    "description": {
      "overview": "An explosive overhead press using leg drive for momentum. Builds power, allows heavier loads overhead, and teaches full-body coordination.",
      "setup": "Bar in front rack, feet hip-width. Elbows slightly forward. Ready to dip and drive.",
      "movement": "Quick dip by bending knees, explosive drive up. Press out as bar passes forehead. Lock out overhead.",
      "cues": "Dip straight down, violent hip drive, press through the momentum, quick under bar"
    }
  },
  "Weighted Chin/Pull-Ups": {
    "description": {
      "overview": "Pull-ups or chin-ups with added external load. The ultimate test of relative strength, building exceptional back and arm development.",
      "setup": "Weight belt with plates or dumbbell between feet. Dead hang start, grip of choice.",
      "movement": "Pull up smoothly without swinging weight. Chin over bar at top. Control the loaded negative.",
      "cues": "Minimize swing, pull through elbows, squeeze at top, own the negative"
    }
  },
  "Walking Lunges": {
    "description": {
      "overview": "A dynamic unilateral leg exercise moving forward with each rep. Builds leg strength, improves balance, and enhances functional movement patterns.",
      "setup": "Standing tall, weights at sides or in front rack. Core engaged, eyes forward.",
      "movement": "Step forward into lunge, both knees to 90°. Drive through front heel to step forward. Alternate legs.",
      "cues": "Long steps, vertical torso, knee tracks toe, push through front heel"
    }
  },
  "Curtsy Lunges": {
    "description": {
      "overview": "A lunge variation crossing back leg behind like a curtsy. Targets glutes and outer thighs while challenging balance and hip mobility.",
      "setup": "Standing with weights, feet hip-width. Core tight for balance.",
      "movement": "Step one leg back and across behind other leg. Lower into curtsy position. Drive up through front leg.",
      "cues": "Cross behind not just back, feel outer glute, keep hips square, control the motion"
    }
  },
  "Lateral Lunges": {
    "description": {
      "overview": "A side-stepping lunge targeting adductors and glutes. Builds lateral strength and mobility often neglected in sagittal plane movements.",
      "setup": "Wide stance start or step out wide. Weights at chest or sides. Toes slightly out.",
      "movement": "Shift weight to one side, bending that knee. Other leg stays straight. Push back to start.",
      "cues": "Sit back into hip, straight leg stays straight, push through bent leg, chest up"
    }
  },
  "Kettlebell Swings": {
    "description": {
      "overview": "A ballistic hip hinge movement using momentum. The king of posterior chain power exercises, building explosive hip drive and conditioning.",
      "setup": "Feet wider than shoulders, kettlebell arm's length front. Hinge to grab handle, shoulders back.",
      "movement": "Hike kettlebell back between legs. Explosive hip drive forward. Float kettlebell to shoulder height. Repeat rhythm.",
      "cues": "Hips do the work, float don't lift, snap hips, breathing matches rhythm"
    }
  },
  "High Bar Squat": {
    "description": {
      "overview": "Olympic-style squat with bar high on traps. Emphasizes quadriceps development with upright torso position, allowing deeper range of motion.",
      "setup": "Bar on upper traps, narrower grip. Feet shoulder-width, moderate toe angle. Upright torso position.",
      "movement": "Descend straight down between legs. Maintain upright torso. Hit maximum depth. Drive straight up.",
      "cues": "Elbows under bar, knees forward is OK, bounce out of hole, stay upright"
    }
  },
  "Front Squat": {
    "description": {
      "overview": "A squat variation with bar in front rack position. Demands tremendous core strength and thoracic mobility while maximizing quadriceps activation.",
      "setup": "Bar in front rack, elbows high. Clean grip or cross-arm grip. Feet slightly narrower than back squat.",
      "movement": "Descend straight down maintaining high elbows. Extreme upright position required. Drive up maintaining rack position.",
      "cues": "Elbows up up up, sit straight down, abs on fire, drive straight up"
    }
  },
  "SSB Squat": {
    "description": {
      "overview": "Squat using safety squat bar with handles. Combines benefits of front and back squat, easier on shoulders while challenging upper back.",
      "setup": "Bar sits on traps with pad, hold handles forward. More upright than low bar. Feet at preferred width.",
      "movement": "Descend with slight forward lean. Handles pull you forward, fight to stay upright. Drive up maintaining position.",
      "cues": "Fight the forward pull, big breath and brace, maintain tightness, push the floor"
    }
  },
  "Box Squats": {
    "description": {
      "overview": "Squat to seated position on box before standing. Teaches proper depth, eliminates stretch reflex, and builds explosive strength from dead stop.",
      "setup": "Box at parallel or below, bar position of choice. Wider stance typically used. Vertical shins goal.",
      "movement": "Sit back to box maintaining tension. Brief pause without relaxing. Explode up from static position.",
      "cues": "Sit back not down, stay tight on box, explode off box, vertical shins"
    }
  },
  "Terminal Knee Extensions": {
    "description": {
      "overview": "A rehabilitation exercise targeting VMO and terminal knee extension. Builds strength in final degrees of extension, crucial for knee health.",
      "setup": "Band around knee, anchored behind. Slight knee bend start position. Weight on working leg.",
      "movement": "Extend knee fully against band resistance. Hold brief contraction. Return to slight bend. Focus on VMO.",
      "cues": "Full extension, squeeze quad hard, feel inside knee, controlled tempo"
    }
  },
  "Step-Ups": {
    "description": {
      "overview": "A unilateral exercise stepping onto elevated surface. Builds single-leg strength, addresses imbalances, and mimics real-world movement patterns.",
      "setup": "Box at knee height or below. Full foot on box. Weights at sides or front rack.",
      "movement": "Drive through elevated foot to stand on box. Control the descent. Minimal push from bottom leg.",
      "cues": "Push through top foot, control down, no bouncing, full foot on box"
    }
  },
  "Calf Raises": {
    "description": {
      "overview": "An isolation exercise for calf development. Targets gastrocnemius and soleus muscles through plantar flexion movement pattern.",
      "setup": "Balls of feet on edge or block. Heels hanging off. Weight in hands or on shoulders.",
      "movement": "Rise up onto toes as high as possible. Pause at peak contraction. Lower slowly for stretch.",
      "cues": "Full range of motion, pause at top, slow negative, feel the stretch"
    }
  },
  "Russian Twists": {
    "description": {
      "overview": "A rotational core exercise performed in V-sit position. Builds oblique strength and rotational power for athletic performance.",
      "setup": "Seated, lean back to V position. Feet elevated or grounded. Weight held at chest.",
      "movement": "Rotate weight side to side, touching ground. Maintain V position throughout. Control the rotation speed.",
      "cues": "Chest follows weight, maintain V angle, breathe through rotation, control tempo"
    }
  },
  "Reverse Lunges": {
    "description": {
      "overview": "A lunge variation stepping backward instead of forward. Easier on knees than forward lunges while effectively targeting quads and glutes.",
      "setup": "Standing tall, weights at sides or front rack. Core engaged for balance.",
      "movement": "Step back into lunge position. Both knees to 90 degrees. Drive through front heel to return.",
      "cues": "Step back far enough, vertical torso, push through front heel, control the movement"
    }
  },
  "Renegade Rows": {
    "description": {
      "overview": "A combination plank and row exercise. Builds anti-rotation core strength while developing back, challenging total body stability.",
      "setup": "High plank position with hands on dumbbells. Wide foot stance for stability. Rigid body position.",
      "movement": "Row one dumbbell to hip while maintaining plank. Resist rotation. Lower with control. Alternate sides.",
      "cues": "Hips stay level, pull elbow high, fight rotation, breathe through reps"
    }
  },
  "Belt Squat": {
    "description": {
      "overview": "A squat variation loading weight through hips via belt. Removes spinal loading while maximizing leg development, ideal for back-friendly training.",
      "setup": "Belt around hips, attached to load. Wide stance typical. Hands for balance only.",
      "movement": "Squat down allowing knees to track naturally. No spinal load to manage. Drive up through legs only.",
      "cues": "Sit back and down, let knees travel, feel it in legs only, use full range"
    }
  },
  "Split Squat": {
    "description": {
      "overview": "A stationary lunge position exercise. Builds unilateral strength in stable position, excellent for addressing imbalances and building leg strength.",
      "setup": "Split stance, back foot on toes. Front shin vertical at bottom. Weights at sides or front rack.",
      "movement": "Lower straight down, both knees to 90°. Drive through front heel to rise. Stay in split stance throughout.",
      "cues": "Vertical drop, weight on front leg, back leg for balance, controlled tempo"
    }
  },
  "Paused Bench": {
    "description": {
      "overview": "A bench press with mandatory pause on chest. Competition standard movement eliminating bounce, building strength through full range.",
      "setup": "Standard bench press setup. Mental preparation for pause. Judge's commands in competition.",
      "movement": "Lower bar with control to chest. Hold complete pause. Press on command or after count. No heaving.",
      "cues": "Sink the bar, stay tight in pause, press command, maintain arch"
    }
  },
  "Close Grip Bench": {
    "description": {
      "overview": "A bench press variation with narrow grip. Emphasizes triceps development while maintaining chest involvement, excellent for lockout strength.",
      "setup": "Grip inside shoulder width, index fingers on smooth. Same bench setup otherwise. Elbows tucked more.",
      "movement": "Lower bar to lower chest position. Elbows stay close to body. Press straight up focusing on triceps.",
      "cues": "Elbows in tight, bar lower on chest, triceps do work, control the weight"
    }
  },
  "Spoto Bench": {
    "description": {
      "overview": "A bench press stopping 2-3 inches above chest. Eliminates stretch reflex and builds strength in sticking point, named after champion powerlifter.",
      "setup": "Standard bench setup. Spotter recommended for safety. Mental cue for stopping point.",
      "movement": "Lower bar stopping 2-3 inches from chest. Pause briefly. Press from dead stop. Never touch chest.",
      "cues": "Stop above chest, no bounce available, pause and press, constant tension"
    }
  },
  "JM Press": {
    "description": {
      "overview": "A hybrid between close-grip bench and tricep extension. Maximizes triceps involvement while maintaining heavy loading potential.",
      "setup": "Close grip on bar, lying on bench. Bar starts over lower chest. Elbows will travel forward.",
      "movement": "Lower bar toward face/neck while elbows drift forward. Reverse to press back over lower chest.",
      "cues": "Elbows forward, bar to face, press back not up, feel massive tricep stretch"
    }
  },
  "Dumbbell Squat to Press (Interval)": {
    "description": {
      "overview": "High-intensity combination exercise performed for time. Builds cardiovascular fitness and full-body strength endurance.",
      "setup": "Dumbbells at shoulders in athletic stance. Ready for continuous movement during timed intervals.",
      "movement": "Squat down, drive up explosively pressing dumbbells overhead. Continuous rhythm for prescribed time.",
      "cues": "Smooth transitions, use leg drive, breathe with movement, maintain pace under fatigue"
    }
  },
  "Mountain Climbers (Interval)": {
    "description": {
      "overview": "High-intensity cardio exercise in plank position performed for time intervals. Builds conditioning, core strength, and mental toughness through sustained effort.",
      "setup": "High plank position, ready for rapid leg movement. Mental prep for sustained intensity.",
      "movement": "Drive knees to chest alternately at maximum sustainable pace. Maintain plank integrity throughout interval.",
      "cues": "Quick feet, hips low, breathe steadily, push through burn"
    }
  },
  "Tabata Push-ups": {
    "description": {
      "overview": "Push-ups performed in Tabata protocol (20 seconds work, 10 seconds rest, 8 rounds). Builds muscular endurance.",
      "setup": "Standard push-up position. Mental preparation for 8 rounds of maximum effort work.",
      "movement": "Maximum push-ups for 20 seconds, rest 10 seconds. Repeat 8 times. Maintain form under fatigue.",
      "cues": "All-out effort, quick rest, form over speed when tired, embrace the burn"
    }
  },
  "Burpee HIIT Intervals": {
    "description": {
      "overview": "High-intensity burpees with specified rep counts and rest periods. Ultimate conditioning exercise building total-body power endurance.",
      "setup": "Clear space for explosive movement. Mental preparation for high-intensity work.",
      "movement": "Complete prescribed burpee reps explosively. Rest as indicated. Maintain quality through fatigue.",
      "cues": "Explosive reps, full range, quick transitions, earn your rest"
    }
  },
  "Triple Cardio Circuit": {
    "description": {
      "overview": "Three different cardio machines performed in sequence for time. Builds aerobic capacity through varied movement patterns preventing adaptation.",
      "setup": "Three stations ready - typically stair master, rower, assault bike. Quick transitions planned.",
      "movement": "5 minutes hard effort each station. Minimal transition time. Sustained effort throughout 15 minutes.",
      "cues": "Steady pace, smooth transitions, different muscles each station, finish strong"
    }
  },
  "Kettlebell Swing Intervals": {
    "description": {
      "overview": "Explosive kettlebell swings performed for specific rep counts with timed rest. Builds posterior chain power endurance and grip strength.",
      "setup": "Kettlebell ready, athletic stance. Breathing pattern established for work periods.",
      "movement": "Explosive swings for prescribed reps. Rest as indicated. Maintain hip snap throughout all intervals.",
      "cues": "Aggressive hip snap, float the bell, breathe at top, own every rep"
    }
  },
  "Clamshells": {
    "description": {
      "overview": "A hip abduction exercise performed side-lying. Activates glute medius and hip stabilizers, essential for knee health and movement preparation.",
      "setup": "Side-lying, knees bent 90°, heels together. Band around knees for resistance. Head supported, core engaged.",
      "movement": "Rotate top knee up while keeping heels together. Feel glute activation. Lower with control. Maintain neutral spine.",
      "cues": "Heels stay together, pure rotation, feel side glute, no rocking back"
    }
  },
  "Fire Hydrants": {
    "description": {
      "overview": "A quadruped hip abduction exercise mimicking a dog at hydrant. Activates glutes and hip stabilizers while challenging core stability.",
      "setup": "All fours position, hands under shoulders, knees under hips. Neutral spine, core engaged.",
      "movement": "Lift one knee out to side maintaining 90° angle. Hip height only. Lower with control. Keep hips level.",
      "cues": "Hips stay square, knee to hip height, resist rotation, controlled tempo"
    }
  },
  "Dead Bugs": {
    "description": {
      "overview": "A supine core stability exercise with reciprocal limb movement. Teaches core control while moving limbs, essential for spinal stability.",
      "setup": "Lie on back, arms reaching up, knees bent 90° over hips. Lower back pressed into floor.",
      "movement": "Lower opposite arm and leg toward floor. Maintain back contact. Return to start. Alternate sides.",
      "cues": "Back stays flat, slow and controlled, breathe throughout, opposite arm and leg"
    }
  },
  "Bird Dogs": {
    "description": {
      "overview": "A quadruped exercise extending opposite arm and leg. Builds core stability, balance, and posterior chain coordination.",
      "setup": "All fours, hands under shoulders, knees under hips. Neutral spine maintained throughout.",
      "movement": "Extend opposite arm forward and leg back simultaneously. Hold briefly. Return with control. Alternate.",
      "cues": "Long and strong, hips level, reach through limbs, no arching back"
    }
  },
  "Butler Bows": {
    "description": {
      "overview": "A standing hip hinge mobility drill targeting hamstrings and lower back. Teaches proper hinge mechanics while improving posterior chain flexibility and control.",
      "setup": "Stand with feet hip-width apart, slight bend in knees. Hands clasped behind back or at sides. Core engaged, chest proud.",
      "movement": "Hinge at hips, pushing them back while keeping spine neutral. Lower torso until stretch is felt in hamstrings. Return to standing by driving hips forward.",
      "cues": "Push hips back not down, flat back throughout, soft knees, squeeze glutes to stand"
    }
  },
  "Leg Raises": {
    "description": {
      "overview": "A core exercise lifting legs while supine. Targets lower abs and hip flexors while challenging anti-extension strength.",
      "setup": "Lie on back, legs straight, hands at sides or under glutes. Lower back pressed down.",
      "movement": "Raise straight legs to vertical position. Lower with control without touching floor. Maintain back contact.",
      "cues": "Back stays flat, control the negative, legs straight, breathe out on lift"
    }
  },
  "Hanging Leg Raises": {
    "description": {
      "overview": "A core exercise lifting legs while hanging from a pull up bar. Targets lower abs and hip flexors while challenging anti-extension strength.",
      "setup": "Hang from pull-up bar with shoulder-width grip. Engage core, avoid swinging.",
      "movement": "Raise straight legs to horizontal or higher. Lower with control without swinging. Maintain tight core.",
      "cues": "No swinging, control the negative, legs straight, breathe out on lift"
    }
  },
  "Inchworms": {
    "description": {
      "overview": "Dynamic full-body mobility exercise walking hands forward from standing. Builds flexibility, core strength, and serves as excellent warm-up.",
      "setup": "Standing tall, feet hip-width. Ready to hinge forward and walk out.",
      "movement": "Hinge to touch floor, walk hands to plank. Optional push-up. Walk feet to hands. Stand up. Repeat.",
      "cues": "Keep legs straight as able, strong plank position, controlled movement, feel the stretch"
    }
  },
  "Sumo Deadlift": {
    "description": {
      "overview": "A wide-stance deadlift variation emphasizing quads and glutes. Reduces range of motion and back stress while maximizing hip and leg drive.",
      "setup": "Wide stance with toes pointed out. Grip inside legs. Hips closer to bar than conventional. Chest up, knees out.",
      "movement": "Drive floor apart with feet while pulling chest up. Keep bar close. Lock out hips and knees simultaneously.",
      "cues": "Spread the floor, knees track toes, patient off floor, hips and shoulders rise together"
    }
  },
  "Deficit Deadlift": {
    "description": {
      "overview": "Deadlift performed from elevated platform increasing range of motion. Builds strength off the floor and improves starting position mechanics.",
      "setup": "Stand on 1-4 inch platform. Standard deadlift setup otherwise. Extra attention to starting position.",
      "movement": "Same as regular deadlift but from deficit. Increased leg drive required. Maintain position through extended range.",
      "cues": "Extra tight setup, more leg drive, maintain back angle, be patient"
    }
  },
  "Rack Pull": {
    "description": {
      "overview": "Partial deadlift from elevated position in power rack. Allows heavier loading for lockout strength and back development.",
      "setup": "Bar in rack at knee level or above. Standard deadlift grip and stance. Big breath before pull.",
      "movement": "Pull from pins to lockout. Focus on hip drive and back strength. Control the eccentric to pins.",
      "cues": "Drive hips through, big lats, controlled negative, heavy but perfect"
    }
  },
  "Lat Pulldown": {
    "description": {
      "overview": "A cable exercise pulling weight down to chest. Primary lat builder allowing heavy loading with stability, excellent for building width.",
      "setup": "Grip slightly wider than shoulders. Slight lean back. Chest up, shoulder blades down.",
      "movement": "Pull bar to upper chest squeezing lats. Control the stretch at top. Maintain torso angle throughout.",
      "cues": "Pull with elbows, squeeze lats hard, chest to bar, control the negative"
    }
  },
  "Cable Row": {
    "description": {
      "overview": "Horizontal pulling exercise using cable station. Builds back thickness with constant tension throughout range of motion.",
      "setup": "Seated with knees slightly bent. Handle at arm's length. Upright torso, shoulders back.",
      "movement": "Pull handle to abdomen keeping elbows close. Squeeze shoulder blades. Control the return maintaining position.",
      "cues": "Sit tall, pull to belly button, squeeze the middle back, stretch but stay tight"
    }
  },
  "Dumbbell Flyes": {
    "description": {
      "overview": "An isolation exercise for chest using arc motion. Provides deep stretch and peak contraction focusing on pec development.",
      "setup": "Dumbbells above chest, slight elbow bend maintained. Shoulder blades retracted, feet planted.",
      "movement": "Lower weights in wide arc until chest stretch felt. Return in same arc path squeezing chest.",
      "cues": "Wide arc not press, feel the stretch, hug a tree motion, control heavy weights"
    }
  },
  "Face Pulls": {
    "description": {
      "overview": "Cable exercise pulling rope to face level. Builds rear delts and upper back while improving posture and shoulder health.",
      "setup": "Rope at face height, arms extended. Step back for tension. Athletic stance for stability.",
      "movement": "Pull rope to face spreading hands apart. Elbows high. Squeeze upper back. Control return.",
      "cues": "Elbows high, pull apart at face, squeeze between shoulders, perfect posture"
    }
  },
  "Sumo Deficit DL": {
    "description": {
      "overview": "Sumo deadlift performed from elevated platform. Combines wider stance benefits with increased range of motion for maximum posterior chain development.",
      "setup": "Stand on 1-4 inch platform with wide sumo stance. Toes out, grip inside legs. Extra attention to start position.",
      "movement": "Drive feet apart while pulling up from deeper position. Extra quad and glute drive required. Maintain sumo positioning.",
      "cues": "Spread the floor, patient from deficit, knees out, longer range means more work"
    }
  },
  "Block Pull": {
    "description": {
      "overview": "Deadlift from blocks at various heights. Allows focus on specific range of motion and lockout strength development.",
      "setup": "Barbell resting on blocks at desired height (typically 2-4 inches). Standard deadlift stance and grip.",
      "movement": "Pull from block height to full lockout. Focus on lockout strength and upper back development. Control return to blocks.",
      "cues": "Big back arch, drive hips through, own the lockout, controlled negative"
    }
  },
  "Paused Deadlift": {
    "description": {
      "overview": "Deadlift with pause at mid-shin or knee level. Builds strength through sticking points and eliminates momentum.",
      "setup": "Standard deadlift setup. Mental preparation for pause position. Usually paused at mid-shin.",
      "movement": "Pull to pause position and hold for 2-3 seconds. Continue to lockout after pause. Eliminates bounce reflex.",
      "cues": "Stay tight in pause, maintain position, drive through after pause, no relaxing"
    }
  },
  "SLDL": {
    "description": {
      "overview": "Stiff-leg deadlift emphasizing hamstring flexibility and strength. Legs remain straighter than Romanian deadlift for maximum hamstring stretch.",
      "setup": "Feet hip-width, legs as straight as flexibility allows. Bar starts at hip level or on blocks.",
      "movement": "Hinge at hips keeping legs straight. Lower until maximum hamstring stretch. Drive hips forward to return.",
      "cues": "Legs stay straight, feel massive hamstring stretch, chest proud, hips back and through"
    }
  },
  "Axle Deadlift": {
    "description": {
      "overview": "Deadlift using thick axle bar. Builds tremendous grip strength and core stability while challenging conventional deadlift technique.",
      "setup": "Standard deadlift stance with thick axle bar. Grip will be challenged significantly. Core must be extra tight.",
      "movement": "Same deadlift mechanics but with compromised grip. Focus on maintaining position despite grip fatigue.",
      "cues": "Squeeze bar hard, core stays tight, don't let bar slip, shorter sets due to grip"
    }
  },
  "Deadlift With Chains": {
    "description": {
      "overview": "Deadlift with chains adding accommodating resistance. Weight increases as bar rises, maximizing lockout strength development.",
      "setup": "Chains draped over barbell so some links touch floor at bottom. Standard deadlift setup otherwise.",
      "movement": "Pull with increasing resistance as chains lift off floor. Maximum resistance at lockout. Focus on explosive finish.",
      "cues": "Accelerate through the pull, finish hard at top, chains make it harder as you go up"
    }
  },
  "Strict OHP": {
    "description": {
      "overview": "Standing overhead press with no leg drive. Pure upper body pressing strength, maximum shoulder and core development.",
      "setup": "Bar in front rack, feet planted, core maximally braced. No leg movement allowed.",
      "movement": "Press straight up using only upper body. No leg drive, hip thrust, or back lean. Pure shoulder strength.",
      "cues": "No leg help, core stays tight, bar straight up, control the weight"
    }
  },
  "DB OHP": {
    "description": {
      "overview": "Dumbbell overhead press variation. Allows natural movement path and addresses strength imbalances between arms.",
      "setup": "Dumbbells at shoulder height, standing or seated. Core engaged, slight stagger stance if standing.",
      "movement": "Press dumbbells overhead in slight arc motion. Weights come together at top. Control descent.",
      "cues": "Natural arc path, core stays braced, weights meet at top, smooth control"
    }
  },
  "Seated Press": {
    "description": {
      "overview": "Overhead press performed seated to eliminate leg drive. Isolates shoulders and triceps while requiring core stability.",
      "setup": "Seated on bench with back support. Bar in front rack position. Feet planted for stability.",
      "movement": "Press bar overhead without back support if possible. Focus purely on shoulder strength. Control the descent.",
      "cues": "No leg help, sit tall, press straight up, core engaged"
    }
  },
  "Seated DB OHP": {
    "description": {
      "overview": "Seated dumbbell overhead press with back support. Beginner-friendly shoulder exercise with stability assistance.",
      "setup": "Seated on bench with back support. Dumbbells at shoulder height. Feet planted firmly.",
      "movement": "Press dumbbells overhead with back support assistance. Focus on feeling shoulders work. Control the weight.",
      "cues": "Use the back support, feel shoulders working, control both weights, steady breathing"
    }
  },
  "Strict Barbell Row": {
    "description": {
      "overview": "Bent-over row with strict form eliminating body English. Pure back strength development without momentum assistance.",
      "setup": "Hinge position with knees soft. Bar hanging at arm's length. Strict position maintained throughout.",
      "movement": "Row bar to lower chest with zero body movement. Pure back and arm strength. Squeeze hard at top.",
      "cues": "No body English, pure back strength, squeeze hard, maintain position"
    }
  },
  "Barbell Cheat Row": {
    "description": {
      "overview": "Bent-over row allowing controlled body English for heavier loading. Builds strength and allows overload beyond strict capacity.",
      "setup": "Athletic position ready to use slight body movement. Heavier weight than strict rows.",
      "movement": "Row with controlled hip drive and slight momentum. Still focus on back muscles but allow some assistance.",
      "cues": "Controlled cheating, still feel the back, hip helps the pull, heavier than strict"
    }
  },
  "Reverse Grip BB Row": {
    "description": {
      "overview": "Bent-over row with underhand grip emphasizing biceps and lower lats. Changes muscle recruitment pattern from overhand grip.",
      "setup": "Bent-over position with underhand grip, hands shoulder-width apart. Slightly different pulling angle.",
      "movement": "Row bar to lower abdomen with underhand grip. Feel different muscle activation. Biceps more involved.",
      "cues": "Underhand changes everything, feel the biceps help, pull to belly, squeeze and hold"
    }
  },
  "Chest Supported Row": {
    "description": {
      "overview": "Rowing exercise with chest support eliminating lower back stress. Allows pure back focus without posterior chain fatigue.",
      "setup": "Incline bench set to 45 degrees. Chest against pad, dumbbells hanging down. Stable base for rowing.",
      "movement": "Row dumbbells to sides of bench. Chest stays in contact with pad. Pure back and arm movement.",
      "cues": "Chest stays down, pull to bench level, squeeze shoulder blades, no momentum"
    }
  },
  "T-Bar Row": {
    "description": {
      "overview": "V-handle row using barbell or T-bar apparatus. Excellent for building back thickness with heavy loading potential.",
      "setup": "Straddle bar or T-bar, bent over position. V-handle or close grip. Athletic stance for stability.",
      "movement": "Row handle to stomach area. Focus on pulling elbows back. Strong contraction between shoulder blades.",
      "cues": "Elbows lead the pull, handle to stomach, big squeeze between shoulders, control the weight"
    }
  },
  "Incline Barbell Press": {
    "description": {
      "overview": "Barbell press on inclined bench targeting upper chest. Combines benefits of flat bench with upper chest emphasis.",
      "setup": "Bench at 30-45 degree incline. Similar grip to flat bench. Eyes under bar, shoulder blades pinched.",
      "movement": "Lower bar to upper chest, press back and slightly up. Different angle requires adjusted bar path.",
      "cues": "Bar to upper chest, press back and up, feel upper chest working, maintain arch"
    }
  },
  "Cable Press": {
    "description": {
      "overview": "Chest pressing movement using cables for constant tension. Allows various angles and provides different feel than free weights.",
      "setup": "Cables at chest height, step forward for tension. Athletic stance, core engaged for stability.",
      "movement": "Press handles forward and slightly together. Feel constant tension throughout range. Control the return.",
      "cues": "Constant tension, press and squeeze, feel it throughout, control the stretch"
    }
  },
  "Lateral Raise": {
    "description": {
      "overview": "Isolation exercise for lateral deltoids. The gold standard for building shoulder width and medial delt development.",
      "setup": "Dumbbells at sides, slight forward lean. Elbows slightly bent throughout. Light weight, perfect form.",
      "movement": "Raise weights out to sides to shoulder height. Lead with elbows, not hands. Control negative phase.",
      "cues": "Lead with elbows, pour water at top, slow negative, feel the burn, light weight"
    }
  },
  "Front Raise": {
    "description": {
      "overview": "Isolation exercise for front deltoids. Builds anterior shoulder strength and balances pressing movements.",
      "setup": "Dumbbells in front of thighs, standing tall. Slight bend in elbows maintained throughout movement.",
      "movement": "Raise one or both weights to shoulder height in front. Control the movement both ways. Focus on front delts.",
      "cues": "Controlled raise, feel front delts, to shoulder height, resist the drop"
    }
  },
  "Cable Pushdown": {
    "description": {
      "overview": "Tricep isolation exercise using cable machine. Excellent for building tricep mass and learning lockout mechanics.",
      "setup": "Cable at head height, rope or bar attachment. Elbows at sides, standing tall with slight lean forward.",
      "movement": "Push weight down by extending elbows only. Squeeze triceps hard at bottom. Control the return.",
      "cues": "Elbows stay put, push down hard, squeeze at bottom, control the negative"
    }
  },
  "Overhead Extension": {
    "description": {
      "overview": "Tricep exercise with arms overhead targeting long head. Provides deep stretch and strong contraction for tricep development.",
      "setup": "Dumbbell or cable overhead, elbows pointing forward. Core engaged to prevent back arch.",
      "movement": "Lower weight behind head by bending elbows only. Feel tricep stretch. Extend back to start.",
      "cues": "Elbows forward, deep stretch, only elbows move, strong contraction at top"
    }
  },
  "Diamond Push-ups": {
    "description": {
      "overview": "Push-up variation with hands in diamond shape. Emphasizes triceps and inner chest while building pushing strength.",
      "setup": "High plank with hands forming diamond shape under chest. Body straight from head to heels.",
      "movement": "Lower chest to hands maintaining diamond shape. Press back up focusing on triceps. Keep body rigid.",
      "cues": "Diamond stays put, chest to hands, feel triceps working, rigid body line"
    }
  },
  "Weighted Pull-Ups": {
    "description": {
      "overview": "Pull-ups with added external load. The ultimate upper body pulling strength exercise for advanced trainees.",
      "setup": "Weight belt with plates or dumbbell between feet. Dead hang start position. Grip of choice.",
      "movement": "Pull body and weight up until chin clears bar. Control loaded descent. Maintain strict form.",
      "cues": "Control the extra weight, chin over bar, own the negative, strict form only"
    }
  },
  "Cable High Row": {
    "description": {
      "overview": "High cable row targeting upper back and rear delts. Excellent for posture improvement and building upper back thickness.",
      "setup": "Cable at face height or above. Wide grip or rope attachment. Step back for tension.",
      "movement": "Pull cable to upper chest/face level. Elbows high throughout movement. Squeeze upper back hard.",
      "cues": "Elbows high, pull to face, squeeze upper back, retract shoulder blades"
    }
  },
  "Upright Row": {
    "description": {
      "overview": "Vertical pulling exercise targeting shoulders and traps. Builds shoulder width and trap development with upward pulling motion.",
      "setup": "Barbell or dumbbells at arm's length. Narrow grip, standing tall. Core engaged for stability.",
      "movement": "Pull weight straight up to chest level, leading with elbows. Keep weight close to body. Control descent.",
      "cues": "Elbows lead, weight stays close, pull to chest, feel shoulders and traps"
    }
  },
  "Reverse Fly": {
    "description": {
      "overview": "Rear delt isolation exercise performed bent over. Essential for shoulder health and balancing pressing movements.",
      "setup": "Bent forward 45 degrees, dumbbells hanging down. Light weight, arms slightly bent throughout.",
      "movement": "Raise weights out to sides in reverse fly motion. Focus on rear delts and rhomboids. Squeeze between shoulders.",
      "cues": "Light weight, bent forward, feel rear delts, squeeze between shoulders, control both ways"
    }
  },
  "Pike Push-ups": {
    "description": {
      "overview": "Push-up variation in pike position targeting shoulders. Progression toward handstand push-ups while building shoulder strength.",
      "setup": "Downward dog position, hands shoulder-width apart. Higher pike for more difficulty.",
      "movement": "Lower head toward hands by bending elbows. Press back to start. Feel shoulders working hard.",
      "cues": "High pike position, head toward hands, shoulders do the work, controlled movement"
    }
  },
  "Cable Squat to Press": {
    "description": {
      "overview": "Full-body exercise combining squat and press using cables. Builds functional strength and coordination.",
      "setup": "Cable handles at shoulder height. Step back for tension. Feet shoulder-width apart.",
      "movement": "Squat down while handles stay at shoulders. Drive up and press handles overhead. Fluid combination.",
      "cues": "Smooth transition, use leg drive for press, handles follow body, controlled tempo"
    }
  },
  "Landmine Single Arm Row": {
    "description": {
      "overview": "Unilateral row using landmine setup. Provides unique angle and challenges core stability while building back strength.",
      "setup": "Barbell in landmine, staggered stance. One hand on bar, other hand on hip or thigh for support.",
      "movement": "Row barbell to side of body with anti-rotation focus. Feel lat and core working together.",
      "cues": "Don't rotate, feel the lat, core stays tight, row to hip level"
    }
  },
  "KB Swing": {
    "description": {
      "overview": "Ballistic hip hinge using kettlebell. Premier posterior chain power exercise building explosive hip drive.",
      "setup": "Feet wider than shoulders, kettlebell arm's length away. Athletic position ready for explosive movement.",
      "movement": "Hike bell back between legs, explosive hip snap forward. Bell floats to shoulder height. Rhythm crucial.",
      "cues": "Explosive hips, float don't lift, snap like whip, breathing with rhythm"
    }
  },
  "Turkish Get-Up": {
    "description": {
      "overview": "Complex full-body movement from floor to standing with weight overhead. Ultimate stability and strength challenge.",
      "setup": "Lying on back with kettlebell locked out overhead. Opposite leg bent, same side leg straight.",
      "movement": "Rise to standing through series of positions keeping weight overhead. Reverse to return to floor.",
      "cues": "Eyes on weight, slow and controlled, strong overhead position, master each position"
    }
  },
  "Thrusters": {
    "description": {
      "overview": "Front squat to overhead press in one movement. High-intensity exercise building full-body power and conditioning.",
      "setup": "Weight in front rack position, feet shoulder-width. Ready for explosive transition from squat to press.",
      "movement": "Front squat down, drive up explosively using momentum to press weight overhead. One fluid motion.",
      "cues": "Use the bounce, fluid transition, explode up, full lockout overhead"
    }
  },
  "Burpee Box Jump": {
    "description": {
      "overview": "Burpee followed by box jump combining conditioning with explosive power. Advanced full-body conditioning exercise.",
      "setup": "Standing in front of box at appropriate height. Clear space for burpee movement.",
      "movement": "Perform burpee, then immediately explode up onto box. Step down and repeat. Maximum intensity.",
      "cues": "Explosive transition, land softly on box, step down don't jump, high intensity throughout"
    }
  },
  "Plank to Downward Dog": {
    "description": {
      "overview": "Dynamic movement from plank to downward dog position. Builds core strength, shoulder mobility, and hamstring flexibility.",
      "setup": "Start in high plank position. Hands shoulder-width apart, body straight from head to heels.",
      "movement": "Push hips up and back into downward dog position. Return to plank. Feel core and shoulders working.",
      "cues": "Strong plank start, push hips high, feel hamstring stretch, controlled transitions"
    }
  },
  "Pike Toe Touch": {
    "description": {
      "overview": "Core exercise reaching for toes from V-sit position. Targets rectus abdominis and hip flexors with dynamic movement.",
      "setup": "V-sit position with legs extended and hands reaching forward. Balance on tailbone.",
      "movement": "Reach hands toward toes while maintaining V position. Crunch forward and extend back. Keep legs straight.",
      "cues": "Reach for toes, maintain V position, legs stay straight, rhythmic movement"
    }
  },
  "Cable Goblet Squats": {
    "description": {
      "overview": "Goblet squat using cable for constant tension. Combines benefits of goblet position with accommodating resistance.",
      "setup": "Cable handle held at chest height. Feet slightly wider than shoulders, toes out.",
      "movement": "Squat down maintaining handle at chest. Drive up against cable resistance. Constant tension throughout.",
      "cues": "Handle stays at chest, squat between legs, constant tension, drive through heels"
    }
  },
  "Reverse Lunge": {
    "description": {
      "overview": "Lunge stepping backward instead of forward. Knee-friendly alternative providing excellent quad and glute development.",
      "setup": "Standing tall with weights at sides or front rack. Core engaged for balance.",
      "movement": "Step back into lunge position. Both knees to 90 degrees. Drive through front heel to return.",
      "cues": "Step back, not down, front knee tracks toe, drive through front heel, controlled movement"
    }
  },
  "Box Jump": {
    "description": {
      "overview": "Explosive jump onto elevated platform. Develops lower body power, rate of force development, and athletic performance.",
      "setup": "Standing arm's length from box. Arms back ready to swing. Focus on landing spot.",
      "movement": "Swing arms and jump explosively onto box. Land softly in squat position. Step down with control.",
      "cues": "Explosive takeoff, soft landing, step down don't jump, reset between reps"
    }
  },
  "Leg Extensions": {
    "description": {
      "overview": "Isolated quadriceps exercise using machine. Builds quad strength and size while targeting all four heads.",
      "setup": "Seated in machine with back against pad. Ankles under roller pad, knees aligned with pivot.",
      "movement": "Extend legs by contracting quadriceps. Squeeze hard at top. Lower with control resisting weight.",
      "cues": "Squeeze quads hard, full extension, pause at top, control the negative"
    }
  },
  "Single Leg Glute Bridge": {
    "description": {
      "overview": "Unilateral glute bridge challenging single-leg strength. Addresses imbalances while building glute and hamstring strength.",
      "setup": "Lying on back, one foot planted, other leg extended or bent up. Arms at sides for stability.",
      "movement": "Drive through planted heel to lift hips up. Squeeze glute hard at top. Lower with control.",
      "cues": "Drive through heel, big glute squeeze, hips stay level, feel the working side"
    }
  },
  "Lateral Walks with Resistance Band": {
    "description": {
      "overview": "Side-stepping with band resistance targeting hip abductors. Essential for knee health and glute activation.",
      "setup": "Band around knees or ankles. Athletic stance with slight squat position. Core engaged.",
      "movement": "Step sideways maintaining tension in band. Keep knees out and hips back. Small controlled steps.",
      "cues": "Maintain squat position, knees stay out, feel glutes working, controlled steps"
    }
  },
  "Lateral Walks": {
    "description": {
      "overview": "Bodyweight side-stepping exercise for hip stability. Activates glutes and improves lateral movement patterns.",
      "setup": "Athletic stance, slight squat position. Hands on hips or out for balance.",
      "movement": "Step sideways while maintaining squat position. Keep hips back and knees out. Focus on glute activation.",
      "cues": "Stay in squat, step don't shuffle, feel glutes, maintain good posture"
    }
  },
  "Bodyweight Squats": {
    "description": {
      "overview": "Fundamental bodyweight squat movement. Foundation exercise for all squatting patterns and lower body strength.",
      "setup": "Feet shoulder-width apart, toes slightly out. Arms extended forward for balance. Core engaged.",
      "movement": "Sit back and down until thighs parallel or below. Drive through heels to stand. Keep chest up.",
      "cues": "Sit back first, knees track toes, chest proud, drive through heels"
    }
  },
  "Wall Sit": {
    "description": {
      "overview": "Isometric squat hold against wall. Builds muscular endurance in quadriceps and glutes while teaching proper position.",
      "setup": "Back against wall, walk feet out until thighs parallel. Arms crossed or at sides.",
      "movement": "Hold squat position against wall. Maintain 90-degree knee angle. Breathe normally throughout hold.",
      "cues": "Press back into wall, thighs parallel, breathe normally, fight the burn"
    }
  },
  "Squat Jumps": {
    "description": {
      "overview": "Explosive bodyweight squat with jump. Develops power and athleticism while improving squat mechanics under fatigue.",
      "setup": "Feet shoulder-width apart in squat stance. Arms ready for momentum assistance.",
      "movement": "Squat down and explode up jumping as high as possible. Land softly back into squat. Continuous rhythm.",
      "cues": "Explode up, reach for ceiling, soft landing, continuous rhythm, maintain form"
    }
  },
  "Plank Jacks": {
    "description": {
      "overview": "Dynamic plank variation adding leg movement. Combines core stability with cardiovascular challenge and coordination.",
      "setup": "High plank position with feet together. Hands directly under shoulders, body straight.",
      "movement": "Jump feet apart and together while maintaining plank position. Keep hips level and core tight.",
      "cues": "Hips stay level, quick feet, maintain plank, breathe with movement"
    }
  },
  "Glute Kickbacks": {
    "description": {
      "overview": "Isolation exercise targeting glutes using cable or band. Builds glute strength and activation in hip extension.",
      "setup": "Cable or band around ankle. Hold support for balance. Standing leg slightly bent.",
      "movement": "Kick working leg straight back focusing on glute contraction. Control return. Keep hips square.",
      "cues": "Glutes do the work, hips stay square, straight leg, squeeze at back"
    }
  },
  "Banded Glute Bridges": {
    "description": {
      "overview": "Glute bridge with band resistance around knees. Adds abduction component while building glute strength.",
      "setup": "Lying on back with band around knees. Feet flat, knees bent. Arms at sides.",
      "movement": "Drive hips up while pushing knees out against band. Feel glutes working hard. Lower with control.",
      "cues": "Push knees out, hips drive up, squeeze glutes hard, fight the band"
    }
  },
  "Goblet Squat": {
    "description": {
      "overview": "Front-loaded squat holding weight at chest. Excellent teaching tool and effective leg exercise.",
      "setup": "Weight held at chest, elbows pointing down. Feet slightly wider than shoulders.",
      "movement": "Squat down between legs with elbows tracking inside knees. Drive through heels to stand.",
      "cues": "Elbows between knees, sit between legs, weight stays at chest, heels down"
    }
  },
  "Dumbbell Rows": {
    "description": {
      "overview": "Bent-over rowing using dumbbells for back development. Allows unilateral focus and natural movement path.",
      "setup": "Bent over at hips, dumbbells hanging down. Back straight, core engaged for stability.",
      "movement": "Row dumbbells to hips/lower chest. Focus on lat and rhomboid contraction. Control the stretch.",
      "cues": "Row to hips, squeeze back muscles, maintain bent position, control the weights"
    }
  },
  "Incline Dumbbell Press": {
    "description": {
      "overview": "Dumbbell pressing on inclined bench targeting upper chest. Combines incline angle benefits with dumbbell advantages.",
      "setup": "Incline bench at 30-45 degrees. Dumbbells at chest level. Shoulder blades retracted.",
      "movement": "Press dumbbells up and together in arc motion. Lower to chest level feeling upper chest stretch.",
      "cues": "Feel upper chest, arc motion, deeper stretch than barbell, control the weights"
    }
  },
  "Sumo Squat": {
    "description": {
      "overview": "Wide-stance squat emphasizing inner thighs and glutes. Allows deeper range of motion and targets different muscle emphasis.",
      "setup": "Wide stance with toes pointed out significantly. Weight at chest or hanging down. Core engaged.",
      "movement": "Squat down between legs tracking knees over toes. Drive through heels focusing on glutes and inner thighs.",
      "cues": "Wide stance, toes out, knees track toes, feel glutes and inner thighs, deep range"
    }
  },
  "Glute Bridge": {
    "description": {
      "overview": "Supine hip extension exercise targeting glutes and hamstrings. Foundation movement for hip drive and glute development.",
      "setup": "Lying on back, knees bent, feet flat. Arms at sides for stability. Core engaged.",
      "movement": "Drive hips up by squeezing glutes. Create straight line from knees to shoulders. Lower with control.",
      "cues": "Squeeze glutes hard, hips drive up, straight line, pause at top, control down"
    }
  },
  "Wide Stance Squat": {
    "description": {
      "overview": "Squat with wider than normal stance. Emphasizes glutes and adductors while allowing different loading patterns.",
      "setup": "Feet wider than normal squat stance, toes pointed out. Bar position of choice.",
      "movement": "Squat down tracking knees over toes. Focus on sitting back and spreading the floor. Drive up through heels.",
      "cues": "Spread the floor, knees out, sit back, feel glutes and inner thighs"
    }
  },
  "Narrow Stance Squat": {
    "description": {
      "overview": "Squat with closer than normal stance. Emphasizes quadriceps development and requires greater ankle mobility.",
      "setup": "Feet closer together than normal squat. May require more upright torso. Bar position of choice.",
      "movement": "Squat down maintaining narrow stance. Knees travel more forward. Drive up through mid-foot.",
      "cues": "Narrow stance, knees forward is OK, feel quads working, maintain balance"
    }
  },
  "Duffalo Bar Squat": {
    "description": {
      "overview": "Squat using cambered Duffalo bar. Provides different feel and may be easier on shoulders while challenging stability.",
      "setup": "Duffalo bar on upper back. May feel different than straight bar. Standard squat stance.",
      "movement": "Squat with cambered bar feeling different balance demands. Maintain control throughout range.",
      "cues": "Feel the different balance, control the camber, maintain position, use the flexibility"
    }
  },
  "Lunge": {
    "description": {
      "overview": "Split stance lunge movement. Fundamental unilateral exercise building leg strength and addressing imbalances.",
      "setup": "Starting position with weight of choice. Step forward or back into lunge position.",
      "movement": "Lower into lunge with both knees to 90 degrees. Drive through front heel to return or step into next rep.",
      "cues": "Both knees to 90, front knee tracks toe, drive through front heel, controlled descent"
    }
  },
  "SSB Lunge": {
    "description": {
      "overview": "Lunge variation using safety squat bar with handles. Provides stability assistance while challenging legs unilaterally.",
      "setup": "SSB across upper back with handles forward. Step into lunge position. Bar may want to pull forward.",
      "movement": "Perform lunge while controlling bar position. Handles help with balance. Drive through front heel to return.",
      "cues": "Control the bar, handles help balance, feel front leg working, stable torso"
    }
  },
  "Hatfield Squat": {
    "description": {
      "overview": "Squat holding onto safety bars or uprights for support. Allows heavy leg loading while reducing balance demands.",
      "setup": "Bar on back, hands holding safety bars or uprights. Feet positioned for comfortable squat.",
      "movement": "Squat down using hands for balance assistance only. Focus purely on leg strength. Drive up through legs.",
      "cues": "Hands for balance only, legs do the work, full range of motion, control the weight"
    }
  },
  "Flat Bench Press": {
    "description": {
      "overview": "Standard horizontal barbell press on flat bench. The gold standard for upper body pressing strength and chest development.",
      "setup": "Eyes under bar, shoulder blades retracted, feet planted. Grip slightly wider than shoulders.",
      "movement": "Lower bar to nipple line with control. Pause briefly on chest. Press straight up maintaining position.",
      "cues": "Bar to nipples, pause on chest, press straight up, maintain arch and leg drive"
    }
  },
  "DB Bench": {
    "description": {
      "overview": "Dumbbell bench press variation allowing greater range of motion. Builds chest while improving stability and addressing imbalances.",
      "setup": "Dumbbells at chest level on bench. Shoulder blades retracted, feet planted for stability.",
      "movement": "Press dumbbells up and together in arc motion. Lower for deep stretch. Control heavy weights throughout.",
      "cues": "Arc motion not straight, deep stretch at bottom, press and squeeze together, control the weights"
    }
  },
  "DB Incline Bench": {
    "description": {
      "overview": "Incline dumbbell press targeting upper chest development. Combines incline angle with dumbbell benefits.",
      "setup": "Incline bench at 30-45 degrees. Dumbbells at chest level. Shoulder blades retracted on pad.",
      "movement": "Press dumbbells up and together targeting upper chest. Feel stretch at bottom. Control the movement.",
      "cues": "Feel upper chest working, arc motion together, stretch at bottom, control heavy dumbbells"
    }
  },
  "Slingshot Bench": {
    "description": {
      "overview": "Bench press using slingshot device for assistance. Allows overload at lockout while reducing stress at bottom.",
      "setup": "Slingshot device around arms. Standard bench setup otherwise. Device assists through sticking point.",
      "movement": "Lower bar feeling reduced load at bottom. Slingshot assists through middle range. Focus on lockout.",
      "cues": "Feel the assistance, focus on lockout, heavier than raw bench, control with device"
    }
  },
  "Feet up Bench": {
    "description": {
      "overview": "Bench press with feet elevated on bench. Eliminates leg drive and arch, focusing purely on chest and arms.",
      "setup": "Feet up on bench, flat back against pad. No arch available. Grip slightly wider than normal.",
      "movement": "Press bar with no leg drive assistance. Pure upper body strength. Control the movement throughout.",
      "cues": "No leg help, flat back, feel chest working harder, control without arch"
    }
  },
  "Duffalo Bar Bench": {
    "description": {
      "overview": "Bench press using cambered Duffalo bar. May be easier on shoulders while providing different stimulus.",
      "setup": "Duffalo bar with camber down toward chest. May feel different balance. Standard bench position.",
      "movement": "Press cambered bar feeling different balance demands. May allow deeper stretch. Control the camber.",
      "cues": "Feel the different balance, may go deeper, control the camber, use the flexibility"
    }
  },
  "Bench With Chains": {
    "description": {
      "overview": "Bench press with chains adding accommodating resistance. Weight increases through range of motion.",
      "setup": "Chains draped over barbell. More resistance at top, less at bottom. Standard bench setup.",
      "movement": "Press bar with increasing resistance as chains lift off floor. Focus on explosive finish.",
      "cues": "Accelerate through the press, harder at top, finish strong, chains change the feel"
    }
  },
  "Sumo Rack Pull": {
    "description": {
      "overview": "Partial sumo deadlift from elevated position. Allows heavy loading for sumo lockout strength development.",
      "setup": "Wide sumo stance with bar on pins at knee level or above. Hands inside legs.",
      "movement": "Pull from pins to lockout using sumo mechanics. Focus on spreading floor and hip drive.",
      "cues": "Spread the floor, hips through, heavy sumo lockout, control to pins"
    }
  },
  "Sumo Block Pull": {
    "description": {
      "overview": "Sumo deadlift from blocks reducing range of motion. Builds sumo lockout strength and confidence.",
      "setup": "Wide sumo stance with bar on blocks. Hands inside legs, chest up, knees out.",
      "movement": "Pull from blocks using sumo technique. Drive feet apart while pulling chest up. Control return.",
      "cues": "Spread the floor, knees track toes, chest leads, heavy sumo work"
    }
  },
  "Squat to Calf Raise": {
    "description": {
      "overview": "Combination movement linking squat with calf raise. Builds lower body strength through multiple planes of motion.",
      "setup": "Standard squat stance with weight of choice. Ready for fluid transition to calf raise.",
      "movement": "Perform squat, then immediately rise onto toes for calf raise. Lower heels and repeat sequence.",
      "cues": "Smooth transitions, full squat first, high onto toes, control both movements"
    }
  },
  "Kettlebell Clean": {
    "description": {
      "overview": "Explosive movement bringing kettlebell from floor to rack position. Builds power and teaches clean mechanics.",
      "setup": "Kettlebell between feet, athletic stance. Ready for explosive hip drive and catch in rack.",
      "movement": "Hike bell back, explosive hip snap, high pull, catch in rack position at shoulder. Control descent.",
      "cues": "Explosive hips, high pull, soft catch, bell rests on forearm, smooth descent"
    }
  },
  "Kettlebell Snatch": {
    "description": {
      "overview": "Explosive movement from floor to overhead in one motion. Ultimate power exercise requiring technique and conditioning.",
      "setup": "Kettlebell between feet, wider stance than clean. Ready for explosive full-body movement.",
      "movement": "Hike back, explosive hip drive, high pull, punch through to overhead lockout. Control down.",
      "cues": "Violent hip snap, high pull, punch through overhead, soft lockout, controlled descent"
    }
  },
  "Kettlebell Windmill": {
    "description": {
      "overview": "Stability exercise with kettlebell overhead while touching floor. Builds shoulder stability and hip mobility.",
      "setup": "Kettlebell locked out overhead, feet wide. Free hand ready to reach toward floor.",
      "movement": "Keep bell overhead while hinging to touch floor with free hand. Return maintaining overhead position.",
      "cues": "Bell stays overhead, hinge at hips, feel hamstring stretch, don't let bell drift"
    }
  },
  "Kettlebell Rack Squat": {
    "description": {
      "overview": "Front-loaded squat with kettlebell in rack position. Challenges core stability while building leg strength.",
      "setup": "Kettlebell in rack position at shoulder. Elbow down, bell rests on forearm. Standard squat stance.",
      "movement": "Squat down maintaining rack position. Bell challenges posture. Drive up keeping bell stable.",
      "cues": "Maintain rack position, elbow stays down, fight forward lean, drive through heels"
    }
  },
  "Kettlebell Halo": {
    "description": {
      "overview": "Circular movement passing kettlebell around head. Builds shoulder mobility and stability through full range.",
      "setup": "Light kettlebell held by horns. Standing tall with core engaged. Ready for controlled circular motion.",
      "movement": "Pass bell around head in smooth circle. Keep core tight. Reverse direction for balance.",
      "cues": "Smooth circles, core stays tight, control the bell, both directions, light weight only"
    }
  },
  "Kettlebell Gorilla Row": {
    "description": {
      "overview": "Alternating single-arm rows in bent-over position with two kettlebells. Builds back strength with anti-rotation challenge.",
      "setup": "Two kettlebells between feet, bent over position. One hand on each bell, athletic stance.",
      "movement": "Row one bell to hip while other stays on ground. Alternate sides while maintaining position.",
      "cues": "One at a time, maintain bent position, fight rotation, feel the lat squeeze"
    }
  },
  "Barbell Hip Thrust": {
    "description": {
      "overview": "Hip thrust using barbell for loading. Premier glute exercise allowing maximum load through hip extension.",
      "setup": "Upper back on bench, barbell in hip crease with pad. Feet flat, knees at 90° at top.",
      "movement": "Drive through heels to thrust hips up. Full hip extension with glute squeeze. Control descent.",
      "cues": "Drive through heels, big hip extension, squeeze glutes hard, control the negative"
    }
  },
  "Barbell Hack Squat": {
    "description": {
      "overview": "Squat with barbell behind legs. Unique loading pattern emphasizing quads while reducing forward lean.",
      "setup": "Barbell behind legs, deadlift grip behind body. Heels may be elevated. Upright torso.",
      "movement": "Squat down with bar behind legs. More upright than back squat. Drive up through heels.",
      "cues": "Bar stays behind, upright torso, feel quads working, heels down or elevated"
    }
  },
  "Zercher Squat": {
    "description": {
      "overview": "Squat holding barbell in elbow crease. Challenges core massively while building leg strength with front loading.",
      "setup": "Bar in elbow crease, arms crossed. Pad may be needed. Upright torso position required.",
      "movement": "Squat down maintaining upright position. Bar loading challenges core. Drive up staying upright.",
      "cues": "Bar in elbows, stay upright, core works overtime, drive through heels"
    }
  },
  "Anderson Squat": {
    "description": {
      "overview": "Squat starting from bottom position in pins. Eliminates stretch reflex, builds strength from dead stop.",
      "setup": "Bar on pins at bottom squat position. Get under bar in squat position. Eliminate momentum.",
      "movement": "Press up from dead stop in bottom position. No stretch reflex available. Lower back to pins.",
      "cues": "Start from dead stop, no stretch reflex, pure strength, control back to pins"
    }
  },
  "Barbell Glute Bridge": {
    "description": {
      "overview": "Glute bridge using barbell for heavy loading. Builds maximum glute strength through hip extension pattern.",
      "setup": "Lying on back with barbell over hips, pad recommended. Feet flat, knees bent. Bar secured in place.",
      "movement": "Drive hips up squeezing glutes maximally. Create straight line from knees to shoulders. Control descent.",
      "cues": "Drive heels into floor, massive glute squeeze, full hip extension, control the weight"
    }
  },
  "Jefferson Squat": {
    "description": {
      "overview": "Straddle squat with barbell between legs. Unique loading pattern reducing spinal compression while targeting legs.",
      "setup": "Straddle barbell with one hand in front, one behind. Athletic stance. Bar between legs.",
      "movement": "Squat down with bar between legs. Drive up maintaining straddle position. Switch hand positions between sets.",
      "cues": "Straddle the bar, upright torso, switch grip between sets, feel the different loading"
    }
  },
  "Barbell Good Morning": {
    "description": {
      "overview": "Hip hinge movement with bar on back. Builds posterior chain strength and teaches proper hinge mechanics.",
      "setup": "Bar on upper back like back squat. Feet hip-width apart. Core braced, shoulder blades tight.",
      "movement": "Hinge at hips pushing back while maintaining flat back. Feel hamstring stretch. Drive hips forward.",
      "cues": "Hips back not down, chest proud, feel hamstrings, drive hips through to finish"
    }
  },
  "Pendlay Row": {
    "description": {
      "overview": "Bent-over row starting from floor each rep. Builds explosive back strength and eliminates momentum.",
      "setup": "Bar on floor, bent over position. Reset to floor between each rep. Parallel torso to floor.",
      "movement": "Explosively row bar from floor to lower chest. Lower back to floor. Reset position each rep.",
      "cues": "Dead stop each rep, explosive pull, chest high, reset every time"
    }
  },
  "Yates Row": {
    "description": {
      "overview": "Underhand barbell row with more upright torso. Emphasizes lower lats and biceps involvement.",
      "setup": "Underhand grip, more upright than traditional row. Torso at 45-degree angle instead of parallel.",
      "movement": "Row bar to lower abdomen with underhand grip. Feel biceps and lower lats working. Control descent.",
      "cues": "Underhand grip, more upright, pull to belly, feel biceps helping, squeeze lats"
    }
  },
  "Barbell Shrug": {
    "description": {
      "overview": "Isolation exercise for upper traps using barbell. Builds trap mass and strength through elevation movement.",
      "setup": "Barbell at arm's length, standing tall. Feet hip-width, shoulders back and down to start.",
      "movement": "Shrug shoulders straight up as high as possible. Squeeze traps at top. Lower with control.",
      "cues": "Straight up not forward, squeeze at top, feel traps working, control the negative"
    }
  },
  "Barbell Curl": {
    "description": {
      "overview": "Standing bicep curl using barbell. Classic mass-building exercise for bicep development and arm strength.",
      "setup": "Barbell at arm's length, standing with core engaged. Elbows at sides, shoulders back.",
      "movement": "Curl bar up using only biceps. No swinging or momentum. Squeeze at top. Lower with control.",
      "cues": "Elbows stay put, no swinging, squeeze biceps, control the negative, strict form"
    }
  },
  "Barbell Skull Crusher": {
    "description": {
      "overview": "Tricep isolation exercise lying on bench. Builds tricep mass and strength through elbow extension.",
      "setup": "Lying on bench with barbell over chest. Arms extended, narrow grip. Core engaged.",
      "movement": "Lower bar toward forehead by bending elbows only. Extend back to start. Keep elbows stationary.",
      "cues": "Only elbows move, to forehead not chest, stretch triceps, strong extension"
    }
  },
  "Barbell Upright Row": {
    "description": {
      "overview": "Vertical pulling exercise targeting shoulders and traps. Builds shoulder width and upper back development.",
      "setup": "Barbell at arm's length with narrow grip. Standing tall, core engaged for stability.",
      "movement": "Pull bar straight up leading with elbows. Bar stays close to body. Pull to chest level.",
      "cues": "Elbows lead, bar stays close, pull to chest, feel shoulders and traps"
    }
  },
  "Bradford Press": {
    "description": {
      "overview": "Behind-neck to front press without lockout. Builds shoulder endurance and stability through partial range.",
      "setup": "Bar in front rack position. Light weight recommended. Mobility required for behind-neck position.",
      "movement": "Press partially up, bring behind neck, press back to front. Continuous tension throughout.",
      "cues": "Light weight only, mobility required, continuous motion, feel shoulders burning"
    }
  },
  "Barbell Landmine Press": {
    "description": {
      "overview": "Single-arm pressing using landmine setup. Provides unique angle and challenges core stability.",
      "setup": "Barbell in landmine, one hand holding end. Athletic stance, core engaged for stability.",
      "movement": "Press barbell up and forward in arc motion. Feel chest and shoulders working. Control descent.",
      "cues": "Arc motion not straight, core stays tight, feel chest and shoulders, control the path"
    }
  },
  "Barbell Rollout": {
    "description": {
      "overview": "Core exercise rolling barbell forward from knees. Advanced ab exercise building tremendous core strength.",
      "setup": "Kneeling with hands on barbell. Core maximally braced. Ready to roll forward while maintaining position.",
      "movement": "Roll bar forward while maintaining straight line. Feel massive ab stretch. Roll back with control.",
      "cues": "Core on fire, straight line, feel ab stretch, don't collapse, control back"
    }
  },
  "Meadows Row": {
    "description": {
      "overview": "Single-arm landmine row with parallel stance. Unique pulling angle for lat development and core challenge.",
      "setup": "Barbell in landmine, parallel stance. One hand on bar end, wide base for stability.",
      "movement": "Row barbell to hip with parallel stance. Feel lat working through unique angle. Control stretch.",
      "cues": "Parallel stance, row to hip, unique angle, feel the lat, control the stretch"
    }
  },
  "Trap Bar Deadlift": {
    "description": {
      "overview": "Deadlift using hexagonal trap bar. More quad-dominant than conventional, easier on lower back.",
      "setup": "Stand inside trap bar, grab handles. More upright position than conventional deadlift.",
      "movement": "Drive through legs while chest rises. More leg drive than conventional. Lock out standing tall.",
      "cues": "Stand up tall, more leg drive, chest up, feel quads working, easier on back"
    }
  },
  "Cambered Bar Squat": {
    "description": {
      "overview": "Squat using cambered bar for accommodating resistance. Bar flexes providing different resistance curve.",
      "setup": "Cambered bar on upper back. May feel bouncy or springy. Standard squat stance and position.",
      "movement": "Squat with cambered bar feeling different resistance. Bar may assist at bottom, resist at top.",
      "cues": "Feel the different resistance, control the spring, use the bar's help, unique feel"
    }
  },
  "Barbell High Pull": {
    "description": {
      "overview": "Explosive pulling movement from floor to chest level. Builds power and teaches clean mechanics.",
      "setup": "Deadlift position with barbell. Athletic stance, ready for explosive triple extension.",
      "movement": "Deadlift explosively, then continue pulling bar to chest level. Elbows high. Control descent.",
      "cues": "Explosive pull, elbows high, pull to chest, triple extension, control down"
    }
  },
  "Power Clean": {
    "description": {
      "overview": "Explosive movement from floor to front rack position. Olympic lift developing total-body power.",
      "setup": "Deadlift position with clean grip. Athletic stance, ready for explosive movement and catch.",
      "movement": "Deadlift explosively, high pull, drop under bar catching in front rack. Stand to finish.",
      "cues": "Explosive pull, drop under bar, catch in front rack, fast elbows, stand tall"
    }
  },
  "Power Snatch": {
    "description": {
      "overview": "Explosive movement from floor to overhead in one motion. Olympic lift requiring technique and power.",
      "setup": "Wide grip deadlift position. Athletic stance, ready for explosive movement to overhead catch.",
      "movement": "Deadlift explosively, high pull, drop under catching overhead. Stand to complete lift.",
      "cues": "Wide grip, explosive pull, drop under, catch overhead, fast turnover, stand strong"
    }
  },
  "Resistance Band Circuit Interval": {
    "description": {
      "overview": "Multi-exercise circuit using resistance bands for time. Builds endurance while targeting multiple muscle groups.",
      "setup": "Multiple resistance bands ready for various exercises. Stations set up for quick transitions.",
      "movement": "Rotate through band exercises for prescribed time. Maintain intensity throughout circuit.",
      "cues": "Quick transitions, maintain tension, feel muscles working, push through fatigue"
    }
  },
  "Back Thickness Intervals": {
    "description": {
      "overview": "High-intensity back-focused exercises performed in intervals. Builds back endurance and thickness.",
      "setup": "Back exercise stations ready (rows, pull-ups, pulldowns). Quick transitions between exercises.",
      "movement": "Perform back exercises at high intensity for time. Focus on back muscles throughout.",
      "cues": "Feel back working, maintain intensity, squeeze between shoulders, power through"
    }
  },
  "Leg Power Intervals": {
    "description": {
      "overview": "Explosive leg exercises performed in intervals. Develops lower body power and conditioning.",
      "setup": "Plyometric exercises ready (jump squats, box jumps, bounds). Safe landing surface.",
      "movement": "Explosive leg movements for time. Focus on power output and quick ground contact.",
      "cues": "Explosive movements, quick ground contact, maintain power, land softly"
    }
  },
  "Bicycle Crunches": {
    "description": {
      "overview": "Dynamic core exercise alternating elbow to knee in supine position. Targets obliques and rectus abdominis.",
      "setup": "Lying on back, hands behind head, knees bent up. Lower back pressed to floor.",
      "movement": "Bring opposite elbow to knee while extending other leg. Alternate in cycling motion.",
      "cues": "Opposite elbow to knee, cycling motion, back stays flat, feel obliques working"
    }
  },
  "Glute Squeezes": {
    "description": {
      "overview": "Isometric glute activation exercise. Simple but effective for glute activation and mind-muscle connection.",
      "setup": "Standing, sitting, or lying position. Focus on glute muscles, ready for contraction.",
      "movement": "Squeeze glutes as hard as possible. Hold contraction for specified time. Release and repeat.",
      "cues": "Maximum squeeze, hold the contraction, feel glutes working, mind-muscle connection"
    }
  },
  "Straight Leg Raises": {
    "description": {
      "overview": "Core exercise lifting straight legs from supine position. Targets lower abs and hip flexors.",
      "setup": "Lying on back, legs straight, hands at sides or under glutes. Lower back neutral.",
      "movement": "Raise straight legs to vertical without touching floor between reps. Control the movement.",
      "cues": "Legs stay straight, back flat on floor, control up and down, breathe out on lift"
    }
  },
  "Lateral Bounds": {
    "description": {
      "overview": "Plyometric exercise jumping laterally from one foot to other. Builds lateral power and stability.",
      "setup": "Athletic stance ready to bound sideways. Clear lateral space for movement.",
      "movement": "Bound laterally landing on outside foot, absorb and bound back. Continuous lateral movement.",
      "cues": "Explosive sideways, soft landings, absorb and explode, maintain rhythm"
    }
  },
  "Tandem Walking": {
    "description": {
      "overview": "Balance exercise walking heel-to-toe in straight line. Improves balance and proprioception.",
      "setup": "Standing ready to walk in straight line. Arms out for balance if needed.",
      "movement": "Walk placing heel directly in front of toes. Maintain straight line, eyes forward.",
      "cues": "Heel to toe, straight line, eyes forward, arms for balance, controlled pace"
    }
  },
  "Walking Knee Hugs": {
    "description": {
      "overview": "Dynamic hip flexor stretch while walking. Improves hip mobility and activates glutes.",
      "setup": "Standing ready to walk forward while performing knee hugs to chest.",
      "movement": "Walk forward pulling alternating knees to chest. Feel hip flexor stretch and glute activation.",
      "cues": "Knee to chest, feel hip flexor stretch, opposite glute squeeze, maintain walking pace"
    }
  },
  "Heel Walks": {
    "description": {
      "overview": "Walking on heels with toes lifted. Strengthens shin muscles and improves ankle dorsiflexion.",
      "setup": "Standing with toes lifted up, weight on heels. Ready to walk on heels only.",
      "movement": "Walk forward on heels keeping toes lifted throughout. Feel shin muscles working.",
      "cues": "Toes stay up, walk on heels only, feel shins working, maintain lifted toes"
    }
  },
  "Jumping Jacks": {
    "description": {
      "overview": "Classic full-body exercise jumping feet apart while raising arms. Builds cardiovascular fitness and coordination.",
      "setup": "Standing with feet together, arms at sides. Ready for rhythmic jumping movement.",
      "movement": "Jump feet apart while raising arms overhead. Return to start position. Maintain rhythm.",
      "cues": "Rhythmic movement, arms and legs coordinate, land softly, maintain steady pace"
    }
  },
  "High Knees": {
    "description": {
      "overview": "Running in place bringing knees high toward chest. Builds hip flexor strength and cardiovascular fitness.",
      "setup": "Standing ready to run in place. Focus on bringing knees as high as possible.",
      "movement": "Run in place bringing alternating knees to chest level. Quick feet, high knees.",
      "cues": "Knees to chest, quick feet, stay on balls of feet, pump arms"
    }
  },
  "Butt Kicks": {
    "description": {
      "overview": "Running in place kicking heels toward glutes. Improves hamstring flexibility and coordination.",
      "setup": "Standing ready to run in place. Focus on kicking heels back toward glutes.",
      "movement": "Run in place kicking alternating heels back toward glutes. Quick turnover.",
      "cues": "Heels to glutes, quick turnover, light on feet, feel hamstrings"
    }
  },
  "Alternating Jump Lunges": {
    "description": {
      "overview": "Explosive lunge variation jumping and switching legs mid-air. Builds lower body power and coordination.",
      "setup": "Start in lunge position. Ready for explosive jumping movement with leg switching.",
      "movement": "Jump explosively switching legs in air, landing in opposite lunge. Continuous alternating.",
      "cues": "Explosive jump, switch legs in air, soft landings, maintain rhythm"
    }
  },
  "Tuck Jumps": {
    "description": {
      "overview": "Explosive jump bringing knees to chest. Develops vertical power and core strength.",
      "setup": "Athletic stance ready for maximum vertical jump. Clear overhead space.",
      "movement": "Jump vertically bringing knees to chest. Land softly and immediately repeat.",
      "cues": "Maximum jump height, knees to chest, soft landings, continuous rhythm"
    }
  },
  "Skaters": {
    "description": {
      "overview": "Lateral plyometric exercise mimicking speed skating motion. Builds lateral power and single-leg stability.",
      "setup": "Athletic stance ready to bound laterally. Clear lateral space for movement.",
      "movement": "Bound laterally landing on outside leg while sweeping inside leg behind. Alternate sides.",
      "cues": "Explosive lateral bounds, land on outside leg, sweep behind, maintain balance"
    }
  },
  "Banded Shoulder Dislocations": {
    "description": {
      "overview": "Shoulder mobility exercise using resistance band. Improves shoulder flexibility and prepares shoulders for overhead work.",
      "setup": "Hold resistance band with wide grip, arms extended. Band should have light tension.",
      "movement": "Pass band over head and behind back keeping arms straight. Return to front. Feel shoulder stretch.",
      "cues": "Arms stay straight, wide grip, feel shoulder stretch, control the movement"
    }
  },
  "Leg Swings": {
    "description": {
      "overview": "Dynamic hip mobility exercise swinging leg forward and back. Prepares hips for movement and improves range.",
      "setup": "Hold support for balance, swing leg ready. Standing leg stable, core engaged.",
      "movement": "Swing leg forward and back in controlled motion. Feel hip flexors and hamstrings warming.",
      "cues": "Controlled swings, feel hip opening, use support for balance, both directions"
    }
  },
  "Hip Circles": {
    "description": {
      "overview": "Hip mobility exercise making circles with raised knee. Improves hip range of motion and activation.",
      "setup": "Standing with support if needed. Ready to lift knee and make circular motions.",
      "movement": "Lift knee and make circles, opening hip through full range. Both directions, both legs.",
      "cues": "Full circles, feel hip opening, both directions, control the movement"
    }
  },
  "Knee to Chest": {
    "description": {
      "overview": "Hip flexor and glute stretch bringing knee toward chest. Simple mobility exercise for hip preparation.",
      "setup": "Standing or lying position. Ready to bring knee toward chest for stretch.",
      "movement": "Pull knee toward chest feeling stretch in hip and glute. Hold briefly, switch legs.",
      "cues": "Knee to chest, feel the stretch, gentle pull, breathe into stretch"
    }
  },
  "Ankle Pumps": {
    "description": {
      "overview": "Ankle mobility exercise flexing and pointing feet. Improves ankle range and activates lower leg muscles.",
      "setup": "Sitting or lying with legs extended. Feet ready for flexion and extension movements.",
      "movement": "Flex feet pulling toes back, then point toes away. Feel ankle and calf muscles working.",
      "cues": "Pull toes back, point toes away, feel ankle moving, controlled movement"
    }
  },
  "Ankle Circles": {
    "description": {
      "overview": "Ankle mobility exercise making circles with feet. Improves ankle range in all directions.",
      "setup": "Sitting or standing, ready to lift foot and make circular motions.",
      "movement": "Make circles with foot, moving ankle through full range. Both directions, both ankles.",
      "cues": "Full circles, move ankle through range, both directions, feel the movement"
    }
  },
  "Leg Pendulums": {
    "description": {
      "overview": "Gentle leg swings for hip mobility. Low-intensity movement to prepare hips and improve range.",
      "setup": "Standing with support, ready for gentle leg swinging motions.",
      "movement": "Gently swing leg side to side like pendulum. Relaxed, rhythmic movement for hip mobility.",
      "cues": "Gentle swings, relaxed movement, feel hip loosening, rhythmic motion"
    }
  },
  "Arm Circles": {
    "description": {
      "overview": "Shoulder mobility exercise making circles with arms. Warms up shoulders and improves range of motion.",
      "setup": "Standing with arms extended to sides. Ready for circular arm movements.",
      "movement": "Make circles with arms, starting small and increasing size. Both forward and backward directions.",
      "cues": "Start small, increase size, both directions, feel shoulders warming up"
    }
  },
  "Shoulder Rolls": {
    "description": {
      "overview": "Shoulder mobility exercise rolling shoulders up, back, and down. Relieves tension and improves shoulder function.",
      "setup": "Standing tall with arms at sides. Ready for shoulder rolling movements.",
      "movement": "Roll shoulders up, back, and down in circular motion. Feel tension releasing.",
      "cues": "Up, back, and down, feel tension release, smooth circles, both directions"
    }
  },
  "Low Box Squat": {
    "description": {
      "overview": "Box squat to lower box targeting deeper range. Builds strength at bottom position while teaching depth.",
      "setup": "Low box below parallel, bar positioned as preferred. Wider stance typically used.",
      "movement": "Sit back to low box maintaining tension. Brief pause. Explode up from deeper position.",
      "cues": "Sit back to low box, stay tight, explode from deep position, control the depth"
    }
  },
  "High Box Squat": {
    "description": {
      "overview": "Box squat to higher box around parallel. Teaches squat mechanics while building confidence.",
      "setup": "Box at parallel height, bar positioned as preferred. Standard squat stance.",
      "movement": "Sit back to box at parallel. Brief pause maintaining tension. Drive up from seated position.",
      "cues": "Sit to parallel, stay tight on box, drive up strong, build confidence"
    }
  },
  "Couch Stretch": {
    "description": {
      "overview": "Deep hip flexor stretch using couch or elevated surface. Targets tight hip flexors from sitting.",
      "setup": "Back foot elevated on couch, front leg in lunge position. Hands on front thigh for support.",
      "movement": "Sink into stretch feeling deep hip flexor stretch. Hold position, breathe into stretch.",
      "cues": "Deep hip flexor stretch, sink into position, breathe deeply, feel the release"
    }
  },
  "Standing Hip Flexor Stretch": {
    "description": {
      "overview": "Hip flexor stretch in standing lunge position. Accessible stretch for tight hip flexors.",
      "setup": "Lunge position with back leg straight. Hands on front thigh or hips for support.",
      "movement": "Push hips forward feeling stretch in back leg hip flexor. Hold and breathe into stretch.",
      "cues": "Push hips forward, feel back leg hip flexor, breathe into stretch, gentle pressure"
    }
  },
  "Pigeon Prep Stretch": {
    "description": {
      "overview": "Modified pigeon pose for hip and glute flexibility. Targets hip external rotators and glutes.",
      "setup": "Front leg bent at 90 degrees, back leg extended. Hands supporting upper body.",
      "movement": "Sink into stretch feeling hip and glute opening. Breathe deeply into the stretch.",
      "cues": "Front leg bent, back leg straight, sink into stretch, breathe deeply"
    }
  },
  "Gentle Quad Stretch": {
    "description": {
      "overview": "Standing quadriceps stretch holding foot behind. Gentle stretch for front of thigh.",
      "setup": "Standing with support if needed. Ready to pull foot behind toward glute.",
      "movement": "Pull foot behind feeling gentle quad stretch. Hold position, breathe into stretch.",
      "cues": "Gentle pull, feel front of thigh, use support for balance, breathe deeply"
    }
  },
  "Bodyweight Chin/Pull-Ups": {
    "description": {
      "overview": "Unweighted pull-ups or chin-ups using body weight only. Fundamental upper body pulling exercise building back and arm strength.",
      "setup": "Dead hang from bar with grip of choice. Arms fully extended, core engaged, legs together or crossed.",
      "movement": "Pull body up until chin clears bar. Control descent to full arm extension. Strict form throughout.",
      "cues": "Pull elbows to ribs, chin over bar, squeeze at top, control the negative, no swinging"
    }
  },
  "Kettlebell Bottoms-Up Press": {
    "description": {
      "overview": "Overhead press holding kettlebell upside down by handle. Extreme stability challenge requiring maximum grip and core strength.",
      "setup": "Kettlebell in rack position upside down, bell pointing up. Maximum grip strength required to stabilize.",
      "movement": "Press unstable kettlebell overhead maintaining control. Bell stays perfectly vertical. Lower with extreme control.",
      "cues": "Crush the handle, bell stays vertical, maximum tension, slow and controlled, core on fire"
    }
  },
  "Kettlebell Figure 8": {
    "description": {
      "overview": "Dynamic kettlebell movement passing bell between legs in figure-8 pattern. Builds grip strength, coordination, and hip mobility.",
      "setup": "Wide stance with kettlebell in one hand. Ready to pass bell between legs in continuous figure-8.",
      "movement": "Pass kettlebell between legs from hand to hand in figure-8 pattern. Smooth, continuous rhythm.",
      "cues": "Smooth figure-8, hand to hand, hips stay back, grip strength challenge, continuous flow"
    }
  },
  "Dumbbell Swings": {
    "description": {
      "overview": "Kettlebell swing motion using dumbbell. Hip-hinge power exercise when kettlebells aren't available.",
      "setup": "Hold dumbbell by one end with both hands. Feet wider than shoulders, ready for hip drive.",
      "movement": "Hike dumbbell back between legs, explosive hip snap forward. Float dumbbell to shoulder height.",
      "cues": "Explosive hips, float don't lift, snap like whip, dumbbell stays close, hip drive"
    }
  },
  "IT Band Roll": {
    "description": {
      "overview": "Self-massage using foam roller on IT band. Releases tension in iliotibial band running along outer thigh.",
      "setup": "Lying on side with foam roller under outer thigh. Support body weight with arms and opposite leg.",
      "movement": "Roll slowly along IT band from hip to just above knee. Pause on tender spots. Control pressure.",
      "cues": "Slow rolling, control pressure, pause on tender spots, breathe through discomfort"
    }
  },
  "Hip Flexor Roll": {
    "description": {
      "overview": "Foam rolling for hip flexor muscles. Releases tension in front of hips from prolonged sitting.",
      "setup": "Face down with roller under front of hip/thigh. Support body weight on forearms.",
      "movement": "Roll slowly over hip flexor area. Apply controlled pressure. Focus on tender areas.",
      "cues": "Face down position, slow movements, controlled pressure, breathe into tight spots"
    }
  },
  "Quad Roll": {
    "description": {
      "overview": "Foam rolling for quadriceps muscles. Releases tension and improves flexibility in front thigh muscles.",
      "setup": "Face down with roller under front of thighs. Support weight on forearms, feet off ground.",
      "movement": "Roll slowly from hip to just above knee. Cover all four quadriceps muscles. Pause on tight spots.",
      "cues": "Face down, slow rolling, cover all quad muscles, pause on tight areas, control pressure"
    }
  },
  "Glute Roll": {
    "description": {
      "overview": "Foam rolling for glute muscles. Releases tension in buttocks and improves hip function.",
      "setup": "Sitting on roller with one leg crossed over. Support with hands, lean into working glute.",
      "movement": "Roll slowly over glute muscle. Apply pressure by leaning into roller. Focus on tight areas.",
      "cues": "Lean into working side, slow movements, find tight spots, control the pressure"
    }
  },
  "Calf Roll": {
    "description": {
      "overview": "Foam rolling for calf muscles. Releases tension in lower leg and improves ankle mobility.",
      "setup": "Sitting with roller under calf. Other leg crossed over for added pressure or both legs together.",
      "movement": "Roll slowly from ankle to just below knee. Cover both gastrocnemius and soleus muscles.",
      "cues": "Slow rolling motion, cover whole calf, add pressure with other leg, pause on tender spots"
    }
  },
  "Mobility Work": {
    "description": {
      "overview": "General term for movement preparation and flexibility exercises. Improves range of motion and prepares body for activity.",
      "setup": "Various positions depending on specific mobility needs. Focus on areas requiring attention.",
      "movement": "Perform targeted movements to improve range of motion. Hold stretches, perform dynamic movements.",
      "cues": "Target specific areas, gentle progressive movement, breathe into stretches, listen to body"
    }
  },
  "Shoulder Mobility": {
    "description": {
      "overview": "Specific mobility work for shoulder joint and surrounding muscles. Improves overhead range and shoulder health.",
      "setup": "Various positions for shoulder movement. May use bands, walls, or partner assistance.",
      "movement": "Move shoulders through full range of motion. Target tight areas. Progress gradually.",
      "cues": "Full range of motion, target restrictions, progress gradually, no forcing movement"
    }
  },
  "Joint Mobility Drills": {
    "description": {
      "overview": "Systematic movement preparation for all major joints. Prepares body for exercise and improves function.",
      "setup": "Standing or seated ready to move joints through their ranges. Systematic head-to-toe approach.",
      "movement": "Move each joint through its full range systematically. Start small, increase range gradually.",
      "cues": "Systematic approach, start small, increase range, all major joints, controlled movements"
    }
  },
  "Dynamic Movement Prep": {
    "description": {
      "overview": "Active warm-up using movement patterns. Prepares nervous system and muscles for training through movement.",
      "setup": "Clear space for movement. Ready to perform progressively intense movement patterns.",
      "movement": "Perform dynamic movements that mimic training patterns. Progress from low to higher intensity.",
      "cues": "Progressive intensity, mimic training movements, activate nervous system, prepare for work"
    }
  },
  "Band Work": {
    "description": {
      "overview": "Resistance exercises using elastic bands. Provides variable resistance and excellent for activation and rehabilitation.",
      "setup": "Resistance bands ready for various exercises. Anchor points secured as needed.",
      "movement": "Perform resistance exercises using band tension. Focus on controlled movements and muscle activation.",
      "cues": "Control the resistance, feel muscle activation, variable resistance, smooth movements"
    }
  },
  "Arm and Leg Swings": {
    "description": {
      "overview": "Dynamic warm-up movements swinging limbs through range of motion. Prepares joints and muscles for activity.",
      "setup": "Standing with support if needed. Ready to swing arms and legs through full ranges.",
      "movement": "Swing arms and legs in various directions. Start small, increase range. Feel joints warming.",
      "cues": "Progressive range, various directions, feel joints warming, controlled swinging"
    }
  },
  "Dynamic Movement": {
    "description": {
      "overview": "Active movement patterns for warm-up and preparation. Engages nervous system and prepares body for training.",
      "setup": "Clear space for various movement patterns. Ready for progressive activity.",
      "movement": "Perform active movements that prepare body for training. Increase intensity progressively.",
      "cues": "Active movements, nervous system activation, progressive intensity, prepare for training"
    }
  },
  "Dead Bug": {
    "description": {
      "overview": "Core stability exercise with reciprocal limb movement. Teaches spinal stability while moving arms and legs independently.",
      "setup": "Lying on back, arms reaching up, knees bent 90° over hips. Lower back pressed into floor.",
      "movement": "Lower opposite arm and leg toward floor. Maintain back contact with floor. Return to start. Alternate sides.",
      "cues": "Back stays flat, slow and controlled, breathe throughout, opposite arm and leg"
    }
  },
  "Mobility Flow": {
    "description": {
      "overview": "Continuous sequence of mobility exercises flowing from one to another. Comprehensive movement preparation.",
      "setup": "Clear space for flowing movements. Ready to transition smoothly between mobility exercises.",
      "movement": "Flow smoothly from one mobility exercise to another. Maintain continuous movement and breathing.",
      "cues": "Smooth transitions, continuous flow, maintain breathing, comprehensive movement prep"
    }
  },
  "EMOM 12 minutes": {
    "description": {
      "overview": "Every Minute on the Minute protocol for 12 minutes. Structured interval training building work capacity and mental toughness.",
      "setup": "Timer set for 12 minutes. Exercise stations ready. Know your target reps for each minute.",
      "movement": "Perform prescribed reps at start of each minute. Rest remaining time. Repeat for 12 minutes.",
      "cues": "Work at minute start, use rest wisely, maintain quality, push through fatigue"
    }
  },
  "Incline Bench EMOM": {
    "description": {
      "overview": "Incline bench press performed in EMOM format until failure. Builds pressing endurance and mental toughness.",
      "setup": "Incline bench ready with appropriate weight. Timer set. Safety bars or spotter recommended.",
      "movement": "Perform reps every minute until unable to complete prescribed reps. Track total volume.",
      "cues": "Quality reps every minute, track your volume, fight through fatigue, maintain form"
    }
  },
  "Strict Barbell Row EMOM": {
    "description": {
      "overview": "Strict barbell rows in EMOM format until failure. Builds back endurance and rowing strength.",
      "setup": "Barbell ready in bent-over position. Timer set. Maintain strict form throughout.",
      "movement": "Perform strict rows every minute until form breaks down. No body english allowed.",
      "cues": "Strict form only, every minute counts, feel back working, maintain position"
    }
  },
  "Z Press EMOM": {
    "description": {
      "overview": "Z press performed in EMOM format until failure. Ultimate core and shoulder endurance challenge.",
      "setup": "Seated on floor, legs straight. Barbell in rack position. Timer ready for EMOM protocol.",
      "movement": "Press overhead every minute until unable to complete reps. Core works overtime.",
      "cues": "Seated position strict, core on fire, every minute press, fight the fatigue"
    }
  },
  "Push Press EMOM": {
    "description": {
      "overview": "Push press in EMOM format building explosive overhead strength endurance. Uses leg drive for assistance.",
      "setup": "Barbell in front rack, timer ready. Space cleared for explosive movement.",
      "movement": "Explosive push press every minute until failure. Use leg drive efficiently.",
      "cues": "Explosive every minute, use leg drive, overhead lockout, maintain power"
    }
  },
  "Barbell Cheat Row EMOM": {
    "description": {
      "overview": "Barbell rows with controlled body english in EMOM format. Allows heavier loading than strict rows.",
      "setup": "Heavier barbell ready, timer set. Controlled cheating allowed but still focus on back.",
      "movement": "Row with slight body assistance every minute until failure. Still emphasize back muscles.",
      "cues": "Controlled cheating, still feel back, heavier than strict, every minute counts"
    }
  },
  "Seated Forward Fold": {
    "description": {
      "overview": "Seated hamstring stretch reaching forward toward toes. Classic flexibility exercise for posterior chain.",
      "setup": "Seated with legs extended straight. Hands ready to reach toward feet.",
      "movement": "Fold forward from hips reaching toward toes. Feel hamstring stretch. Breathe into stretch.",
      "cues": "Fold from hips, reach toward toes, feel hamstring stretch, breathe deeply"
    }
  },
  "Seated Spinal Twist": {
    "description": {
      "overview": "Seated rotation stretch for spine and surrounding muscles. Improves spinal mobility and releases tension.",
      "setup": "Seated with one leg straight, other crossed over. Hand behind for support.",
      "movement": "Rotate spine toward bent leg using arm for gentle pressure. Feel spinal rotation.",
      "cues": "Gentle rotation, feel spinal twist, breathe into stretch, both directions"
    }
  },
  "IT Band Stretch": {
    "description": {
      "overview": "Stretch for iliotibial band running along outer thigh. Addresses common tightness from running and sitting.",
      "setup": "Standing with legs crossed or lying on side. Various positions available.",
      "movement": "Stretch outer thigh by leaning into position. Feel IT band tension release.",
      "cues": "Feel outer thigh stretch, gentle pressure, breathe into stretch, hold position"
    }
  },
  "Hamstring Stretch": {
    "description": {
      "overview": "Targeted stretch for hamstring muscles. Essential for posterior chain flexibility and injury prevention.",
      "setup": "Various positions available - standing, seated, or supine. Choose comfortable position.",
      "movement": "Stretch hamstring by extending leg and reaching toward foot. Feel back of thigh stretch.",
      "cues": "Feel back of thigh, gentle progressive stretch, breathe deeply, maintain position"
    }
  },
  "Sun Salutation A": {
    "description": {
      "overview": "Traditional yoga sequence flowing through multiple poses. Builds flexibility, strength, and mind-body connection.",
      "setup": "Yoga mat ready. Clear space for flowing movements. Focus on breath and movement.",
      "movement": "Flow through mountain pose, forward fold, half lift, chaturanga, upward dog, downward dog sequence.",
      "cues": "Flow with breath, smooth transitions, focus inward, traditional sequence"
    }
  },
  "Warrior Sequence": {
    "description": {
      "overview": "Yoga sequence focusing on warrior poses. Builds strength, balance, and flexibility through standing poses.",
      "setup": "Yoga mat with space for lunging movements. Focus on alignment and breathing.",
      "movement": "Flow through warrior I, II, and III poses. Hold positions, breathe deeply.",
      "cues": "Strong foundation, breathe deeply, hold positions, focus on alignment"
    }
  },
  "Balance Series": {
    "description": {
      "overview": "Sequence of balance-challenging poses and movements. Improves proprioception and stability.",
      "setup": "Clear space for balance challenges. May use props for assistance initially.",
      "movement": "Progress through various balance positions. Hold steady, breathe normally.",
      "cues": "Find center, breathe normally, use focus point, progress gradually"
    }
  },
  "Hip Opening Flow": {
    "description": {
      "overview": "Yoga sequence targeting hip flexibility and mobility. Addresses common hip tightness from modern lifestyle.",
      "setup": "Yoga mat ready. Props available for support. Focus on hip area.",
      "movement": "Flow through hip opening poses. Breathe into tight areas. Progress gradually.",
      "cues": "Breathe into hips, gentle progressive opening, listen to body, flow smoothly"
    }
  },
  "Restorative Yoga": {
    "description": {
      "overview": "Gentle yoga practice using props for support. Focuses on relaxation, stress relief, and recovery.",
      "setup": "Props available - bolsters, blocks, straps. Comfortable environment for relaxation.",
      "movement": "Hold supported poses for extended time. Focus on breathing and relaxation.",
      "cues": "Deep relaxation, supported positions, breathe deeply, release tension"
    }
  },
  "Yoga Session": {
    "description": {
      "overview": "Complete yoga practice combining various elements. Includes warm-up, poses, and relaxation.",
      "setup": "Yoga mat in quiet space. Props available as needed. Set intention for practice.",
      "movement": "Flow through complete practice including various poses and breathing exercises.",
      "cues": "Set intention, breathe consciously, listen to body, end with relaxation"
    }
  },
  "Glute Activation Circuit": {
    "description": {
      "overview": "Circuit targeting glute muscles for activation and strength. Essential for hip health and athletic performance.",
      "setup": "Resistance bands and space for various glute exercises. Timer set for work/rest intervals.",
      "movement": "Rotate through glute-focused exercises. Maintain constant muscle tension. Feel glutes working.",
      "cues": "Feel glutes working, maintain tension, focus on muscle activation, quality over speed"
    }
  },
  "HIIT Circuit 1": {
    "description": {
      "overview": "High-intensity interval circuit using bodyweight exercises. Builds cardiovascular fitness and strength endurance.",
      "setup": "Clear space for explosive movements. Timer set for 40 seconds work, 20 seconds rest.",
      "movement": "Maximum effort for work periods. Full rest during rest periods. Push intensity throughout.",
      "cues": "All-out effort, use rest fully, maintain intensity, embrace the challenge"
    }
  },
  "Single-arm Dumbbell Row": {
    "description": {
      "overview": "Unilateral rowing movement in circuit format. Builds back strength while challenging core stability.",
      "setup": "Dumbbell ready, support surface available. Timed intervals for continuous work.",
      "movement": "Row dumbbell continuously for time. Switch arms as prescribed. Maintain form under fatigue.",
      "cues": "Feel lat working, maintain form, switch arms smoothly, control under fatigue"
    }
  },
  "Reverse Lunges with Bicep Curls": {
    "description": {
      "overview": "Combination exercise linking lower body lunge with upper body curl. Maximizes time efficiency in circuits.",
      "setup": "Dumbbells at sides, space for lunging. Ready for coordinated upper and lower body work.",
      "movement": "Perform reverse lunge while curling dumbbells. Coordinate movements. Feel legs and arms working.",
      "cues": "Coordinate movements, feel legs and arms, smooth transitions, maintain balance"
    }
  },
  "Dumbbell Deadlift to Upright Row": {
    "description": {
      "overview": "Combination movement flowing from deadlift to upright row. Full-body exercise maximizing muscle recruitment.",
      "setup": "Dumbbells ready for fluid transition from deadlift to row. Space for complete movement.",
      "movement": "Deadlift dumbbells, then flow into upright row. Smooth transition between movements.",
      "cues": "Smooth transition, feel posterior chain then shoulders, fluid movement, control the weights"
    }
  },
  "Dumbbell Romanian Deadlifts": {
    "description": {
      "overview": "Hip-hinge movement using dumbbells for posterior chain development. Circuit version emphasizes endurance.",
      "setup": "Dumbbells ready for continuous RDL movement. Focus on hamstring and glute activation.",
      "movement": "Continuous RDLs for prescribed time. Maintain hip hinge pattern. Feel hamstrings working.",
      "cues": "Hips back, feel hamstrings, maintain pattern, control the weight"
    }
  },
  "Push-up to T-rotation": {
    "description": {
      "overview": "Push-up followed by rotation to side plank. Combines pushing strength with core rotation and stability.",
      "setup": "Clear space for push-up and rotation. Ready for coordinated upper body movement.",
      "movement": "Push-up, then rotate to side plank reaching arm up. Return to start. Alternate sides.",
      "cues": "Strong push-up, smooth rotation, reach high, feel core working, alternate sides"
    }
  },
  "Goblet Squats with Pulse": {
    "description": {
      "overview": "Goblet squat with pulsing at bottom position. Increases time under tension and muscular endurance.",
      "setup": "Dumbbell held at chest, ready for squat with pulses. Focus on maintaining position.",
      "movement": "Squat down, pulse at bottom, then return to top. Continuous tension in legs.",
      "cues": "Pulse at bottom, maintain position, feel leg burn, continuous tension"
    }
  },
  "Single-arm Overhead Press": {
    "description": {
      "overview": "Unilateral overhead pressing in circuit format. Challenges shoulder stability and core strength.",
      "setup": "Dumbbell at shoulder ready for pressing. Core engaged for stability challenge.",
      "movement": "Press dumbbell overhead continuously. Switch arms as prescribed. Fight anti-lateral flexion.",
      "cues": "Don't lean, core works hard, press straight up, switch arms smoothly"
    }
  },
  "Dumbbell Step-ups": {
    "description": {
      "overview": "Unilateral leg exercise stepping onto elevated surface with dumbbells. Builds single-leg strength and power.",
      "setup": "Sturdy box or bench, dumbbells at sides. Focus on using top leg to step up.",
      "movement": "Step up onto box using top leg. Control descent. Minimal push from bottom leg.",
      "cues": "Top leg does work, control up and down, no bouncing, feel working leg"
    }
  },
  "Power EMOM": {
    "description": {
      "overview": "Power-focused exercises performed in EMOM format. Builds explosive strength and power endurance.",
      "setup": "Power exercises ready (cleans, snatches, jumps). Timer set for EMOM protocol.",
      "movement": "Explosive power movements every minute. Focus on power output. Rest between minutes.",
      "cues": "Maximum power, explosive movement, reset between minutes, quality over quantity"
    }
  },
  "Core AMRAP": {
    "description": {
      "overview": "As Many Reps As Possible core-focused circuit. Builds core endurance and strength through high volume.",
      "setup": "Core exercise stations ready. Timer set for AMRAP duration. Track total reps.",
      "movement": "Maximum core exercise reps in time limit. Maintain form as fatigue sets in.",
      "cues": "Maximum reps, maintain form, track your score, push through core fatigue"
    }
  },
  "Gentle Walk + Stretching": {
    "description": {
      "overview": "Low-intensity walking combined with stretching. Perfect for recovery, stress relief, and gentle movement.",
      "setup": "Comfortable walking route planned. Stretching space available after walk.",
      "movement": "Walk at comfortable, conversational pace. Follow with gentle full-body stretching.",
      "cues": "Comfortable pace, breathe easily, gentle stretching, listen to body"
    }
  },
  "Optional Cardio": {
    "description": {
      "overview": "Flexible cardiovascular exercise of choice. Allows individual preference while meeting cardio needs.",
      "setup": "Cardio equipment or outdoor space available. Choose preferred activity.",
      "movement": "Perform preferred cardio activity at moderate intensity. Maintain conversational pace.",
      "cues": "Choose what you enjoy, moderate effort, conversational pace, stay consistent"
    }
  },
  "Evening Walk/Run": {
    "description": {
      "overview": "Gentle evening cardiovascular activity. Promotes recovery and helps with sleep quality.",
      "setup": "Safe walking or running route. Comfortable pace that doesn't interfere with sleep.",
      "movement": "Walk or light jog at comfortable pace. Focus on relaxation and stress relief.",
      "cues": "Comfortable pace, relax and unwind, prepare for rest, enjoy the movement"
    }
  },
  "Evening Walk": {
    "description": {
      "overview": "Relaxing walk in the evening for stress relief and light activity. Promotes recovery and mental wellness.",
      "setup": "Pleasant walking route, comfortable shoes. Focus on relaxation and mindfulness.",
      "movement": "Walk at leisurely pace focusing on relaxation. Use time for reflection or mindfulness.",
      "cues": "Leisurely pace, focus on relaxation, mindful walking, stress relief"
    }
  },
  "Cardio Build-up": {
    "description": {
      "overview": "Progressive cardiovascular warm-up building intensity gradually. Prepares body for higher intensity work.",
      "setup": "Cardio equipment ready. Plan progressive intensity increase over 5 minutes.",
      "movement": "Start easy, gradually increase intensity each minute. Prepare cardiovascular system.",
      "cues": "Start easy, build gradually, prepare the system, warm up thoroughly"
    }
  },
  "Light Walking": {
    "description": {
      "overview": "Easy-paced walking for recovery or gentle activity. Promotes blood flow without adding stress.",
      "setup": "Comfortable walking environment. Focus on easy, relaxed movement.",
      "movement": "Walk at very easy pace that feels restorative. No stress or intensity required.",
      "cues": "Very easy pace, restorative walking, no stress, gentle movement"
    }
  },
  "Sprint in Place": {
    "description": {
      "overview": "High-intensity running motion without forward movement. Builds cardiovascular fitness and leg power.",
      "setup": "Clear space for stationary running. Ready for high-intensity effort.",
      "movement": "Run in place at maximum effort. High knees, quick feet, pump arms vigorously.",
      "cues": "Maximum effort, high knees, quick feet, pump arms, breathe hard"
    }
  },
  "Complete Rest": {
    "description": {
      "overview": "Full recovery day with minimal physical activity. Essential for adaptation and preventing overtraining.",
      "setup": "Comfortable environment for relaxation. Eliminate training stress completely.",
      "movement": "Minimize physical stress. Focus on sleep, nutrition, and mental recovery.",
      "cues": "True rest, no training stress, prioritize recovery, listen to body"
    }
  },
  "Walking Recovery": {
    "description": {
      "overview": "Very gentle walking for active recovery. Promotes blood flow and recovery without adding stress.",
      "setup": "Easy walking environment. Focus on movement that aids recovery.",
      "movement": "Walk at very easy pace that feels good. Stop if any discomfort arises.",
      "cues": "Recovery pace only, feel good movement, stop if uncomfortable, aid recovery"
    }
  },
  "Bodyweight Circuit FOR TIME": {
    "description": {
      "overview": "Timed circuit using only bodyweight exercises. Challenges conditioning and mental toughness.",
      "setup": "Bodyweight exercises arranged in circuit. Timer ready for completion time tracking.",
      "movement": "Complete all exercises as fast as possible while maintaining form. Track completion time.",
      "cues": "Move fast, maintain form, track your time, push through fatigue"
    }
  },
  "Push Complex Circuit": {
    "description": {
      "overview": "Circuit focusing on pushing movement patterns. Builds upper body strength and endurance.",
      "setup": "Pushing exercises arranged in sequence. Various equipment for push movements.",
      "movement": "Rotate through pushing exercises with minimal rest. Feel chest, shoulders, triceps working.",
      "cues": "Focus on pushing muscles, minimal rest, maintain form, feel the burn"
    }
  },
  "Row Complex Circuit": {
    "description": {
      "overview": "Circuit emphasizing rowing and pulling movements. Develops back strength and pulls balance pressing.",
      "setup": "Rowing exercises arranged in circuit. Equipment for various pulling movements.",
      "movement": "Move through rowing exercises targeting all back muscles. Squeeze between shoulder blades.",
      "cues": "Squeeze back muscles, feel lats working, pull elbows back, maintain posture"
    }
  },
  "Bodyweight Circuit": {
    "description": {
      "overview": "General bodyweight exercise circuit. Uses body weight only for resistance and conditioning.",
      "setup": "Space for various bodyweight movements. No equipment required.",
      "movement": "Rotate through bodyweight exercises. Adjust intensity as needed for fitness level.",
      "cues": "Use body weight, adjust intensity, maintain form, no equipment needed"
    }
  },
  "Leg Circuit": {
    "description": {
      "overview": "Circuit targeting lower body muscles. Builds leg strength, power, and endurance.",
      "setup": "Leg exercises arranged in sequence. Space for squats, lunges, and plyometrics.",
      "movement": "Move through leg exercises feeling quads, glutes, and hamstrings working.",
      "cues": "Feel legs working, maintain form, push through leg fatigue, focus on lower body"
    }
  },
  "Jump Squat Circuit": {
    "description": {
      "overview": "Plyometric circuit emphasizing jump squats. Builds lower body power and explosiveness.",
      "setup": "Clear space for explosive jumping movements. Soft landing surface preferred.",
      "movement": "Perform various jump squat variations. Focus on explosive power and soft landings.",
      "cues": "Explosive jumps, soft landings, maximum power, quick ground contact"
    }
  },
  "Box Jumps or Jump Squats": {
    "description": {
      "overview": "Choice between box jumps or jump squats for plyometric training. Develops lower body power.",
      "setup": "Box available for jumps or clear space for jump squats. Choose based on preference.",
      "movement": "Perform explosive jumping movements. Focus on power development and safe landings.",
      "cues": "Explosive takeoff, safe landings, choose your preferred option, maximum power"
    }
  },
  "Single-arm Dumbbell Row (Interval)": {
    "description": {
      "overview": "Unilateral dumbbell row performed for timed intervals. Builds back endurance while challenging grip and core stability.",
      "setup": "Dumbbell ready, support surface available. Timer set for interval work periods.",
      "movement": "Row dumbbell continuously for time. Switch arms as prescribed. Maintain form under fatigue.",
      "cues": "Feel lat working, maintain form, switch arms smoothly, breathe with rhythm"
    }
  },
  "Push-up Interval (Rep-based)": {
    "description": {
      "overview": "Push-ups performed for specific rep targets in timed intervals. Builds upper body endurance and mental toughness.",
      "setup": "Clear space for push-ups. Timer ready for interval protocol. Know target reps.",
      "movement": "Perform target push-up reps within time limit. Rest remaining time. Maintain quality.",
      "cues": "Quality reps first, use rest time, maintain form, push through fatigue"
    }
  },
  "Upper Body Tri-Set Interval": {
    "description": {
      "overview": "Three upper body exercises performed back-to-back in interval format. Builds upper body endurance and strength.",
      "setup": "Three upper body exercise stations ready. Minimal transition time between exercises.",
      "movement": "Move through three exercises rapidly. Complete all three, then rest. Repeat for intervals.",
      "cues": "Quick transitions, feel upper body working, complete all three, earn your rest"
    }
  },
  "Knee Extensions (Seated)": {
    "description": {
      "overview": "Seated quadriceps isolation exercise extending knee against resistance. Builds quad strength and targets VMO.",
      "setup": "Seated position with resistance (machine, band, or weight). Back supported, knee at 90 degrees.",
      "movement": "Extend knee fully against resistance. Squeeze quadriceps hard at top. Lower with control.",
      "cues": "Full extension, squeeze quad hard, control the resistance, feel front thigh working"
    }
  },
  "Band Pull-Aparts": {
    "description": {
      "overview": "Rear delt and rhomboid exercise using resistance band. Excellent for posture improvement and shoulder health.",
      "setup": "Resistance band held at chest level, arms extended. Light to moderate resistance.",
      "movement": "Pull band apart by squeezing shoulder blades together. Feel rear delts working. Control return.",
      "cues": "Squeeze shoulder blades, feel rear delts, pull band apart, control the return"
    }
  },
  "Dynamic Warm-up": {
    "description": {
      "overview": "Active movement preparation using dynamic exercises. Prepares nervous system and muscles for training.",
      "setup": "Clear space for various dynamic movements. Progress from low to higher intensity.",
      "movement": "Perform dynamic movements that mimic training patterns. Gradually increase range and speed.",
      "cues": "Start easy, build intensity, mimic training movements, prepare nervous system"
    }
  },
  "Cat-Cow Stretches": {
    "description": {
      "overview": "Spinal mobility exercise alternating between flexion and extension. Improves spinal health and core awareness.",
      "setup": "On hands and knees, neutral spine position. Hands under shoulders, knees under hips.",
      "movement": "Arch back looking up (cow), then round spine looking down (cat). Smooth alternating rhythm.",
      "cues": "Smooth rhythm, arch and round, breathe with movement, feel spine moving"
    }
  },
  "Knee Circles (Standing)": {
    "description": {
      "overview": "Standing knee mobility exercise making circles with lifted knee. Improves hip range of motion.",
      "setup": "Standing with support if needed. Ready to lift knee and make circular motions.",
      "movement": "Lift knee and make circles, opening hip through full range. Both directions, both legs.",
      "cues": "Full circles, feel hip opening, both directions, control the movement"
    }
  },
  "Upper Body Dynamic Warm-up": {
    "description": {
      "overview": "Dynamic movement preparation focusing on upper body. Prepares shoulders, arms, and torso for training.",
      "setup": "Clear space for arm and shoulder movements. Progress through range of motion.",
      "movement": "Perform dynamic upper body movements. Arm circles, swings, and activation exercises.",
      "cues": "Warm shoulders gradually, increase range, feel muscles activating, prepare for work"
    }
  },
  "Progressive Warm-up": {
    "description": {
      "overview": "Systematic warm-up building intensity progressively. Prepares entire body for training demands.",
      "setup": "Plan progression from gentle to training intensity. Include general and specific preparation.",
      "movement": "Start with gentle movement, progress to training-specific patterns. Build intensity gradually.",
      "cues": "Start gentle, build progressively, mimic training, ready to work"
    }
  },
  "Lower Body Warm-up": {
    "description": {
      "overview": "Dynamic preparation focusing on lower body muscles and joints. Essential before leg training.",
      "setup": "Space for leg swings, squats, and dynamic movements. Progress through ranges.",
      "movement": "Perform dynamic lower body movements. Leg swings, squats, lunges, activation.",
      "cues": "Warm legs gradually, feel muscles activating, prepare for training, full ranges"
    }
  },
  "Dynamic Lower Body Warm-up": {
    "description": {
      "overview": "Active lower body preparation using movement patterns. Prepares legs and hips for training.",
      "setup": "Clear space for leg movements. Include hip circles, leg swings, bodyweight squats.",
      "movement": "Move through dynamic lower body patterns. Build from gentle to training intensity.",
      "cues": "Activate glutes and legs, build intensity, prepare movement patterns, feel ready"
    }
  },
  "Dynamic Upper Body Warm-up": {
    "description": {
      "overview": "Active upper body preparation using movement patterns. Prepares arms, shoulders, and back.",
      "setup": "Space for arm movements and shoulder preparation. Include circles, swings, pulls.",
      "movement": "Progress through upper body movements. Prepare shoulders for pressing and pulling.",
      "cues": "Warm shoulders thoroughly, prepare for pressing and pulling, feel activation"
    }
  },
  "Power Prep Warm-up": {
    "description": {
      "overview": "Dynamic warm-up specifically preparing for power and explosive movements. Neural activation focus.",
      "setup": "Space for explosive movements. Progress from general to power-specific preparation.",
      "movement": "Include jumps, throws, and explosive patterns. Prepare nervous system for power.",
      "cues": "Explosive preparation, activate nervous system, prepare for power, feel explosive"
    }
  },
  "90/90 Hip Stretch": {
    "description": {
      "overview": "Seated hip stretch with both legs at 90-degree angles. Targets hip internal and external rotation.",
      "setup": "Seated with both legs bent at 90 degrees. One leg in front, one to side.",
      "movement": "Lean forward over front leg, then rotate to stretch both hips. Hold positions.",
      "cues": "Both legs at 90 degrees, lean forward, feel hip stretch, breathe deeply"
    }
  },
  "Figure-4 Hip Stretch": {
    "description": {
      "overview": "Hip stretch placing ankle on opposite knee in figure-4 position. Targets hip external rotators and glutes.",
      "setup": "Lying on back or seated. Place ankle of one leg on opposite knee.",
      "movement": "Pull legs toward chest feeling stretch in hip and glute. Hold position.",
      "cues": "Ankle on knee, pull toward chest, feel hip and glute stretch, breathe into stretch"
    }
  },
  "Child's Pose Stretch": {
    "description": {
      "overview": "Restorative yoga pose stretching back and hips. Promotes relaxation and spinal decompression.",
      "setup": "Kneeling position ready to sit back on heels. Arms can extend forward or rest at sides.",
      "movement": "Sit back on heels, extend arms forward or rest at sides. Feel back and hip stretch.",
      "cues": "Sit back on heels, relax into stretch, breathe deeply, let gravity help"
    }
  },
  "Yoga Warm-up Flow": {
    "description": {
      "overview": "Flowing yoga sequence for warm-up and preparation. Combines movement, breathing, and mindfulness.",
      "setup": "Yoga mat ready. Focus on breath and smooth movement transitions.",
      "movement": "Flow through yoga poses with breath awareness. Prepare body and mind for practice.",
      "cues": "Flow with breath, smooth transitions, prepare body and mind, focus inward"
    }
  },
  "Strength-Flexibility Flow": {
    "description": {
      "overview": "Movement sequence combining strength and flexibility elements. Builds strength through range of motion.",
      "setup": "Space for flowing movements. Combine strengthening positions with stretches.",
      "movement": "Flow between strength positions and stretches. Build strength while improving flexibility.",
      "cues": "Strength through range, flow smoothly, build and stretch, integrated approach"
    }
  },
  "Recovery/Restoration": {
    "description": {
      "overview": "General recovery and restoration activities. Focuses on promoting healing and reducing stress.",
      "setup": "Comfortable environment for relaxation. May include stretching, breathing, or gentle movement.",
      "movement": "Engage in activities that promote recovery. Listen to body's needs for restoration.",
      "cues": "Focus on recovery, listen to body, reduce stress, promote healing"
    }
  },
  "Push-Up EMOM": {
    "description": {
      "overview": "Push-ups performed every minute on the minute until failure. Builds upper body endurance and mental toughness.",
      "setup": "Clear space for push-ups. Timer ready for EMOM protocol. Track reps each minute.",
      "movement": "Perform push-ups at start of each minute until unable to complete target reps.",
      "cues": "Quality push-ups, every minute counts, track your reps, push through fatigue"
    }
  },
  "EMOM 10 minutes": {
    "description": {
      "overview": "Every Minute on the Minute protocol for 10 minutes. Builds work capacity and mental toughness.",
      "setup": "Timer set for 10 minutes. Exercise stations ready. Know target reps per minute.",
      "movement": "Perform prescribed reps at start of each minute. Rest remaining time.",
      "cues": "Work at minute start, use rest wisely, maintain quality, 10 minutes of focus"
    }
  },
  "EMOM 15 minutes": {
    "description": {
      "overview": "Every Minute on the Minute protocol for 15 minutes. Extended work capacity challenge.",
      "setup": "Timer set for 15 minutes. Exercise stations ready. Pace yourself appropriately.",
      "movement": "Perform prescribed work each minute. Manage effort for 15-minute duration.",
      "cues": "Pace for 15 minutes, consistent effort, manage fatigue, steady rhythm"
    }
  },
  "EMOM 10 minutes: Pull-ups / Push-ups": {
    "description": {
      "overview": "Alternating pull-ups and push-ups every minute for 10 minutes. Upper body strength endurance challenge.",
      "setup": "Pull-up bar and push-up space ready. Alternate exercises each minute for 10 minutes.",
      "movement": "Minute 1: Pull-ups, Minute 2: Push-ups, repeat. Maintain quality throughout.",
      "cues": "Alternate exercises, maintain form, push through upper body fatigue, 10 minutes total"
    }
  },
  "EMOM 20 minutes: 4 exercises": {
    "description": {
      "overview": "Four different exercises rotating every minute for 20 minutes. Ultimate work capacity test.",
      "setup": "Four exercise stations ready. Rotate through exercises every minute for 20 minutes.",
      "movement": "Exercise 1-4 rotating every minute. Complete 5 rounds of each exercise.",
      "cues": "Rotate exercises, manage effort, 20 minutes total, pace yourself"
    }
  },
  "AMRAP 8 minutes": {
    "description": {
      "overview": "As Many Reps/Rounds As Possible in 8 minutes. Builds work capacity and mental toughness.",
      "setup": "Exercise circuit ready. Timer set for 8 minutes. Track total rounds or reps.",
      "movement": "Maximum effort for 8 minutes. Maintain form while pushing pace.",
      "cues": "Maximum effort, track your score, maintain form, 8 minutes of work"
    }
  },
  "AMRAP Round 1 (5 min)": {
    "description": {
      "overview": "First round of AMRAP workout lasting 5 minutes. Sets intensity for subsequent rounds.",
      "setup": "Exercise circuit ready. Timer set for 5 minutes. This is round 1 of multiple.",
      "movement": "Maximum rounds/reps in 5 minutes. Pace for multiple rounds if applicable.",
      "cues": "Round 1 intensity, pace if more rounds coming, track score, quality reps"
    }
  },
  "Tricep AMRAP 1": {
    "description": {
      "overview": "First tricep-focused AMRAP workout. Maximum tricep exercises in time limit.",
      "setup": "Tricep exercise stations ready. Timer set for AMRAP duration.",
      "movement": "Maximum tricep exercise reps in time limit. Feel triceps burning.",
      "cues": "Focus on triceps, maximum reps, feel the burn, push through fatigue"
    }
  },
  "Tricep AMRAP 2": {
    "description": {
      "overview": "Second tricep-focused AMRAP workout. Continued tricep endurance challenge.",
      "setup": "Tricep exercise stations ready. This is the second tricep AMRAP session.",
      "movement": "Maximum tricep work despite fatigue from previous session. Push limits.",
      "cues": "Push through fatigue, triceps on fire, maximum effort, second round intensity"
    }
  },
  "Pull AMRAP 1": {
    "description": {
      "overview": "First pulling-focused AMRAP workout. Maximum pulling exercises in time limit.",
      "setup": "Pulling exercise stations ready (rows, pull-ups, etc). Timer set for duration.",
      "movement": "Maximum pulling exercise reps. Feel back muscles working hard.",
      "cues": "Pull focus, squeeze back muscles, maximum reps, feel lats working"
    }
  },
  "Pull AMRAP 2": {
    "description": {
      "overview": "Second pulling-focused AMRAP workout. Continued back and pulling endurance.",
      "setup": "Pulling exercise stations ready. Second round of pulling focus.",
      "movement": "Maximum pulling work despite back fatigue. Push through muscle burn.",
      "cues": "Back on fire, pull through fatigue, squeeze shoulder blades, second round"
    }
  },
  "Leg AMRAP 1": {
    "description": {
      "overview": "First leg-focused AMRAP workout. Maximum lower body exercises in time limit.",
      "setup": "Leg exercise stations ready (squats, lunges, etc). Timer set for duration.",
      "movement": "Maximum leg exercise reps. Feel quads, glutes, and hamstrings working.",
      "cues": "Leg focus, feel legs burning, maximum reps, push through leg fatigue"
    }
  },
  "Leg AMRAP 2": {
    "description": {
      "overview": "Second leg-focused AMRAP workout. Continued lower body endurance challenge.",
      "setup": "Leg exercise stations ready. Second round of leg-focused work.",
      "movement": "Maximum leg work despite lower body fatigue. Push limits.",
      "cues": "Legs on fire, push through fatigue, feel the burn, second round intensity"
    }
  },
  "AMRAP 4 minutes": {
    "description": {
      "overview": "As Many Reps/Rounds As Possible in 4 minutes. Short, intense work capacity test.",
      "setup": "Exercise circuit ready. Timer set for 4 minutes. High intensity expected.",
      "movement": "Maximum effort for 4 minutes. High pace due to short duration.",
      "cues": "High intensity, 4 minutes only, push the pace, maximum effort"
    }
  },
  "AMRAP 5 minutes": {
    "description": {
      "overview": "As Many Reps/Rounds As Possible in 5 minutes. Moderate duration intensity challenge.",
      "setup": "Exercise circuit ready. Timer set for 5 minutes. Balance pace and intensity.",
      "movement": "Maximum sustainable effort for 5 minutes. Track total work completed.",
      "cues": "Sustainable pace, 5 minutes total, track your work, maintain quality"
    }
  },
  "AMRAP 6 minutes": {
    "description": {
      "overview": "As Many Reps/Rounds As Possible in 6 minutes. Work capacity and endurance test.",
      "setup": "Exercise circuit ready. Timer set for 6 minutes. Pace appropriately.",
      "movement": "Maximum work for 6 minutes. Balance intensity with duration.",
      "cues": "6 minute pace, balance intensity, track progress, push through fatigue"
    }
  },
  "AMRAP Round 1 (4 min)": {
    "description": {
      "overview": "First 4-minute AMRAP round. Sets pace for subsequent rounds if applicable.",
      "setup": "Exercise circuit ready. Timer set for 4 minutes. First of multiple rounds.",
      "movement": "Maximum effort for 4 minutes. Pace if more rounds to follow.",
      "cues": "Round 1 pace, 4 minutes, pace for more rounds, track score"
    }
  },
  "AMRAP Round 2 (4 min)": {
    "description": {
      "overview": "Second 4-minute AMRAP round. Maintain intensity despite fatigue from round 1.",
      "setup": "Exercise circuit ready. This is round 2 after previous AMRAP work.",
      "movement": "Maximum effort despite accumulated fatigue. Push through burn.",
      "cues": "Round 2 intensity, push through fatigue, maintain pace, dig deep"
    }
  },
  "AMRAP Round 3 (4 min)": {
    "description": {
      "overview": "Third 4-minute AMRAP round. Final push through maximum accumulated fatigue.",
      "setup": "Exercise circuit ready. Final round after significant accumulated fatigue.",
      "movement": "Maximum effort for final round. Mental toughness required.",
      "cues": "Final round, maximum effort, mental toughness, finish strong"
    }
  },
  "Dumbbell Squat to Press": {
    "description": {
      "overview": "Combination movement flowing from squat to overhead press. Full-body exercise building strength and coordination.",
      "setup": "Dumbbells at shoulders, feet shoulder-width. Ready for fluid squat-to-press movement.",
      "movement": "Squat down with control, drive up explosively pressing dumbbells overhead. Smooth transition.",
      "cues": "Smooth transition, use leg drive for press, control down and explode up"
    }
  },
  "Plank with Dumbbell Pull-throughs": {
    "description": {
      "overview": "Plank position while pulling dumbbell side to side underneath body. Challenges core stability and anti-rotation.",
      "setup": "High plank position with dumbbell to one side. Maintain rigid plank throughout.",
      "movement": "Pull dumbbell under body from side to side while maintaining perfect plank position.",
      "cues": "Perfect plank position, resist rotation, pull weight under body, core stays tight"
    }
  },
  "Farmer's Walk": {
    "description": {
      "overview": "Loaded carry exercise holding weights at sides while walking. Builds grip strength, core stability, and total-body strength.",
      "setup": "Heavy weights at sides (dumbbells, kettlebells, or farmer's handles). Clear walking path.",
      "movement": "Walk with weights maintaining upright posture. Fight to stay tall against load.",
      "cues": "Stay tall, tight core, don't let weights pull you down, strong grip"
    }
  },
  "CrossFit-style METCON": {
    "description": {
      "overview": "Metabolic conditioning workout in CrossFit style. High-intensity multi-modal exercise combining strength and cardio.",
      "setup": "Multiple exercise stations ready. Timer set for workout protocol (AMRAP, For Time, etc).",
      "movement": "High-intensity effort combining different movement patterns. Push through fatigue.",
      "cues": "High intensity, multi-modal, push through fatigue, embrace the challenge"
    }
  },
  "Full Body Circuit 1": {
    "description": {
      "overview": "First full-body circuit targeting all major muscle groups. Builds total-body strength and endurance.",
      "setup": "Full-body exercise stations ready. Include upper, lower, and core exercises.",
      "movement": "Rotate through exercises targeting all major muscle groups. Feel total-body challenge.",
      "cues": "Total-body work, feel everything working, maintain form, circuit 1 intensity"
    }
  },
  "HIIT Circuit 2": {
    "description": {
      "overview": "Second high-intensity interval circuit. Continuation of HIIT training with varied exercises.",
      "setup": "HIIT exercise stations ready. This is the second circuit in sequence.",
      "movement": "High-intensity intervals with varied exercises. Maintain intensity despite fatigue.",
      "cues": "Circuit 2 intensity, push through fatigue, high intensity intervals, varied exercises"
    }
  },
  "Light Mobility (Optional)": {
    "description": {
      "overview": "Optional gentle mobility work for recovery and maintenance. Light movement to promote flexibility.",
      "setup": "Comfortable space for gentle stretching and mobility. Optional based on needs.",
      "movement": "Gentle stretching and mobility exercises. Listen to body's needs for movement.",
      "cues": "Optional gentle work, listen to body, promote flexibility, light and easy"
    }
  },
  "Hammer Curls": {
    "description": {
      "overview": "A dumbbell curl variation with neutral grip targeting biceps and brachialis. Builds arm thickness and forearm strength while reducing wrist strain compared to supinated curls.",
      "setup": "Stand with feet hip-width apart, dumbbell in each hand at sides. Palms face inward (neutral grip). Elbows close to torso.",
      "movement": "Curl weights toward shoulders keeping palms facing each other throughout. Squeeze at top, lower with control. Alternate arms or curl simultaneously.",
      "cues": "Palms face each other, elbows pinned, squeeze at top, control the negative"
    }
  },
  "Zottman Curls": {
    "description": {
      "overview": "A hybrid curl combining supinated curl up and pronated curl down. Targets biceps, brachialis, and forearm extensors in one movement for complete arm development.",
      "setup": "Stand with feet hip-width apart, dumbbell in each hand. Start with palms facing forward (supinated). Elbows at sides.",
      "movement": "Curl weights up with palms facing up. At top, rotate wrists so palms face down. Lower slowly with overhand grip. Rotate back to start at bottom.",
      "cues": "Supinate up, rotate at top, pronate down, slow eccentric"
    }
  },
  "Concentration Curls": {
    "description": {
      "overview": "An isolated single-arm curl performed seated with elbow braced against inner thigh. Eliminates momentum for strict bicep isolation and peak contraction.",
      "setup": "Sit on bench, feet wide. Hold dumbbell in one hand, brace elbow against inner thigh. Other hand on opposite knee for support.",
      "movement": "Curl weight toward shoulder, keeping upper arm stationary against thigh. Squeeze at top, lower with full control. Complete all reps then switch arms.",
      "cues": "Elbow locked against thigh, no swinging, squeeze peak contraction, slow negative"
    }
  },
  "Dumbbell Shrugs": {
    "description": {
      "overview": "A trapezius isolation exercise elevating shoulders against dumbbell resistance. Builds upper trap mass and strength essential for shoulder stability and posture.",
      "setup": "Stand with feet hip-width apart, dumbbell in each hand at sides. Arms straight, shoulders down. Chest up, core engaged.",
      "movement": "Elevate shoulders straight up toward ears as high as possible. Squeeze traps at top for one second. Lower shoulders with control.",
      "cues": "Straight up not rolling, squeeze at top, ears to ceiling, control descent"
    }
  },
  "Standing Reverse Fly": {
    "description": {
      "overview": "A bent-over rear delt isolation exercise using dumbbells. Targets rear deltoids and rhomboids for shoulder health and upper back development.",
      "setup": "Stand with feet hip-width, hinge at hips to 45-degree angle. Dumbbells hanging below chest, slight elbow bend. Back flat, core braced.",
      "movement": "Raise dumbbells out to sides in arc motion until arms parallel to floor. Squeeze shoulder blades at top. Lower with control.",
      "cues": "Lead with elbows, squeeze shoulder blades, slight elbow bend, control both directions"
    }
  },
  "Prone Dumbbell Y-Raise": {
    "description": {
      "overview": "A prone shoulder exercise raising dumbbells in Y-pattern. Targets lower traps and rear delts for shoulder stability and improved posture.",
      "setup": "Lie face down on incline bench or floor. Arms hanging down with light dumbbells, thumbs up. Forehead resting on bench or floor.",
      "movement": "Raise arms at 45-degree angle to form Y-shape, thumbs leading. Squeeze lower traps at top. Lower with control.",
      "cues": "Thumbs up, form Y-shape, squeeze lower traps, light weight high reps"
    }
  },
  "Prone Dumbbell T-Raise": {
    "description": {
      "overview": "A prone shoulder exercise raising dumbbells straight out to sides. Targets middle traps and rhomboids for upper back strength and scapular control.",
      "setup": "Lie face down on incline bench or floor. Arms hanging down with light dumbbells, thumbs up. Forehead resting on bench or floor.",
      "movement": "Raise arms straight out to sides to form T-shape, thumbs leading. Squeeze middle traps and rhomboids at top. Lower with control.",
      "cues": "Thumbs up, form T-shape, squeeze between shoulder blades, light weight"
    }
  },
  "Prone Superman": {
    "description": {
      "overview": "A bodyweight back extension lifting arms and legs simultaneously while prone. Strengthens entire posterior chain including erectors, glutes, and rear delts.",
      "setup": "Lie face down on floor, arms extended overhead, legs straight. Forehead near floor, neck neutral.",
      "movement": "Simultaneously lift arms, chest, and legs off floor. Hold briefly at top squeezing glutes and back. Lower with control.",
      "cues": "Lift everything together, squeeze glutes, reach long, control the descent"
    }
  },
  "Reverse Snow Angels": {
    "description": {
      "overview": "A prone upper back exercise moving arms in snow angel pattern. Targets rear delts, rhomboids, and lower traps for postural strength and shoulder health.",
      "setup": "Lie face down on floor, arms at sides with palms down. Lift chest slightly off floor, neck neutral. Core engaged.",
      "movement": "Sweep arms along floor from sides to overhead in arc motion, keeping arms off floor throughout. Reverse motion back to sides.",
      "cues": "Arms hover off floor, squeeze shoulder blades, slow controlled arc, breathe steadily"
    }
  },
  "Prone Y-Raise": {
    "description": {
      "overview": "A bodyweight prone shoulder exercise raising arms in Y-pattern without weights. Targets lower traps for shoulder stability and posture improvement.",
      "setup": "Lie face down on floor, arms extended overhead at 45-degree angle forming Y. Thumbs up, forehead near floor.",
      "movement": "Lift arms off floor while maintaining Y-position. Squeeze lower traps at top. Lower with control. Can also lift chest slightly.",
      "cues": "Thumbs to ceiling, squeeze lower traps, hold at top, light and controlled"
    }
  },
  "Prone T-Raise": {
    "description": {
      "overview": "A bodyweight prone shoulder exercise raising arms straight out to form T-shape. Targets middle traps and rhomboids for scapular strength.",
      "setup": "Lie face down on floor, arms extended straight out to sides forming T. Thumbs up, forehead near floor.",
      "movement": "Lift arms off floor while maintaining T-position. Squeeze between shoulder blades at top. Lower with control.",
      "cues": "Thumbs to ceiling, squeeze rhomboids, hold briefly, maintain T-shape"
    }
  },
  "Scapular Retractions": {
    "description": {
      "overview": "An isolation exercise squeezing shoulder blades together without arm movement. Activates rhomboids and middle traps for improved posture and scapular control.",
      "setup": "Stand or sit tall with arms at sides or hands on hips. Shoulders relaxed, chest up. Core engaged.",
      "movement": "Pull shoulder blades together toward spine without moving arms. Hold squeeze for 2-3 seconds. Release with control and repeat.",
      "cues": "Squeeze shoulder blades together, no arm movement, hold the squeeze, chest stays up"
    }
  },
  "Band Bicep Curl": {
    "description": {
      "overview": "A resistance band curl targeting biceps with constant tension throughout range of motion. Provides accommodating resistance that increases as the band stretches.",
      "setup": "Stand on center of band, feet shoulder-width apart. Hold handles with palms facing up. Arms at sides, elbows tucked.",
      "movement": "Curl handles toward shoulders while keeping elbows stationary at sides. Squeeze biceps at top. Lower with control against band tension.",
      "cues": "Elbows pinned, full range, squeeze at top, control the negative"
    }
  },
  "Band Chest Press": {
    "description": {
      "overview": "A horizontal pressing exercise using resistance bands anchored behind body. Targets chest, shoulders, and triceps with accommodating resistance.",
      "setup": "Anchor band at chest height behind you or loop around back. Hold handles at chest level, elbows out. Stagger stance for stability.",
      "movement": "Press handles forward until arms fully extended. Squeeze chest at end position. Return with control against band resistance.",
      "cues": "Press straight ahead, squeeze chest, control return, keep core tight"
    }
  },
  "Band Deadlift": {
    "description": {
      "overview": "A hip hinge movement using resistance bands for posterior chain development. Teaches proper deadlift mechanics with accommodating resistance.",
      "setup": "Stand on center of band, feet hip-width. Hold handles or loop band around hands. Hinge at hips, flat back, slight knee bend.",
      "movement": "Drive hips forward to stand tall while pulling band up. Squeeze glutes at top. Hinge back down with control, pushing hips back.",
      "cues": "Hinge not squat, flat back, squeeze glutes at top, control the descent"
    }
  },
  "Band Face Pull": {
    "description": {
      "overview": "A pulling exercise targeting rear delts, rhomboids, and external rotators. Essential for shoulder health and counteracting forward posture.",
      "setup": "Anchor band at face height or higher. Hold handles with palms down, arms extended. Step back to create tension.",
      "movement": "Pull handles toward face, separating hands and driving elbows high and wide. Squeeze rear delts and rotate hands externally at end. Return with control.",
      "cues": "Elbows high and wide, pull to ears, external rotation at end, squeeze shoulder blades"
    }
  },
  "Band Front Raise": {
    "description": {
      "overview": "An isolation exercise targeting front deltoids using band resistance. Builds anterior shoulder strength with constant tension throughout movement.",
      "setup": "Stand on band with feet shoulder-width. Hold handles with palms facing thighs. Arms at sides, slight elbow bend.",
      "movement": "Raise arms forward to shoulder height, maintaining slight elbow bend. Pause at top. Lower with control against band resistance.",
      "cues": "Lead with knuckles, stop at shoulder height, control descent, no momentum"
    }
  },
  "Band Glute Bridge": {
    "description": {
      "overview": "A glute bridge with band resistance above knees for added hip abduction challenge. Targets glutes and teaches proper hip extension with external rotation.",
      "setup": "Lie on back, loop band above knees. Feet flat, hip-width apart. Arms at sides, palms down.",
      "movement": "Press knees out against band while driving hips to ceiling. Squeeze glutes at top, maintaining outward knee pressure. Lower with control.",
      "cues": "Press knees out, squeeze glutes hard, don't hyperextend back, control descent"
    }
  },
  "Band Hammer Curl": {
    "description": {
      "overview": "A neutral-grip curl using bands targeting biceps and brachialis. Provides constant tension throughout range of motion for forearm and arm development.",
      "setup": "Stand on center of band, feet shoulder-width. Hold handles with palms facing each other (neutral grip). Arms at sides.",
      "movement": "Curl handles toward shoulders keeping palms facing each other throughout. Squeeze at top. Lower with control.",
      "cues": "Palms stay neutral, elbows pinned, squeeze at top, slow negative"
    }
  },
  "Band High Pull": {
    "description": {
      "overview": "An explosive pulling movement targeting upper back, traps, and rear delts. Builds power and upper back thickness with band resistance.",
      "setup": "Stand on center of band, feet shoulder-width. Hold handles in front of thighs, palms facing body. Slight knee bend.",
      "movement": "Explosively pull handles to chin height, driving elbows high and wide. Lead with elbows, not hands. Lower with control.",
      "cues": "Elbows lead, chin height, explosive pull, control descent"
    }
  },
  "Band Lat Pulldown": {
    "description": {
      "overview": "A vertical pulling exercise using anchored band to target lats and biceps. Mimics cable lat pulldown for back width development.",
      "setup": "Anchor band overhead. Kneel or stand facing anchor. Grasp band with overhand grip wider than shoulders. Arms extended overhead.",
      "movement": "Pull band down to upper chest, driving elbows to ribs. Squeeze lats at bottom. Return arms overhead with control.",
      "cues": "Pull elbows to ribs, chest up, squeeze lats, control return"
    }
  },
  "Band Lateral Raise": {
    "description": {
      "overview": "A lateral shoulder raise using band resistance for constant tension. Targets middle deltoids for shoulder width and definition.",
      "setup": "Stand on center of band, feet together. Hold handles at sides, palms facing in. Slight elbow bend.",
      "movement": "Raise arms out to sides until parallel with floor. Lead with elbows slightly. Lower with control against band tension.",
      "cues": "Lead with elbows, stop at shoulder height, control descent, no momentum"
    }
  },
  "Band Lateral Walk": {
    "description": {
      "overview": "A lateral movement exercise with band around legs targeting hip abductors and glutes. Builds hip stability and strengthens gluteus medius.",
      "setup": "Place band around ankles or above knees. Feet shoulder-width apart, slight squat position. Hands on hips or in front.",
      "movement": "Step laterally with one foot, then follow with other foot maintaining band tension. Continue in one direction, then reverse.",
      "cues": "Stay in squat, tension constant, controlled steps, don't let knees cave"
    }
  },
  "Band Leg Curl": {
    "description": {
      "overview": "A prone hamstring curl using band anchored at ankle. Isolates hamstrings with constant tension for posterior thigh development.",
      "setup": "Anchor band low, loop around ankle. Lie prone on floor or bench. Starting leg extended toward anchor.",
      "movement": "Curl heel toward glute by flexing knee. Squeeze hamstring at top. Extend leg with control against band resistance.",
      "cues": "Squeeze hamstring, full range, control extension, hips stay down"
    }
  },
  "Band Leg Extension": {
    "description": {
      "overview": "A seated quadricep extension using band resistance. Isolates quads with accommodating resistance for knee extension strength.",
      "setup": "Sit on chair or bench, anchor band behind you at low point. Loop band around ankle. Start with knee bent.",
      "movement": "Extend knee to straighten leg against band resistance. Squeeze quad at top. Return to start with control.",
      "cues": "Squeeze quad at top, full extension, control descent, stable upper body"
    }
  },
  "Band Monster Walk": {
    "description": {
      "overview": "A forward diagonal walking pattern with band around legs. Targets hip abductors and glutes with multi-directional challenge.",
      "setup": "Place band around ankles or above knees. Athletic stance, slight squat. Feet shoulder-width, maintaining band tension.",
      "movement": "Step forward and outward diagonally with one foot. Follow with other foot maintaining stance width. Continue forward in alternating monster walk pattern.",
      "cues": "Diagonal steps, stay low, maintain tension, knees track over toes"
    }
  },
  "Band Pallof Press": {
    "description": {
      "overview": "An anti-rotation core exercise pressing band away from chest while resisting rotational pull. Builds core stability and rotational strength.",
      "setup": "Anchor band at chest height to side. Stand perpendicular to anchor. Hold band handle at chest with both hands. Feet shoulder-width.",
      "movement": "Press hands straight out from chest, resisting band's pull to rotate torso. Hold briefly at full extension. Return to chest with control.",
      "cues": "Resist rotation, brace core, press straight, don't let band pull you"
    }
  },
  "Band Pull-Apart": {
    "description": {
      "overview": "A horizontal pulling exercise targeting rear delts and upper back. Essential for shoulder health, posture, and counteracting forward shoulder position.",
      "setup": "Hold band in front with arms extended, shoulder-width or narrower grip. Palms down or neutral. Shoulders back and down.",
      "movement": "Pull band apart by squeezing shoulder blades together, arms moving out to sides. Pause at full stretch. Return with control.",
      "cues": "Squeeze shoulder blades, arms stay straight, chest up, control return"
    }
  },
  "Band Rear Delt Fly": {
    "description": {
      "overview": "A bent-over reverse fly using band resistance for rear deltoid isolation. Targets posterior shoulders and upper back for balanced shoulder development.",
      "setup": "Stand on center of band or anchor at low point. Hinge at hips to near-parallel. Cross band handles, arms hanging down.",
      "movement": "Raise arms out to sides in arc motion until parallel with floor. Squeeze rear delts at top. Lower with control.",
      "cues": "Lead with elbows, squeeze rear delts, maintain hip hinge, control descent"
    }
  },
  "Band Reverse Curl": {
    "description": {
      "overview": "An overhand grip curl using band resistance targeting brachioradialis and forearm extensors. Builds forearm strength and grip.",
      "setup": "Stand on center of band, feet shoulder-width. Hold handles with palms facing down (pronated). Arms at sides.",
      "movement": "Curl handles toward shoulders while maintaining overhand grip. Squeeze forearms and biceps at top. Lower with control.",
      "cues": "Palms stay down, elbows pinned, squeeze at top, control negative"
    }
  },
  "Band Seated Row": {
    "description": {
      "overview": "A seated horizontal row using band anchored at foot level. Targets lats, rhomboids, and biceps for back thickness.",
      "setup": "Sit on floor, legs extended. Loop band around feet or anchor low. Hold handles with arms extended. Sit tall, chest up.",
      "movement": "Pull handles to lower ribs, driving elbows back. Squeeze shoulder blades together at end. Extend arms with control.",
      "cues": "Elbows to ribs, squeeze shoulder blades, chest stays up, control extension"
    }
  },
  "Band Shoulder Press": {
    "description": {
      "overview": "A vertical pressing exercise using band resistance for shoulder development. Targets all three deltoid heads with accommodating resistance.",
      "setup": "Stand on center of band, feet shoulder-width. Hold handles at shoulder height, palms forward. Core braced.",
      "movement": "Press handles overhead until arms fully extended. Keep core tight to prevent arching. Lower to shoulders with control.",
      "cues": "Press straight up, full lockout, core tight, control descent"
    }
  },
  "Band Squat": {
    "description": {
      "overview": "A bodyweight squat with band resistance for added lower body challenge. Provides accommodating resistance that increases at top of movement.",
      "setup": "Stand on center of band, feet shoulder-width. Hold handles at shoulders or loop band behind neck. Core braced.",
      "movement": "Push hips back and squat down, keeping chest up. Descend until thighs parallel. Drive through heels to stand against band resistance.",
      "cues": "Knees track toes, chest up, drive through heels, squeeze glutes at top"
    }
  },
  "Band Standing Row": {
    "description": {
      "overview": "A standing horizontal row using anchored band for back development. Targets lats, rhomboids, and biceps with constant tension.",
      "setup": "Anchor band at chest height in front of you. Hold handles with arms extended. Step back to create tension. Athletic stance.",
      "movement": "Pull handles to lower ribs, driving elbows back. Squeeze shoulder blades at end position. Extend arms with control.",
      "cues": "Pull to ribs, squeeze back, stay stable, control return"
    }
  },
  "Band Tricep Pushdown": {
    "description": {
      "overview": "A tricep isolation exercise using band anchored overhead. Targets all three tricep heads with constant band tension.",
      "setup": "Anchor band overhead. Face anchor, grasp band with both hands at chest height. Elbows at sides, upper arms stationary.",
      "movement": "Extend elbows to push band down until arms straight. Squeeze triceps at bottom. Return to start with control, elbows stationary.",
      "cues": "Elbows pinned, full extension, squeeze triceps, control return"
    }
  },
  "Band Woodchop": {
    "description": {
      "overview": "A rotational core exercise using anchored band in diagonal chopping pattern. Builds rotational power and core strength.",
      "setup": "Anchor band at high point to side. Stand perpendicular, feet wider than shoulders. Hold handle with both hands near anchor side shoulder.",
      "movement": "Rotate torso and pull band diagonally down and across body to opposite hip. Control return to start. Complete reps then switch sides.",
      "cues": "Rotate from core, arms follow torso, controlled chop, pivot back foot"
    }
  },
  "Archer Push-ups": {
    "description": {
      "overview": "An advanced unilateral push-up variation with one arm extended to side. Increases load on working arm while developing strength asymmetry for one-arm push-up progression.",
      "setup": "Wide push-up position, hands much wider than shoulders. One hand points forward, other points to side. Body straight, core tight.",
      "movement": "Lower toward forward hand, extending other arm out straight. Push back up through forward hand. Alternate sides or complete set on one side.",
      "cues": "Lower to working hand, extend support arm, push through palm, stay rigid"
    }
  },
  "Bear Crawl": {
    "description": {
      "overview": "A quadruped locomotion pattern crawling forward on hands and feet. Builds total body coordination, core stability, and shoulder endurance.",
      "setup": "Hands under shoulders, knees under hips lifted 2 inches off ground. Back flat, core braced. Looking slightly ahead.",
      "movement": "Move opposite hand and foot forward simultaneously. Alternate sides, keeping knees low and back flat. Crawl forward for distance or time.",
      "cues": "Knees hover low, opposite hand and foot, flat back, controlled crawl"
    }
  },
  "Broad Jump": {
    "description": {
      "overview": "An explosive horizontal jump for maximum distance. Develops lower body power, hip extension strength, and athletic jumping ability.",
      "setup": "Stand with feet hip-width apart, toes near starting line. Arms back in athletic ready position. Slight knee bend.",
      "movement": "Swing arms forward while explosively jumping forward. Extend hips fully mid-air. Land softly with bent knees, absorbing impact.",
      "cues": "Arm swing drives jump, full extension, stick the landing, reset each rep"
    }
  },
  "Butterfly Sit-ups": {
    "description": {
      "overview": "A sit-up variation with soles of feet together in butterfly position. Reduces hip flexor involvement to better isolate abdominals.",
      "setup": "Lie on back, soles of feet together, knees out to sides in butterfly. Arms overhead touching floor or across chest.",
      "movement": "Contract abs to curl torso up, reaching past feet or touching toes. Lower back down with control, arms returning overhead.",
      "cues": "Curl up with abs, reach past feet, control descent, knees stay open"
    }
  },
  "Crab Walk": {
    "description": {
      "overview": "A reverse quadruped locomotion moving face-up on hands and feet. Builds shoulder stability, tricep endurance, and hip flexibility.",
      "setup": "Sit on floor, hands behind hips, fingers forward. Feet flat, knees bent. Lift hips off ground to table-top position.",
      "movement": "Walk backward or forward by moving opposite hand and foot. Maintain elevated hip position throughout. Move for distance or time.",
      "cues": "Hips stay up, opposite hand and foot, fingers forward, steady pace"
    }
  },
  "Donkey Kicks": {
    "description": {
      "overview": "A quadruped glute isolation exercise kicking leg back and up. Targets gluteus maximus with focused hip extension movement.",
      "setup": "Hands under shoulders, knees under hips on all fours. Core braced, back flat. Neck neutral.",
      "movement": "Drive one heel toward ceiling, keeping knee bent at 90 degrees. Squeeze glute at top. Lower with control without touching floor. Complete reps then switch.",
      "cues": "Drive heel to ceiling, squeeze glute, don't arch back, control descent"
    }
  },
  "Floor Back Extension": {
    "description": {
      "overview": "A prone back extension performed on floor targeting erector spinae. Builds lower back strength and endurance for spine stability.",
      "setup": "Lie face down, hands beside shoulders or at temples. Legs extended, tops of feet on floor. Core engaged.",
      "movement": "Lift chest off floor by contracting lower back muscles. Keep neck neutral, looking at floor ahead. Lower with control.",
      "cues": "Lift with back muscles, neutral neck, don't hyperextend, control descent"
    }
  },
  "Flutter Kicks": {
    "description": {
      "overview": "A supine core exercise alternating small leg kicks. Targets lower abs and hip flexors while building muscular endurance.",
      "setup": "Lie on back, hands under hips or at sides. Lift legs few inches off floor, legs straight. Lower back pressed into floor.",
      "movement": "Alternate small up and down kicks with each leg in flutter pattern. Maintain constant leg elevation and core engagement throughout.",
      "cues": "Low back down, small kicks, legs straight, constant motion"
    }
  },
  "Frog Pumps": {
    "description": {
      "overview": "A glute bridge variation with soles of feet together in frog position. Maximizes glute activation by externally rotating hips.",
      "setup": "Lie on back, soles of feet together, knees fallen out to sides. Arms at sides, palms down. Heels close to glutes.",
      "movement": "Drive through heels to lift hips, squeezing glutes hard at top. Maintain external hip rotation throughout. Lower with control.",
      "cues": "Drive through heels, squeeze glutes hard, keep knees out, short range"
    }
  },
  "Heel Taps": {
    "description": {
      "overview": "A supine oblique exercise reaching alternately toward each heel. Targets obliques through lateral flexion with constant ab engagement.",
      "setup": "Lie on back, knees bent, feet flat on floor hip-width apart. Arms at sides, palms down. Lift shoulders slightly off floor, engaging abs.",
      "movement": "Laterally flex spine to reach one hand toward same-side heel. Return to center and reach to other side. Alternate continuously.",
      "cues": "Shoulders stay up, side bend to reach, maintain ab tension, smooth alternation"
    }
  },
  "Hollow Body Hold": {
    "description": {
      "overview": "An isometric core exercise holding curved hollow position. Fundamental gymnastics hold developing anterior core strength and total body tension.",
      "setup": "Lie on back, arms overhead, legs extended. Press lower back firmly into floor. Lift shoulders and legs off ground.",
      "movement": "Hold curved hollow position with only lower back touching floor. Arms and legs extended, creating banana shape. Breathe while maintaining position.",
      "cues": "Low back glued down, curve like a banana, squeeze everything, breathe steady"
    }
  },
  "Inchworm": {
    "description": {
      "overview": "A dynamic warm-up exercise walking hands out to plank and walking feet back. Builds hamstring flexibility, core stability, and shoulder endurance.",
      "setup": "Stand with feet hip-width apart, arms at sides. Hinge forward to place hands on floor in front of feet.",
      "movement": "Walk hands forward to plank position. Hold briefly, then walk feet toward hands keeping legs straight. Stand and repeat.",
      "cues": "Straight legs on walk-in, maintain plank in middle, controlled pace, reach forward"
    }
  },
  "Inverted Row": {
    "description": {
      "overview": "A horizontal pull performed hanging beneath a bar or rings. Develops back strength and teaches scapular control for pull-up progression.",
      "setup": "Hang beneath bar with overhand grip, arms extended. Body straight from head to heels at angle. Heels on ground.",
      "movement": "Pull chest to bar by driving elbows back and squeezing shoulder blades. Lower with control to full arm extension.",
      "cues": "Pull chest to bar, squeeze shoulder blades, stay rigid, control descent"
    }
  },
  "Jump Lunges": {
    "description": {
      "overview": "An explosive plyometric lunge switching legs mid-air. Builds lower body power, single-leg strength, and cardiovascular conditioning.",
      "setup": "Start in lunge position, one foot forward, back knee near floor. Arms in running position. Core braced.",
      "movement": "Explosively jump up, switching legs mid-air. Land softly in lunge with opposite leg forward. Immediately spring into next rep.",
      "cues": "Explode vertically, switch mid-air, land soft, stay upright"
    }
  },
  "Pistol Squat": {
    "description": {
      "overview": "An advanced single-leg squat to full depth. Requires exceptional strength, balance, and mobility. Ultimate bodyweight leg exercise.",
      "setup": "Stand on one leg, other leg extended forward. Arms out front for counterbalance. Core tight.",
      "movement": "Lower slowly on one leg, extending other leg forward. Descend to full depth, control at bottom. Drive up through heel to stand.",
      "cues": "Control descent, full depth, counterbalance with arms, drive through heel"
    }
  },
  "Prone I-Raise": {
    "description": {
      "overview": "A prone shoulder exercise lifting arms straight forward in I-position. Targets lower traps and improves overhead shoulder mobility.",
      "setup": "Lie face down on floor, arms extended straight overhead. Thumbs up, forehead resting on floor. Core engaged.",
      "movement": "Lift both arms off floor keeping them in line with ears. Squeeze lower traps at top. Lower with control.",
      "cues": "Arms by ears, thumbs up, squeeze lower traps, controlled movement"
    }
  },
  "Prone W-Raise": {
    "description": {
      "overview": "A prone shoulder exercise forming W-shape with arms. Targets external rotators, rhomboids, and lower traps for rotator cuff strength.",
      "setup": "Lie face down, elbows bent at 90 degrees, upper arms at shoulder level forming W. Forehead on floor.",
      "movement": "Lift elbows and hands off floor maintaining W-position. Squeeze between shoulder blades. Lower with control.",
      "cues": "Maintain W-shape, squeeze shoulder blades, elbows stay bent, controlled movement"
    }
  },
  "Skater Lunges": {
    "description": {
      "overview": "A lateral jumping exercise mimicking skating motion. Builds lateral power, single-leg stability, and hip strength.",
      "setup": "Stand on one leg, opposite leg behind and across. Slight forward lean, arms ready for counterbalance.",
      "movement": "Push off laterally, jumping to land on opposite leg. Sweep other leg behind. Absorb landing, then immediately push off to other side.",
      "cues": "Push laterally, land soft, absorb on one leg, continuous motion"
    }
  },
  "Squat Pulse": {
    "description": {
      "overview": "An isometric squat variation with small pulsing movements at bottom. Builds muscular endurance and time under tension in quads and glutes.",
      "setup": "Feet shoulder-width apart, toes slightly out. Lower to bottom of squat, thighs parallel or below. Arms forward for balance.",
      "movement": "Make small up and down pulses, staying in bottom portion of squat. Move only a few inches. Maintain position for time or reps.",
      "cues": "Stay low, small pulses, don't come up fully, burn the quads"
    }
  },
  "Squat Thrust": {
    "description": {
      "overview": "A burpee variation without the jump, moving between squat and plank. Builds conditioning and full-body coordination at lower intensity than burpees.",
      "setup": "Stand with feet shoulder-width apart, arms at sides. Ready to move through multiple positions.",
      "movement": "Squat down, place hands on floor. Jump feet back to plank position. Jump feet forward to hands. Stand up. Repeat continuously.",
      "cues": "Hands down, feet back, feet forward, stand up, stay rhythmic"
    }
  },
  "Star Jumps": {
    "description": {
      "overview": "An explosive full-body jump spreading arms and legs like a star. Builds explosive power and elevates heart rate for conditioning.",
      "setup": "Stand with feet together, arms at sides. Slight knee bend, ready to explode upward.",
      "movement": "Jump explosively, spreading arms and legs wide to form star shape mid-air. Land with feet together, absorbing impact softly.",
      "cues": "Explode up, spread wide, land soft, reset each rep"
    }
  },
  "Swimmers": {
    "description": {
      "overview": "A prone exercise alternating opposite arm and leg lifts mimicking swimming. Strengthens posterior chain and improves coordination.",
      "setup": "Lie face down, arms extended overhead, legs straight. Forehead near floor, neck neutral.",
      "movement": "Lift opposite arm and leg simultaneously while lowering the others. Alternate continuously in swimming pattern. Keep movements controlled.",
      "cues": "Opposite arm and leg, continuous motion, stay long, control pace"
    }
  },
  "V-Ups": {
    "description": {
      "overview": "An advanced ab exercise folding body into V-shape. Targets entire rectus abdominis with high-intensity simultaneous lift of torso and legs.",
      "setup": "Lie flat on back, arms extended overhead, legs straight. Lower back pressed into floor.",
      "movement": "Simultaneously lift legs and torso, reaching hands toward toes to form V-shape. Balance briefly on tailbone. Lower with control.",
      "cues": "Lift together, reach for toes, balance on tailbone, control descent"
    }
  },
  "Wide Push-ups": {
    "description": {
      "overview": "A push-up variation with wider hand placement emphasizing chest activation. Reduces tricep involvement while increasing pectoral stretch and engagement.",
      "setup": "High plank position, hands significantly wider than shoulder width. Fingers pointed forward or slightly out. Body straight.",
      "movement": "Lower body toward floor, keeping elbows tracking toward hands. Chest leads the descent. Push back to start, squeezing chest.",
      "cues": "Wide hands, elbows toward hands, chest leads, squeeze on push"
    }
  },
  "Arnold Press": {
    "description": {
      "overview": "A shoulder press variation rotating from palms-in to palms-out. Hits all three deltoid heads through rotation while pressing for complete shoulder development.",
      "setup": "Sit or stand with dumbbells at shoulder height, palms facing you. Elbows in front of body. Core braced.",
      "movement": "Press dumbbells up while rotating palms to face forward at top. Reverse motion on descent, rotating palms back to face you at bottom.",
      "cues": "Rotate as you press, full lockout, reverse the rotation, controlled tempo"
    }
  },
  "Bent-Over Rear Delt Fly": {
    "description": {
      "overview": "A bent-over isolation exercise targeting rear deltoids with dumbbells. Essential for balanced shoulder development and posterior shoulder strength.",
      "setup": "Stand with feet hip-width, hinge at hips to near-parallel. Dumbbells hanging below chest, slight elbow bend. Back flat.",
      "movement": "Raise dumbbells out to sides in arc until arms parallel with floor. Squeeze rear delts at top. Lower with control.",
      "cues": "Lead with elbows, squeeze at top, maintain hip hinge, control descent"
    }
  },
  "Devil Press": {
    "description": {
      "overview": "A burpee combined with dumbbell snatch. High-intensity full-body movement combining push-up, jump, and overhead press for conditioning.",
      "setup": "Stand with dumbbells at sides. Ready for burpee movement with dumbbells.",
      "movement": "Place dumbbells on floor, jump back to plank, push-up, jump feet forward. Swing dumbbells between legs and snatch overhead in one motion. Lower and repeat.",
      "cues": "Burpee with dumbbells, swing through legs, powerful hip drive, full lockout overhead"
    }
  },
  "Dumbbell Clean": {
    "description": {
      "overview": "An explosive pulling movement bringing dumbbells from hang to shoulder catch. Builds total body power and teaches hip drive mechanics.",
      "setup": "Stand with feet hip-width, dumbbells at sides or hanging in front. Slight knee bend, chest up.",
      "movement": "Explosively extend hips and shrug, pulling dumbbells up body. Rotate elbows under to catch dumbbells at shoulders. Lower with control.",
      "cues": "Hip drive first, shrug and pull, fast elbows, soft catch"
    }
  },
  "Man Makers": {
    "description": {
      "overview": "A complex full-body exercise combining push-up, rows, clean, and thruster. Ultimate conditioning movement targeting all major muscle groups.",
      "setup": "Stand with dumbbells at sides. Ready to move through multiple positions.",
      "movement": "Place dumbbells, jump to plank, push-up, row each side, jump feet forward, clean dumbbells to shoulders, squat and press overhead. Lower and repeat.",
      "cues": "Push-up, row, row, clean, squat, press - one fluid sequence"
    }
  },
  "Prone Dumbbell W-Raise": {
    "description": {
      "overview": "A prone shoulder exercise with dumbbells forming W-shape. Targets rotator cuff and rear deltoids for shoulder stability and health.",
      "setup": "Lie face down on incline bench or floor. Light dumbbells in hands, elbows bent at 90 degrees forming W.",
      "movement": "Lift dumbbells by elevating elbows and hands, maintaining W-position. Squeeze shoulder blades at top. Lower with control.",
      "cues": "Maintain W-shape, light weight, squeeze between shoulder blades, controlled movement"
    }
  },
  "Dumbbell Snatch": {
    "description": {
      "overview": "An explosive single-arm movement taking dumbbell from floor to overhead. Builds total body power, coordination, and shoulder stability.",
      "setup": "Stand over dumbbell between feet, squat down to grip it. Chest up, back flat, one arm on dumbbell.",
      "movement": "Explosively extend hips and pull dumbbell up body close to torso. Punch overhead to lockout in one motion. Lower with control.",
      "cues": "Hip drive, pull close to body, punch to lockout, catch with straight arm"
    }
  },
  "Single-Arm Farmers Carry": {
    "description": {
      "overview": "A unilateral carry walking with weight in one hand. Builds grip strength, core stability, and anti-lateral flexion strength.",
      "setup": "Stand tall with heavy dumbbell in one hand. Shoulder packed, opposite side engaged to stay upright.",
      "movement": "Walk with controlled steps, maintaining upright posture. Don't lean toward or away from weight. Walk for distance, switch hands.",
      "cues": "Stay tall, don't lean, controlled steps, grip hard"
    }
  },
  "Incline Bench Dumbbell Row": {
    "description": {
      "overview": "A chest-supported row variation using incline bench. Eliminates lower back strain while isolating lats and rhomboids.",
      "setup": "Lie chest-down on incline bench. Dumbbells hanging below with arms extended. Feet on floor for stability.",
      "movement": "Row dumbbells to sides of ribcage, squeezing shoulder blades. Lower with control to full extension.",
      "cues": "Squeeze shoulder blades, pull to ribs, chest stays on bench, control descent"
    }
  },
  "Decline Push-ups": {
    "description": {
      "overview": "A push-up variation with feet elevated on box or bench. Increases upper chest and shoulder emphasis while adding difficulty.",
      "setup": "Hands on floor, feet on box or bench. Body straight from head to heels. Hands slightly wider than shoulders.",
      "movement": "Lower body toward floor, keeping body rigid. Descend until chest nearly touches floor. Push back up to start.",
      "cues": "Stay rigid, chest to floor, push through palms, core tight throughout"
    }
  },
  "Single-Leg Romanian Deadlift": {
    "description": {
      "overview": "A unilateral hip hinge challenging balance and posterior chain. Builds hamstring strength while improving proprioception and core stability.",
      "setup": "Stand on one leg, slight knee bend. Weight in opposite hand or both hands. Free leg ready to extend back.",
      "movement": "Hinge forward as back leg extends behind. Maintain straight line from head to heel. Return with control.",
      "cues": "Hips stay square, reach back with heel, feel hamstring stretch, controlled tempo"
    }
  },
  "Single-Leg Glute Bridge": {
    "description": {
      "overview": "Unilateral glute bridge targeting one side at a time. Addresses strength imbalances while building glute and hamstring strength.",
      "setup": "Lying on back, one foot planted, other leg extended or bent up. Arms at sides for stability.",
      "movement": "Drive through planted heel to lift hips up. Squeeze glute hard at top. Lower with control.",
      "cues": "Drive through heel, big glute squeeze, hips stay level, feel the working side"
    }
  },
  "Single-Leg Deadlift": {
    "description": {
      "overview": "Unilateral deadlift challenging balance and posterior chain. Builds hamstring strength while improving proprioception.",
      "setup": "Standing on one leg with weight in opposite hand. Free leg ready to extend behind.",
      "movement": "Hinge forward extending free leg back. Maintain straight line from head to heel. Drive up with control.",
      "cues": "Hips stay square, straight line head to heel, feel hamstring working, controlled balance"
    }
  },
  "Single-Leg RDL": {
    "description": {
      "overview": "Romanian deadlift performed on one leg. Challenges balance while building unilateral posterior chain strength.",
      "setup": "Standing on one leg, weight in opposite or same hand. Free leg ready to extend back.",
      "movement": "Hinge forward as back leg extends. Feel hamstring stretch in standing leg. Return with control.",
      "cues": "Hips hinge back, feel standing leg hamstring, balance and control, straight line"
    }
  },
  "Single-Arm Dumbbell Row": {
    "description": {
      "overview": "A unilateral rowing movement for back development. Allows heavy loading while providing stability, excellent for addressing imbalances.",
      "setup": "One hand and knee on bench, other foot planted wide. Flat back, dumbbell hanging straight down.",
      "movement": "Row dumbbell to hip, elbow close to body. Squeeze lat at top. Control the stretch at bottom.",
      "cues": "Elbow to hip, pull with back not arm, pause at top, stretch at bottom"
    }
  },
  "Single-Arm Overhead Carry + Reverse Lunge": {
    "description": {
      "overview": "Complex exercise combining unilateral carry with lunge. Challenges core stability, coordination, and full-body strength.",
      "setup": "Weight locked out overhead in one hand. Other hand free. Ready for controlled movement.",
      "movement": "Hold weight overhead while performing reverse lunges. Maintain overhead position throughout. Switch arms.",
      "cues": "Weight stays overhead, core stays tight, controlled lunges, don't let weight drift"
    }
  },
  "DB Chest Press": {
    "description": {
      "overview": "A dumbbell pressing movement allowing greater range of motion than barbell. Builds chest while improving stability and addressing imbalances.",
      "setup": "Dumbbells at chest level, palms forward. Shoulder blades retracted, feet planted.",
      "movement": "Press dumbbells up and together in arc motion. Control the deeper stretch at bottom. Squeeze at top.",
      "cues": "Arc motion not straight up, deep stretch, press and squeeze, control the weights"
    }
  },
  "DB Shoulder Press": {
    "description": {
      "overview": "A vertical pressing movement with dumbbells for shoulder development. Allows natural movement path and addresses strength imbalances between sides.",
      "setup": "Dumbbells at shoulder height, palms forward or neutral. Core braced, standing or seated.",
      "movement": "Press dumbbells overhead in slight arc. Weights come together at top. Control descent to shoulders.",
      "cues": "Press up and in, core stays tight, smooth arc path, control down"
    }
  },
  "DB Bicep Curls": {
    "description": {
      "overview": "An isolation exercise for bicep development using dumbbells. Allows supination through range of motion and addresses arm imbalances.",
      "setup": "Dumbbells at sides, palms forward or neutral start. Elbows at sides, shoulders back.",
      "movement": "Curl weights up with control, rotating palms up if starting neutral. Squeeze at top. Lower slowly.",
      "cues": "Elbows stay put, control the negative, full squeeze, no swinging"
    }
  },
  "DB Thrusters": {
    "description": {
      "overview": "A combination squat to overhead press in one fluid motion. Builds full-body power, conditioning, and coordination while challenging multiple muscle groups.",
      "setup": "Dumbbells at shoulders, elbows forward. Feet shoulder-width, ready to squat.",
      "movement": "Squat down with control. Drive up explosively, using momentum to press dumbbells overhead. One smooth motion.",
      "cues": "Use the bounce, smooth transition, full lockout, breathe at top"
    }
  },
  "DB Weighted Crunches": {
    "description": {
      "overview": "Traditional crunch with dumbbell for added resistance. Builds rectus abdominis strength through loaded flexion.",
      "setup": "Lying on back with knees bent. Dumbbell held at chest or behind head. Lower back neutral.",
      "movement": "Crunch up by flexing spine while holding weight. Feel abs contract. Lower with control.",
      "cues": "Flex the spine, feel abs working, control the weight, breathe out on crunch"
    }
  },
  "DB Burpees": {
    "description": {
      "overview": "Burpee variation holding dumbbells throughout movement. Increases difficulty and adds upper body loading.",
      "setup": "Standing with dumbbells at sides. Clear space for movement. Ready for high-intensity work.",
      "movement": "Perform burpee while holding dumbbells. Squat, jump back, push-up optional, jump forward, stand with press.",
      "cues": "Keep dumbbells throughout, controlled movements, explosive transitions, maintain form"
    }
  },
  "DB Pullover": {
    "description": {
      "overview": "Arc movement targeting lats and chest with serratus involvement. Unique exercise bridging upper body muscle groups.",
      "setup": "Lying across bench with shoulders on pad. Dumbbell held overhead with both hands. Hip sag for lat stretch.",
      "movement": "Lower weight in arc behind head feeling lat stretch. Pull back over chest using lats and chest.",
      "cues": "Big arc motion, feel lat stretch, sag hips slightly, pull with lats and chest"
    }
  },
  "DB Bench Press": {
    "description": {
      "overview": "Chest pressing exercise using dumbbells on bench. Allows greater range of motion and unilateral development.",
      "setup": "Dumbbells at chest level, lying on bench. Shoulder blades retracted, feet planted.",
      "movement": "Press dumbbells up and slightly together in arc motion. Lower to chest level with control.",
      "cues": "Arc motion up and together, deeper stretch than barbell, control heavy dumbbells"
    }
  },
  "DB High Pull": {
    "description": {
      "overview": "An explosive pulling movement from hip to chin targeting traps, rear delts, and upper back. Builds power and muscle thickness in the upper posterior chain.",
      "setup": "Stand with feet shoulder-width, dumbbells hanging in front of thighs. Slight knee bend, hips back slightly. Chest up.",
      "movement": "Explosively drive hips forward while pulling dumbbells to chin height. Lead with elbows high and wide. Lower with control and reset.",
      "cues": "Elbows high and wide, explosive hip drive, chin height, control the descent"
    }
  },
  "DB Upright Row": {
    "description": {
      "overview": "A vertical pulling exercise raising dumbbells to chin height. Targets traps and lateral delts for upper back and shoulder development.",
      "setup": "Stand with feet hip-width, dumbbells in front of thighs. Palms facing body, slight grip width.",
      "movement": "Pull dumbbells up toward chin, leading with elbows. Elbows go high and wide. Lower with control.",
      "cues": "Elbows lead, chin height, high and wide, control descent"
    }
  },
  "DB Face Pull": {
    "description": {
      "overview": "A bent-over pulling exercise targeting rear delts and upper back with external rotation. Builds shoulder health and postural strength.",
      "setup": "Stand with feet hip-width, hinge at hips. Dumbbells hanging below chest, palms facing back.",
      "movement": "Pull dumbbells toward face, driving elbows high and wide. Externally rotate at top. Lower with control.",
      "cues": "Elbows high and wide, external rotation, squeeze at top, maintain hip hinge"
    }
  },
  "DB Gorilla Row": {
    "description": {
      "overview": "A bent-over alternating row from deep squat position. Targets lats and rhomboids while challenging hip mobility and core stability.",
      "setup": "Wide stance over two dumbbells, deep squat position. Hands on dumbbells, chest up, back flat.",
      "movement": "Row one dumbbell to hip while pressing other into floor for stability. Lower and switch sides. Alternate continuously.",
      "cues": "Stay low in squat, row to hip, press down for stability, alternate smoothly"
    }
  },
  "DB Floor Press": {
    "description": {
      "overview": "A pressing exercise performed lying on floor limiting range of motion. Builds lockout strength and is shoulder-friendly chest pressing option.",
      "setup": "Lie on floor, knees bent, feet flat. Dumbbells at chest, elbows on floor at 45 degrees.",
      "movement": "Press dumbbells straight up until arms extended. Lower until triceps touch floor. Pause briefly, then press.",
      "cues": "Elbows touch floor, pause at bottom, press straight up, squeeze at top"
    }
  },
  "DB Skull Crushers": {
    "description": {
      "overview": "A lying tricep extension lowering dumbbells to temples. Isolates triceps through full range for arm development.",
      "setup": "Lie on bench, dumbbells held with arms extended over chest. Palms facing each other, elbows pointed up.",
      "movement": "Lower dumbbells by bending elbows toward temples. Keep upper arms stationary. Press back up, squeezing triceps.",
      "cues": "Elbows stationary, lower to temples, squeeze at top, control descent"
    }
  },
  "DB Tricep Kickback": {
    "description": {
      "overview": "A bent-over tricep isolation exercise extending arm behind body. Targets triceps at peak contraction for arm development.",
      "setup": "Hinge forward at hips, one hand on bench for support. Dumbbell in other hand, upper arm parallel to floor.",
      "movement": "Extend elbow to straighten arm behind you. Squeeze tricep at full extension. Lower with control without dropping elbow.",
      "cues": "Upper arm stays still, squeeze at extension, control descent, full straighten"
    }
  },
  "DB Overhead Tricep Extension": {
    "description": {
      "overview": "A tricep isolation exercise pressing dumbbell overhead. Targets long head of triceps through full stretch and contraction.",
      "setup": "Stand or sit, hold one dumbbell overhead with both hands cupping one end. Arms extended, elbows by ears.",
      "movement": "Lower dumbbell behind head by bending elbows. Feel stretch in triceps. Press back to start, squeezing triceps at top.",
      "cues": "Elbows stay by ears, full stretch, squeeze at top, control descent"
    }
  },
  "DB Lateral Raise": {
    "description": {
      "overview": "An isolation exercise raising dumbbells out to sides. Primary exercise for building middle deltoid width and shoulder definition.",
      "setup": "Stand with feet hip-width, dumbbells at sides, palms facing in. Slight elbow bend, core braced.",
      "movement": "Raise arms out to sides until parallel with floor. Lead with elbows slightly. Lower with control.",
      "cues": "Lead with elbows, stop at shoulder height, control descent, no swinging"
    }
  },
  "DB Front Raise": {
    "description": {
      "overview": "An isolation exercise raising dumbbells forward to shoulder height. Targets anterior deltoids for front shoulder development.",
      "setup": "Stand with feet hip-width, dumbbells at thighs, palms facing body. Slight elbow bend, core braced.",
      "movement": "Raise dumbbells forward to shoulder height, maintaining slight elbow bend. Lower with control without swinging.",
      "cues": "Stop at shoulder height, control descent, no momentum, alternate or together"
    }
  },
  "DB Squeeze Press": {
    "description": {
      "overview": "A chest press variation squeezing dumbbells together throughout movement. Maximizes pec activation through constant inward tension.",
      "setup": "Lie on bench, dumbbells touching at chest with neutral grip. Press dumbbells together hard throughout exercise.",
      "movement": "Press dumbbells up while maintaining inward squeezing pressure. Fully extend arms at top. Lower with constant squeeze.",
      "cues": "Squeeze together constantly, press and squeeze, maintain tension, feel the chest"
    }
  },
  "DB Romanian Deadlift": {
    "description": {
      "overview": "A hip hinge movement with dumbbells targeting hamstrings and glutes. Essential posterior chain exercise teaching proper hip hinge pattern.",
      "setup": "Stand with feet hip-width, dumbbells in front of thighs. Soft knee bend, chest up, shoulders back.",
      "movement": "Hinge at hips, pushing them back while lowering dumbbells along legs. Feel hamstring stretch. Drive hips forward to stand.",
      "cues": "Push hips back, slight knee bend, flat back, squeeze glutes at top"
    }
  },
  "DB Sumo Squat": {
    "description": {
      "overview": "A wide-stance squat holding dumbbell between legs. Emphasizes inner thighs and glutes with deep squat position.",
      "setup": "Wide stance, toes pointed out 45 degrees. Hold dumbbell with both hands between legs. Chest up, core braced.",
      "movement": "Push hips back and squat down between legs. Descend to depth, knees tracking toes. Drive through heels to stand.",
      "cues": "Knees track toes, sit deep, chest stays up, squeeze glutes at top"
    }
  },
  "DB Goblet Squat": {
    "description": {
      "overview": "A squat variation holding single dumbbell at chest goblet-style. Perfect for learning squat mechanics and building lower body strength.",
      "setup": "Hold dumbbell vertically at chest, cupping one end. Feet shoulder-width, toes slightly out. Core braced.",
      "movement": "Push hips back and squat down, keeping chest up and elbows inside knees. Descend to depth. Drive through heels to stand.",
      "cues": "Elbows inside knees, chest up, sit between feet, squeeze glutes at top"
    }
  },
  "DB Hip Thrust": {
    "description": {
      "overview": "A hip thrust using dumbbell resistance for glute development. Primary glute builder with full hip extension emphasis.",
      "setup": "Upper back on bench, feet flat on floor hip-width apart. Dumbbell on hip crease, hands securing it.",
      "movement": "Drive through heels to lift hips until body is straight from shoulders to knees. Squeeze glutes hard at top. Lower with control.",
      "cues": "Drive through heels, squeeze glutes hard, chin tucked, don't hyperextend"
    }
  },
  "DB Front Squat": {
    "description": {
      "overview": "A squat variation with dumbbells held at shoulders in front rack position. Emphasizes quads and core while teaching upright squat mechanics.",
      "setup": "Stand with feet shoulder-width, dumbbells at shoulders, elbows high. Core braced, chest up.",
      "movement": "Push hips back and squat down, keeping chest up and elbows high. Descend to parallel or below. Drive through heels to stand.",
      "cues": "Elbows up, chest proud, sit between legs, drive through heels"
    }
  },
  "DB Side Bend": {
    "description": {
      "overview": "A standing oblique exercise lowering dumbbell along leg. Targets obliques through lateral flexion for core development.",
      "setup": "Stand with feet shoulder-width, dumbbell in one hand at side. Other hand on hip or behind head. Stand tall.",
      "movement": "Lower dumbbell along leg by bending sideways at waist. Feel stretch in opposite oblique. Return to upright by contracting obliques.",
      "cues": "Bend sideways only, no twisting, feel the stretch, control both directions"
    }
  },
  "DB Woodchop": {
    "description": {
      "overview": "A rotational core exercise swinging dumbbell diagonally across body. Builds rotational power for sports and functional strength.",
      "setup": "Stand with feet wider than shoulder-width. Hold dumbbell with both hands. Start with dumbbell outside one hip.",
      "movement": "Rotate torso, swinging dumbbell diagonally up and across body to opposite shoulder. Control return to start. Complete reps then switch.",
      "cues": "Rotate from core, pivot feet, diagonal path, control the swing"
    }
  },
  "DB Dead Bug": {
    "description": {
      "overview": "A dead bug variation holding dumbbell for added anti-extension challenge. Builds core stability while coordinating opposite arm and leg movement.",
      "setup": "Lie on back, hold one dumbbell with both hands overhead. Knees bent at 90 degrees, shins parallel to floor. Low back pressed down.",
      "movement": "Lower opposite arm (with dumbbell) and leg toward floor while maintaining low back contact. Return to start and switch sides.",
      "cues": "Low back glued down, opposite arm and leg, controlled extension, breathe out as you lower"
    }
  },
  "DB Plank Pull-Through": {
    "description": {
      "overview": "A plank variation pulling dumbbell from side to side under body. Anti-rotation core exercise building stability and shoulder endurance.",
      "setup": "High plank position with dumbbell outside one hand. Feet wide for stability. Core braced, hips level.",
      "movement": "Reach under body with opposite hand to pull dumbbell to other side. Return hand to plank. Repeat to other side.",
      "cues": "Hips stay level, minimize rotation, wide feet, controlled pulls"
    }
  },
  "DB Hang Clean": {
    "description": {
      "overview": "An explosive clean starting from hang position at thighs. Develops hip power and clean technique with lighter load than full clean.",
      "setup": "Stand with dumbbells at thighs, slight knee bend. Chest up, shoulders over dumbbells.",
      "movement": "Dip slightly then explosively extend hips, shrugging and pulling dumbbells up body. Catch at shoulders with fast elbows. Lower to hang.",
      "cues": "Short dip, explosive hip drive, fast elbows under, soft catch at shoulders"
    }
  },
  "DB Reverse Lunge to Curl": {
    "description": {
      "overview": "A combination exercise pairing reverse lunge with bicep curl. Builds lower body strength and arm development in efficient compound movement.",
      "setup": "Stand with dumbbells at sides, palms facing in. Feet hip-width, core braced.",
      "movement": "Step back into reverse lunge while curling dumbbells. At bottom of lunge, biceps are contracted. Push back to start while lowering dumbbells.",
      "cues": "Step back and curl together, knee hovers, push through front heel, lower curl as you stand"
    }
  },
  "Single-Arm DB Press": {
    "description": {
      "overview": "Single-arm overhead press challenging core stability. Builds unilateral strength while forcing anti-lateral flexion.",
      "setup": "One dumbbell at shoulder height. Free hand can be on hip or at side. Core maximally engaged.",
      "movement": "Press one dumbbell overhead while resisting lean. Core works overtime to maintain vertical position.",
      "cues": "Don't lean, core on fire, press straight up, feel the anti-lean challenge"
    }
  },
  "Single-Arm DB Row": {
    "description": {
      "overview": "Single-arm dumbbell row for unilateral back development. Allows heavy loading with stability and eliminates compensation.",
      "setup": "One hand and knee on bench, other foot planted wide. Dumbbell hanging straight down from working arm.",
      "movement": "Row dumbbell to hip focusing on lat contraction. Minimize rotation. Feel strong lat squeeze at top.",
      "cues": "Hand to hip, no rotation, lat does the work, pause and squeeze at top"
    }
  },
  "Running": {
    "description": {
      "overview": "Fundamental cardiovascular exercise that builds aerobic endurance, burns calories, and improves overall conditioning. One of the most accessible cardio activities.",
      "setup": "Comfortable running shoes, appropriate clothing. Start on flat terrain. Begin with walk or light jog to warm up.",
      "movement": "Maintain steady pace, landing midfoot. Arms swing naturally opposite to legs. Breathe rhythmically, in through nose, out through mouth.",
      "cues": "Light feet, relaxed shoulders, steady breathing, eyes forward"
    }
  },
  "Jogging": {
    "description": {
      "overview": "Low-intensity steady-state cardiovascular exercise. Perfect for building aerobic base, active recovery, or beginners starting their fitness journey.",
      "setup": "Comfortable running shoes, flat surface preferred. Start with 5-minute walking warm-up.",
      "movement": "Maintain conversational pace where you can talk but not sing. Short strides, relaxed form. Breathe naturally.",
      "cues": "Easy pace, stay relaxed, breathe comfortably, enjoy the movement"
    }
  },
  "Cycling": {
    "description": {
      "overview": "Low-impact cardiovascular exercise that builds leg strength and endurance while being easy on joints. Great for all fitness levels.",
      "setup": "Adjust seat height so leg has slight bend at bottom of pedal stroke. Hands comfortable on handlebars.",
      "movement": "Pedal in smooth circles, applying power through the entire rotation. Maintain steady cadence, adjusting resistance as needed.",
      "cues": "Smooth circles, steady cadence, core engaged, relax grip"
    }
  },
  "Stationary Bike": {
    "description": {
      "overview": "Indoor cycling for controlled cardiovascular training. Allows precise intensity control and eliminates weather as a factor.",
      "setup": "Adjust seat height and handlebar position. Seat level with hip when standing beside bike.",
      "movement": "Pedal with consistent cadence. Vary resistance for different training zones. Maintain upright posture.",
      "cues": "Pedal through heel, steady rhythm, adjust resistance, stay seated"
    }
  },
  "Rowing Machine": {
    "description": {
      "overview": "Full-body cardiovascular exercise engaging legs, back, and arms. Low impact with high caloric burn and excellent conditioning benefits.",
      "setup": "Feet secured in footplates. Grip handle with relaxed overhand grip. Sit tall with arms extended.",
      "movement": "Drive with legs first, then lean back slightly, finally pull handle to lower ribs. Return in reverse order: arms, body, legs.",
      "cues": "Legs-back-arms, arms-back-legs, drive through heels, long strokes"
    }
  },
  "Jump Rope": {
    "description": {
      "overview": "High-intensity cardiovascular exercise that improves coordination, footwork, and conditioning. Burns significant calories in short time.",
      "setup": "Rope length: handles should reach armpits when standing on rope center. Elbows close to sides.",
      "movement": "Jump with small hops, just high enough for rope to pass. Wrists rotate the rope, not arms. Land softly on balls of feet.",
      "cues": "Small jumps, quick wrists, light landings, stay relaxed"
    }
  },
  "Double Unders": {
    "description": {
      "overview": "Advanced jump rope skill where rope passes under feet twice per jump. Develops explosive power, coordination, and cardiovascular endurance.",
      "setup": "Master regular jump rope first. Rope may need to be slightly shorter. Wrists must be very fast.",
      "movement": "Jump slightly higher than single unders. Rotate wrists twice as fast. Stay tight and compact.",
      "cues": "Higher jump, faster wrists, stay tight, core engaged"
    }
  },
  "Stair Climbing": {
    "description": {
      "overview": "Functional cardiovascular exercise using stairs or stair machine. Builds leg strength and endurance while mimicking daily activities.",
      "setup": "Find staircase or use stair climber machine. Start at moderate pace. Can use handrails for balance initially.",
      "movement": "Step up fully onto each stair. Drive through heel of working leg. Maintain upright posture.",
      "cues": "Full steps, drive through heels, stand tall, steady pace"
    }
  },
  "Elliptical": {
    "description": {
      "overview": "Low-impact full-body cardiovascular exercise. Provides running-like motion without impact stress on joints.",
      "setup": "Step onto pedals, grip handles. Adjust resistance and incline as desired. Stand tall.",
      "movement": "Push and pull with legs and arms in coordinated motion. Maintain steady rhythm. Keep core engaged.",
      "cues": "Smooth motion, core engaged, stand tall, use arms actively"
    }
  },
  "Swimming": {
    "description": {
      "overview": "Zero-impact full-body cardiovascular exercise. Excellent for joint health while building endurance and overall conditioning.",
      "setup": "Pool with appropriate depth. Comfortable swimwear and goggles. Warm up with easy laps.",
      "movement": "Choose stroke (freestyle, breaststroke, backstroke). Maintain consistent pace. Focus on technique and breathing rhythm.",
      "cues": "Streamlined body, rhythmic breathing, smooth strokes, relaxed but purposeful"
    }
  },
  "Battle Ropes": {
    "description": {
      "overview": "High-intensity conditioning exercise using heavy ropes. Develops shoulder endurance, core stability, and cardiovascular fitness.",
      "setup": "Anchor rope at center point. Stand in athletic stance facing anchor. Grip rope ends with palms down.",
      "movement": "Create waves by alternating arms up and down. Maintain athletic stance. Core stays braced throughout.",
      "cues": "Athletic stance, powerful waves, core tight, breathe rhythmically"
    }
  },
  "Assault Bike": {
    "description": {
      "overview": "Full-body air bike combining arm and leg work. Known for brutal conditioning due to increased resistance with more effort.",
      "setup": "Adjust seat height. Grip handles firmly. Feet secure on pedals. Start at moderate pace.",
      "movement": "Push and pull with arms while pedaling legs. Coordinate upper and lower body. Increase effort for more resistance.",
      "cues": "Arms and legs together, push through resistance, pace yourself, full effort"
    }
  },
  "Ski Erg": {
    "description": {
      "overview": "Upper-body focused cardiovascular machine mimicking cross-country skiing. Excellent for developing lat endurance and conditioning.",
      "setup": "Stand facing machine. Grip handles with palms down. Slight bend in knees, hinge forward at hips.",
      "movement": "Pull handles down forcefully while hinging deeper. Return with control. Focus on powerful lat engagement.",
      "cues": "Drive with lats, hinge at hips, explosive pull, controlled return"
    }
  },
  "Sprint Intervals": {
    "description": {
      "overview": "High-intensity interval training alternating between maximum effort sprints and recovery periods. Builds speed, power, and metabolic conditioning.",
      "setup": "Flat, safe running surface. Adequate warm-up of 10 minutes light cardio and dynamic stretches.",
      "movement": "Sprint at maximum effort for prescribed time. Recover with walking or light jogging. Repeat for prescribed sets.",
      "cues": "Max effort on sprints, full recovery between, pump arms, drive knees"
    }
  },
  "Hill Sprints": {
    "description": {
      "overview": "Sprint training on an incline for increased intensity and power development. Builds explosive leg power and cardiovascular capacity.",
      "setup": "Find moderate hill (6-10% grade). Mark start and finish points. Thorough warm-up required.",
      "movement": "Sprint up hill at maximum effort. Walk back down for recovery. Focus on driving knees high and pumping arms.",
      "cues": "Drive knees up, pump arms, stay forward, attack the hill"
    }
  },
  "Dead Hang": {
    "description": {
      "overview": "Passive hanging from pull-up bar to decompress spine, build grip strength, and stretch shoulders. Foundation for all bar exercises.",
      "setup": "Grip pull-up bar with overhand grip shoulder-width apart. Step off or jump to hang position.",
      "movement": "Allow body to hang relaxed with arms fully extended. Let shoulders elevate toward ears. Breathe deeply and relax.",
      "cues": "Relax everything, breathe deep, let gravity decompress, grip bar firmly"
    }
  },
  "Active Hang": {
    "description": {
      "overview": "Engaged hanging position with shoulders packed down and back. Develops scapular control and prepares for pulling movements.",
      "setup": "Start in dead hang position. Grip pull-up bar with overhand grip.",
      "movement": "Without bending elbows, pull shoulder blades down and back. Elevate chest slightly. Hold engaged position.",
      "cues": "Shoulders away from ears, chest up, squeeze back, arms stay straight"
    }
  },
  "L-Sit": {
    "description": {
      "overview": "Advanced isometric hold with legs extended parallel to ground. Develops extreme core and hip flexor strength plus pressing endurance.",
      "setup": "Hands on parallettes, dip bars, or floor. Arms locked out straight. Shoulders depressed.",
      "movement": "Lift legs to parallel with floor, keeping knees straight. Push hard through hands. Hold position with locked legs.",
      "cues": "Lock knees, point toes, push floor away, compress torso"
    }
  },
  "Tuck L-Sit": {
    "description": {
      "overview": "Regression of L-Sit with knees tucked to chest. Develops core and hip flexor strength while building toward full L-Sit.",
      "setup": "Hands on parallettes, dip bars, or floor. Arms locked out straight. Shoulders depressed.",
      "movement": "Lift knees toward chest, keeping them tight to body. Push hard through hands. Hold tucked position.",
      "cues": "Knees to chest, push floor away, round upper back, shoulders down"
    }
  },
  "Arch Hold": {
    "description": {
      "overview": "Posterior chain isometric hold strengthening lower back and glutes. Essential gymnastics conditioning and spinal health exercise.",
      "setup": "Lie face down on mat. Arms extended overhead. Legs straight together.",
      "movement": "Lift arms and legs simultaneously off ground. Squeeze glutes and lower back. Hold arch position.",
      "cues": "Lift arms and legs, squeeze glutes, look at floor, breathe"
    }
  },
  "Superman Hold": {
    "description": {
      "overview": "Full-body posterior chain isometric strengthening lower back, glutes, and shoulders. Builds spinal erector endurance.",
      "setup": "Lie face down on mat. Arms extended overhead, palms down. Legs straight.",
      "movement": "Simultaneously lift arms, chest, and legs off ground. Squeeze entire posterior chain. Hold elevated position.",
      "cues": "Lift everything, squeeze glutes, reach long, look at floor"
    }
  },
  "Glute Bridge Hold": {
    "description": {
      "overview": "Isometric hip extension hold targeting glutes and hamstrings. Develops hip strength and stability in extended position.",
      "setup": "Lie on back, knees bent, feet flat on floor hip-width apart. Arms at sides.",
      "movement": "Drive hips toward ceiling by squeezing glutes. Hold at top with straight line from shoulders to knees.",
      "cues": "Squeeze glutes hard, hips to ceiling, knees over ankles, breathe"
    }
  },
  "Horse Stance": {
    "description": {
      "overview": "Traditional martial arts isometric squat hold. Develops leg endurance, mental toughness, and lower body stability.",
      "setup": "Wide stance, feet parallel or slightly turned out. Weight evenly distributed. Arms extended forward or on hips.",
      "movement": "Sink into deep squat position, thighs parallel to floor. Knees track over toes. Hold position.",
      "cues": "Sink low, knees out, weight in heels, stay tall, breathe"
    }
  },
  "Chin-Up": {
    "description": {
      "overview": "Vertical pulling exercise with supinated (underhand) grip emphasizing biceps. Slightly easier than pull-ups for most people.",
      "setup": "Grip bar with palms facing you, hands shoulder-width apart. Hang with arms fully extended.",
      "movement": "Pull body up until chin clears bar, focusing on biceps and back. Lower with control.",
      "cues": "Pull elbows down, chin over bar, squeeze biceps, control descent"
    }
  },
  "Neutral Grip Pull-Up": {
    "description": {
      "overview": "Pull-up variation with palms facing each other. Most shoulder-friendly grip, works lats and biceps evenly.",
      "setup": "Grip parallel handles with palms facing each other. Hang with arms fully extended.",
      "movement": "Pull body up until chin clears handle level. Focus on lat engagement. Lower with control.",
      "cues": "Elbows to ribs, squeeze lats, chin up, controlled negative"
    }
  },
  "Muscle-Up": {
    "description": {
      "overview": "Advanced calisthenics movement transitioning from pull-up to dip. Requires significant pulling power and technique.",
      "setup": "Grip bar with overhand grip slightly wider than pull-ups. Start from dead hang. False grip optional.",
      "movement": "Explosive pull-up followed by aggressive lean forward. Transition chest over bar. Press to straight arms.",
      "cues": "Explosive pull, aggressive lean, chest over bar, push to lockout"
    }
  },
  "Toes to Bar": {
    "description": {
      "overview": "Hanging core exercise bringing toes to touch the bar. Develops hip flexor and core strength with active shoulder engagement.",
      "setup": "Hang from pull-up bar with arms extended. Engage shoulders by slightly pulling down.",
      "movement": "Swing legs up while compressing torso. Touch toes to bar between hands. Lower with control.",
      "cues": "Compress hard, toes to bar, active shoulders, control descent"
    }
  },
  "Hanging Knee Raise": {
    "description": {
      "overview": "Core exercise hanging from bar, driving knees toward chest. Develops hip flexor and lower ab strength.",
      "setup": "Hang from pull-up bar with arms extended. Engage shoulders slightly. Legs together.",
      "movement": "Raise knees toward chest by flexing hips. Hold briefly at top. Lower with control.",
      "cues": "Knees to chest, minimize swing, pause at top, slow negative"
    }
  },
  "Scapular Pull-Up": {
    "description": {
      "overview": "Activation exercise focusing on scapular depression and retraction. Develops shoulder stability and pull-up strength.",
      "setup": "Hang from pull-up bar with arms extended, shoulders relaxed toward ears.",
      "movement": "Without bending elbows, pull shoulder blades down and together. Elevate body slightly. Return to start.",
      "cues": "Arms stay straight, shoulders down and back, lift chest, squeeze at top"
    }
  },
  "Nordic Curl": {
    "description": {
      "overview": "Advanced eccentric hamstring exercise. One of the most effective exercises for hamstring strength and injury prevention.",
      "setup": "Kneel on pad with ankles secured under bar or held by partner. Body tall, core engaged.",
      "movement": "Lower body forward under control using only hamstrings. Catch yourself with hands, push back up.",
      "cues": "Stay tall, control the descent, hamstrings on fire, push back to start"
    }
  },
  "Sissy Squat": {
    "description": {
      "overview": "Knee-dominant squat variation isolating quadriceps. Provides intense quad stretch and contraction.",
      "setup": "Stand holding support for balance. Rise onto toes. Lean back slightly.",
      "movement": "Lower by bending knees forward while leaning torso back. Keep hips extended. Rise by straightening knees.",
      "cues": "Knees forward, lean back, stay on toes, squeeze quads"
    }
  },
  "Handstand Push-Up": {
    "description": {
      "overview": "Advanced vertical pressing movement using body weight. Builds significant shoulder and tricep strength.",
      "setup": "Kick up to handstand against wall. Hands slightly wider than shoulder-width. Arms locked out.",
      "movement": "Lower head toward floor by bending elbows. Press back to straight arms. Keep core tight throughout.",
      "cues": "Elbows track back, head to floor, press strong, stay tight"
    }
  },
  "Dip": {
    "description": {
      "overview": "Vertical pressing exercise targeting chest, triceps, and shoulders. Can be performed on parallel bars or rings.",
      "setup": "Support body on parallel bars or rings with arms locked out. Shoulders down, core engaged.",
      "movement": "Lower body by bending elbows until upper arms parallel to floor. Press back to lockout.",
      "cues": "Lean forward for chest, upright for triceps, control descent, full lockout"
    }
  }
}
